[
  {
    "chunk_id": 1,
    "text": "COMPANY: MSFT\nYEAR: None",
    "section": null,
    "type": "info",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 2,
    "text": "☒   ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "FORM 10-K",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 3,
    "text": "OR\n\n☐   TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "For the Fiscal Year Ended June 30, 2023",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 4,
    "text": "ONE MICROSOFT WAY, REDMOND, Washington 98052-6399\n\n(425) 882-8080\n\nwww.microsoft.com/investor",
    "section": "(STATE OF INCORPORATION)    (I.R.S. ID)",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 5,
    "text": "3.125% Notes due 2028                                          MSFT              Nasdaq\n\n2.625% Notes due 2033                                          MSFT              Nasdaq",
    "section": "Common stock, $0.00000625 par value per share                  MSFT              Nasdaq",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 6,
    "text": "We're committed to making the promise of AI real - and doing it responsibly. Our work is guided by a core set of principles: fairness, reliability and safety, privacy and security, inclusiveness, transparency, and accountability.",
    "section": "In a world of increasing economic complexity, AI has the power to revolutionize many types of work. Microsoft is now innovating and expanding our portfolio with AI capabilities to help people and organizations overcome today's challenges and emerge stronger. Customers are looking to unlock value from their digital spend and innovate for this next generation of AI, while simplifying security and management. Those leveraging the Microsoft Cloud are best positioned to take advantage of technological advancements and drive innovation. Our investment in AI spans the entire company, from Microsoft Teams and Outlook, to Bing and Xbox, and we are infusing generative AI capability into our consumer and commercial offerings to deliver copilot capability for all services across the Microsoft Cloud.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 7,
    "text": "Nuance, a leader in conversational AI and ambient intelligence across industries including healthcare, financial services, retail, and telecommunications, joined Microsoft in 2022. Microsoft and Nuance enable organizations to accelerate their business goals with security-focused, cloud-based solutions infused with AI.",
    "section": "Our hybrid infrastructure offers integrated, end-to-end security, compliance, identity, and management capabilities to support the real-world needs and evolving regulatory requirements of commercial customers and enterprises. Our industry clouds bring together capabilities across the entire Microsoft Cloud, along with industry-specific customizations. Azure Arc simplifies governance and management by delivering a consistent multi-cloud and on-premises management platform.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 8,
    "text": "GitHub Copilot is at the forefront of AI-powered software development, giving developers a new tool to write code easier and faster so they can focus on more creative problem-solving. From GitHub to Visual Studio, we provide a developer tool chain for everyone, no matter the technical experience, across all platforms, whether Azure, Windows, or any other cloud or client platform.",
    "section": "The ability to convert data into AI drives our competitive advantage. The Microsoft Intelligent Data Platform is a leading cloud data platform that fully integrates databases, analytics, and governance. The platform empowers organizations to invest more time creating value rather than integrating and managing their data. Microsoft Fabric is an end-to-end, unified analytics platform that brings together all the data and analytics tools that organizations need.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 9,
    "text": "Additionally, we are extending our infrastructure beyond the planet, bringing cloud computing to space. Azure Orbital is a fully managed ground station as a service for fast downlinking of data.",
    "section": "Windows also plays a critical role in fueling our cloud business with Windows 365, a desktop operating system that's also a cloud service. From another internet-connected device, including Android or macOS devices, users can run Windows 365, just like a virtual machine.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 10,
    "text": "Microsoft's approach to addressing climate change starts with the sustainability of our own business. In 2020, we committed to being a carbon negative, water positive, and zero waste company by 2030.",
    "section": "Commitment to Sustainability",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 11,
    "text": "A few examples of our continued progress include:\n\n•",
    "section": "In May 2023, we released our Environmental Sustainability Report which looked back at our progress during fiscal year 2022. We continued to make progress on our goals, with our overall emissions declining by 0.5 percent. While our Scope 1 and Scope 2 emissions continued to decline, Scope 3 emissions increased by 0.5 percent. Scope 3 represented 96 percent of our total emissions, resulting primarily from the operations of our suppliers and the use of our products across our customers.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 12,
    "text": "Microsoft's culture is grounded in growth mindset. This means everyone is on a continuous journey to learn and grow, operating as one company instead of multiple siloed businesses.",
    "section": "Our Culture",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 13,
    "text": "•\n\nLinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, and Sales Solutions.\n\n•",
    "section": "Office Consumer, including Microsoft 365 Consumer subscriptions, Office licensed on-premises, and other Office services.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 14,
    "text": "LinkedIn\n\nLinkedIn connects the world's professionals to make them more productive and successful and transforms the way companies hire, market, sell, and learn. Our vision is to create economic opportunity for every member of the global workforce through the ongoing development of the world's first Economic Graph, a digital representation of the global economy. In addition to LinkedIn's free services, LinkedIn offers monetized solutions: Talent Solutions, Marketing Solutions, Premium Subscriptions, and Sales Solutions. Talent Solutions provide insights for workforce planning and tools to hire, nurture, and develop talent. Talent Solutions also includes Learning Solutions, which help businesses close critical skills gaps in times where companies are having to do more with existing talent. Marketing Solutions help companies reach, engage, and convert their audiences at scale. Premium Subscriptions enable professionals to manage their professional identity, grow their network, find jobs, and connect with talent through additional services like premium search. Sales Solutions help companies strengthen customer relationships, empower teams with digital selling tools, and acquire new opportunities. LinkedIn has over 950 million members and has offices around the globe. Growth will depend on our ability to increase the number of LinkedIn members and our ability to continue offering services that provide value for our members and increase their engagement. LinkedIn revenue is mainly affected by demand from enterprises and professional organizations for subscriptions to Talent Solutions, Sales Solutions, and Premium Subscriptions offerings, as well as member engagement and the quality of the sponsored content delivered to those members to drive Marketing Solutions.",
    "section": "Item 1",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 15,
    "text": "LinkedIn faces competition from online professional networks, recruiting companies, talent management companies, and larger companies that are focusing on talent management and human resource services; job boards; traditional recruiting firms; and companies that provide learning and development products and services. Marketing Solutions competes with online and offline outlets that generate revenue from advertisers and marketers, and Sales Solutions competes with online and offline outlets for companies with lead generation and customer intelligence and insights.",
    "section": "Competitors to Office include software and global application vendors, such as Apple, Cisco Systems, Meta, Google, Okta, Proofpoint, Slack, Symantec, Zoom, and numerous web-based and mobile application competitors as well as local application developers. Apple distributes versions of its pre-installed application software, such as email and calendar products, through its PCs, tablets, and phones. Cisco Systems is using its position in enterprise communications equipment to grow its unified communications business. Meta offers communication tools to enable productivity and engagement within organizations. Google provides a hosted messaging and productivity suite. Slack provides teamwork and collaboration software. Zoom offers videoconferencing and cloud phone solutions. Okta, Proofpoint, and Symantec provide security solutions across email security, information protection, identity, and governance. Web-based offerings competing with individual applications have also positioned themselves as alternatives to our products and services. We compete by providing powerful, flexible, secure, integrated industry-specific, and easy-to-use productivity and collaboration tools and services that create comprehensive solutions and work well with technologies our customers already have both on-premises or in the cloud.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 16,
    "text": "•\n\nWindows, including Windows OEM licensing (\"Windows OEM\") and other non-volume licensing of the Windows operating system; Windows Commercial, comprising volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; and Windows IoT.\n\n•\n\nDevices, including Surface, HoloLens, and PC accessories.\n\n•\n\nGaming, including Xbox hardware and Xbox content and services, comprising first- and third-party content (including games and in-game content), Xbox Game Pass and other subscriptions, Xbox Cloud Gaming, advertising, third-party disc royalties, and other cloud services.\n\n•",
    "section": "Our More Personal Computing segment consists of products and services that put customers at the center of the experience with our technology. This segment primarily comprises:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 17,
    "text": "•\n\nLinkedIn - focuses on our services that transform the way professionals grow their network and find jobs and the way businesses hire, market, sell, and learn.\n\n•",
    "section": "Technology and Research - focuses on fundamental research, product and business incubations, and forward-looking AI innovations that span infrastructure, services, and applications.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 18,
    "text": "SA conveys rights to new software and upgrades for perpetual licenses released over the contract period. It also provides support, tools, training, and other licensing benefits to help customers deploy and use software efficiently. SA is included with certain volume licensing agreements and is an optional purchase with others.",
    "section": "We offer options for organizations that want to purchase our cloud services, on-premises software, and SA. We license software to organizations under volume licensing agreements to allow the customer to acquire multiple licenses of products and services instead of having to acquire separate licenses through retail channels. We use different programs designed to provide flexibility for organizations of various sizes. While these programs may differ in various parts of the world, generally they include those discussed below.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 19,
    "text": "A Microsoft Customer Agreement is a simplified purchase agreement presented, accepted, and stored through a digital experience. A Microsoft Customer Agreement is a non-expiring agreement that is designed to support all customers over time, whether purchasing through a partner or directly from Microsoft.",
    "section": "Microsoft Customer Agreement",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 20,
    "text": "A Microsoft Online Subscription Agreement is designed for small and medium organizations that want to subscribe to, activate, provision, and maintain cloud services seamlessly and directly via the web. The agreement allows customers to acquire monthly or annual subscriptions for cloud-based services.",
    "section": "Microsoft Online Subscription Agreement",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 21,
    "text": "A Select Plus agreement is designed for government and academic organizations to acquire on-premises licenses at any affiliate or department level, while realizing advantages as one organization. Organizations purchase perpetual licenses and SA is optional.",
    "section": "Select Plus",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 22,
    "text": "Mr. Nadella was appointed Chairman of the Board in June 2021 and Chief Executive Officer in February 2014. He served as Executive Vice President, Cloud and Enterprise from July 2013 until that time. From 2011 to 2013, Mr. Nadella served as President, Server and Tools. From 2009 to 2011, he was Senior Vice President, Online Services Division. From 2008 to 2009, he was Senior Vice President, Search, Portal, and Advertising. Since joining Microsoft in 1992, Mr. Nadella's roles also included Vice President of the Business Division. Mr. Nadella also serves on the Board of Directors of Starbucks Corporation.\n\nMr. Althoff was appointed Executive Vice President and Chief Commercial Officer in July 2021. He served as Executive Vice President, Worldwide Commercial Business from July 2017 until that time. Prior to that, Mr. Althoff served as the President of Microsoft North America. Mr. Althoff joined Microsoft in March 2013 as President of Microsoft North America.\n\n20\n\n* * *",
    "section": "Christopher D. Young             51                               Executive Vice President, Business Development, Strategy, and Ventures",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 23,
    "text": "Mr. Capossela was appointed Executive Vice President, Marketing and Consumer Business, and Chief Marketing Officer in July 2016. He had served as Executive Vice President, Chief Marketing Officer since March 2014.Since joining Microsoft in 1991, Mr. Capossela has held a variety of marketing leadership roles in the Consumer Channels Group, and in the Microsoft Office Division where he was responsible for marketing productivity solutions including Microsoft Office, Office 365, SharePoint, Exchange, Skype for Business, Project, and Visio.\n\nMs. Hogan was appointed Executive Vice President, Human Resources in November 2014. Prior to that Ms. Hogan was Corporate Vice President of Microsoft Services. She also served as Corporate Vice President of Customer Service and Support. Ms. Hogan joined Microsoft in 2003. Ms. Hogan also serves on the Board of Directors of Alaska Air Group, Inc.\n\nMs. Hood was appointed Executive Vice President and Chief Financial Officer in July 2013, subsequent to her appointment as Chief Financial Officer in May 2013. From 2010 to 2013, Ms. Hood was Chief Financial Officer of the Microsoft Business Division. Since joining Microsoft in 2002, Ms. Hood has also held finance-related positions in the Server and Tools Business and the corporate finance organization. Ms. Hood also serves on the Board of Directors of 3M Corporation.\n\nMr. Smith was appointed Vice Chair and President in September 2021. Prior to that, he served as President and Chief Legal Officer since September 2015. He served as Executive Vice President, General Counsel, and Secretary from 2011 to 2015, and served as Senior Vice President, General Counsel, and Secretary from 2001 to 2011. Mr. Smith was also named Chief Compliance Officer in 2002. Since joining Microsoft in 1993, he was Deputy General Counsel for Worldwide Sales and previously was responsible for managing the European Law and Corporate Affairs Group, based in Paris. Mr. Smith also serves on the Board of Directors of Netflix, Inc.\n\nMr. Young has served as Executive Vice President, Business Development, Strategy, and Ventures since joining Microsoft in November 2020. Prior to Microsoft, he served as the Chief Executive Officer of McAfee, LLC from 2017 to 2020, and served as a Senior Vice President and General Manager of Intel Security Group from 2014 until 2017, when he led the initiative to spin out McAfee into a standalone company. Mr. Young also serves on the Board of Directors of American Express Company.\n\n21\n\n* * *",
    "section": "Item 1",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 24,
    "text": "•\n\nA competing vertically-integrated model, in which a single firm controls the software and hardware elements of a product and related services, has succeeded with some consumer products such as personal computers, tablets, phones, gaming consoles, wearables, and other endpoint devices. Competitors pursuing this model also earn revenue from services integrated with the hardware and software platform, including applications and content sold through their integrated marketplaces. They may also be able to claim security and performance benefits from their vertically integrated offer. We also offer some vertically-integrated hardware and software products and services. To the extent we shift a portion of our business to a vertically integrated model we increase our cost of revenue and reduce our operating margins.\n\n•",
    "section": "An important element of our business model has been to create platform-based ecosystems on which many participants can build diverse solutions. A well-established ecosystem creates beneficial network effects among users, application developers, and the platform provider that can accelerate growth. Establishing significant scale in the marketplace is necessary to achieve and maintain attractive margins. We face significant competition from firms that provide competing platforms.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 25,
    "text": "Acquisitions, joint ventures, and strategic alliances may have an adverse effect on our business. We expect to continue making acquisitions and entering into joint ventures and strategic alliances as part of our long-term business strategy. For example, in March 2021 we completed our acquisition of ZeniMax Media Inc. for $8.1 billion, and in March 2022 we completed our acquisition of Nuance Communications, Inc. for $18.8 billion. In January 2022 we announced a definitive agreement to acquire Activision Blizzard, Inc. for $68.7 billion. In January 2023 we announced the third phase of our OpenAI strategic partnership. Acquisitions and other transactions and arrangements involve significant challenges and risks, including that they do not advance our business strategy, that we get an unsatisfactory return on our investment, that they raise new compliance-related obligations and challenges, that we have difficulty integrating and retaining new employees, business systems, and technology, that they distract management from our other businesses, or that announced transactions may not be completed. If an arrangement fails to adequately anticipate changing circumstances and interests of a party, it may result in early termination or renegotiation of the arrangement. The success of these transactions and arrangements will depend in part on our ability to leverage them to enhance our existing products and services or develop compelling new ones, as well as acquired companies' ability to meet our policies and processes in areas such as data governance, privacy, and cybersecurity. It may take longer than expected to realize the full benefits from these transactions and arrangements such as increased revenue or enhanced efficiencies, or the benefits may ultimately be smaller than we expected. These events could adversely affect our consolidated financial statements.\n\n25\n\n* * *",
    "section": "Developing new technologies is complex. It can require long development and testing periods. Significant delays in new releases or significant problems in creating new products or services could adversely affect our revenue.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 26,
    "text": "LinkedIn revenue growth                                         Revenue from LinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, and Sales Solutions",
    "section": "Dynamics products and cloud services revenue growth             Revenue from Dynamics products and cloud services, including Dynamics 365, comprising a set of intelligent, cloud-based applications across ERP, CRM (including Customer Insights), Power Apps, and Power Automate; and on-premises ERP and CRM applications",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 27,
    "text": "(In millions, except percentages and per share amounts)    2023      2022      Percentage",
    "section": "SUMMARY RESULTS OF OPERATIONS",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 28,
    "text": "Revenue, gross margin, and operating income included an unfavorable foreign currency impact of 4%, 4%, and 6%, respectively. Cost of revenue and operating expenses both included a favorable foreign currency impact of 2%.",
    "section": "Operating income increased $5.1 billion or 6% driven by growth in Productivity and Business Processes and Intelligent Cloud and the change in accounting estimate, offset in part by a decline in More Personal Computing.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 29,
    "text": "•\n\nLinkedIn revenue increased $1.3 billion or 10% driven by Talent Solutions.\n\n•",
    "section": "Office Consumer products and cloud services revenue increased $140 million or 2%. Microsoft 365 Consumer subscribers grew 12% to 67.0 million.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 30,
    "text": "Revenue, gross margin, and operating income included an unfavorable foreign currency impact of 5%, 5%, and 8%, respectively.",
    "section": "Operating expenses increased $1.3 billion or 7% driven by investment in LinkedIn and employee severance expenses.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 31,
    "text": "Revenue, gross margin, and operating income included an unfavorable foreign currency impact of 4%, 4%, and 6%, respectively. Operating expenses included a favorable foreign currency impact of 2%.",
    "section": "Operating expenses increased $4.2 billion or 21% driven by investments in Azure, 4 points of growth from the Nuance acquisition, and employee severance expenses.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 32,
    "text": "Revenue, gross margin, and operating income included an unfavorable foreign currency impact of 3%, 4%, and 6%, respectively. Operating expenses included a favorable foreign currency impact of 2%.\n\n46\n\n* * *",
    "section": "Operating expenses decreased $195 million or 2% driven by a decline in Devices, offset in part by investments in Search and news advertising, including 2 points of growth from the Xandr acquisition.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 33,
    "text": "(In millions, except percentages and per share amounts)    2023      2022      Percentage",
    "section": "The following table reconciles our financial results reported in accordance with GAAP to non-GAAP financial results:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 34,
    "text": "Severance, hardware-related impairment, and lease consolidation costs       152             0               *",
    "section": "Gross margin                                                             $  146,052      $  135,620         8%",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 35,
    "text": "Severance, hardware-related impairment, and lease consolidation costs       1,171           0               *",
    "section": "Operating income                                                         $  88,523       $  83,383          6%",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 36,
    "text": "Severance, hardware-related impairment, and lease consolidation costs       946             0               *",
    "section": "Net income                                                               $  72,361       $  72,738          (1)%",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 37,
    "text": "Severance, hardware-related impairment, and lease consolidation costs       0.13            0               *",
    "section": "Diluted earnings per share                                               $  9.68         $  9.65            0%",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 38,
    "text": "Cash, Cash Equivalents, and Investments\n\nCash, cash equivalents, and short-term investments totaled $111.3 billion and $104.8 billion as of June 30, 2023 and 2022, respectively. Equity investments were $9.9 billion and $6.9 billion as of June 30, 2023 and 2022, respectively. Our short-term investments are primarily intended to facilitate liquidity and capital preservation. They consist predominantly of highly liquid investment-grade fixed-income securities, diversified among industries and individual issuers. The investments are predominantly U.S. dollar-denominated securities, but also include foreign currency-denominated securities to diversify risk. Our fixed-income investments are exposed to interest rate risk and credit risk. The credit risk and average maturity of our fixed-income portfolio are managed to achieve economic returns that correlate to certain fixed-income indices. The settlement risk related to these investments is insignificant given that the short-term investments held are primarily highly liquid investment-grade fixed-income securities.",
    "section": "We expect existing cash, cash equivalents, short-term investments, cash flows from operations, and access to capital markets to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities, such as dividends, share repurchases, debt maturities, material capital expenditures, and the transition tax related to the Tax Cuts and Jobs Act (\"TCJA\"), for at least the next 12 months and thereafter for the foreseeable future.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 39,
    "text": "A majority of our investments are priced by pricing vendors and are generally Level 1 or Level 2 investments as these vendors either provide a quoted market price in an active market or use observable inputs for their pricing without applying significant adjustments. Broker pricing is used mainly when a quoted price is not available, the investment is not priced by our pricing vendors, or when a broker price is more reflective of fair values in the market in which the investment trades. Our broker-priced investments are generally classified as Level 2 investments because the broker prices these investments based on similar assets without applying significant adjustments. In addition, all our broker-priced investments have a sufficient level of trading volume to demonstrate that the fair values used are appropriate for these investments. Our fair value processes include controls that are designed to ensure appropriate fair values are recorded. These controls include model validation, review of key model inputs, analysis of period-over-period fluctuations, and independent recalculation of prices where appropriate.",
    "section": "In general, and where applicable, we use quoted prices in active markets for identical assets or liabilities to determine the fair value of our financial instruments. This pricing methodology applies to our Level 1 investments, such as U.S. government securities, common and preferred stock, and mutual funds. If quoted prices in active markets for identical assets or liabilities are not available to determine fair value, then we use quoted prices for similar assets and liabilities or inputs other than the quoted prices that are observable either directly or indirectly. This pricing methodology applies to our Level 2 investments, such as commercial paper, certificates of deposit, U.S. agency securities, foreign government bonds, mortgage- and asset-backed securities, corporate notes and bonds, and municipal securities. Level 3 investments are valued using internally-developed models with unobservable inputs. Assets and liabilities measured at fair value on a recurring basis using unobservable inputs are an immaterial portion of our portfolio.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 40,
    "text": "(In millions)                                                   2024            Thereafter              Total\n\n\nLong-term debt: (a)",
    "section": "The following table summarizes the payments due by fiscal year for our outstanding contractual obligations as of June 30, 2023:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 41,
    "text": "Short-term income taxes                                                                           4,152                4,067\n\nShort-term unearned revenue                                                                       50,901               45,538",
    "section": "Accrued compensation                                                                              11,009               10,661",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 42,
    "text": "Long-term debt                                                                                    41,990               47,032\n\nLong-term income taxes                                                                            25,560               26,069\n\nLong-term unearned revenue                                                                        2,912                2,870",
    "section": "Total current liabilities                                                                         104,149              95,082",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 43,
    "text": "Depreciation, amortization, and other                                                                 13,861               14,460              11,686\n\nStock-based compensation expense                                                                      9,611                7,502               6,118",
    "section": "Adjustments to reconcile net income to net cash from operations:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 44,
    "text": "Other, net                                                                                            (1,006   )           (863     )          (769     )",
    "section": "Common stock cash dividends paid                                                                      (19,800  )           (18,135  )          (16,521  )",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 45,
    "text": "Other, net                                                                                            (3,116   )           (2,825   )          (922     )",
    "section": "Sales of investments                                                                                  14,354               28,443              14,008",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 46,
    "text": "Balance, beginning of period                     $     86,939            $  83,111           $  80,552",
    "section": "Common stock and paid-in capital",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 47,
    "text": "Stock-based compensation expense                       9,611                7,502               6,118\n\nOther, net                                             (2       )           173                 17\n\n\nBalance, end of period                                 93,718               86,939              83,111",
    "section": "Common stock repurchased                               (4,696   )           (5,688   )          (5,539   )",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 48,
    "text": "Balance, beginning of period                           (4,678   )           1,822               3,186",
    "section": "Accumulated other comprehensive income (loss)",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 49,
    "text": "Balance, end of period                                 (6,343   )           (4,678   )          1,822",
    "section": "Cumulative effect of accounting changes                0                    0                   10",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 50,
    "text": "Balance, beginning of period    $  710        $  798        $  816",
    "section": "Year Ended June 30,                2023          2022          2021",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 51,
    "text": "Write-offs                         (252  )       (245  )       (252  )\n\n\nBalance, end of period          $  716        $  710        $  798",
    "section": "Charged to costs and other         258           157           234",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 52,
    "text": "ROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we generally use our incremental borrowing rate based on the estimated rate of interest for collateralized borrowing over a similar term of the lease payments at commencement date. The operating lease ROU asset also includes any lease payments made and excludes lease incentives. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term.",
    "section": "Item 8",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 53,
    "text": "Anti-dilutive stock-based awards excluded from the calculations of diluted EPS were immaterial during the periods presented.\n\n70\n\n* * *",
    "section": "Diluted (A/C)                                              $     9.68            $  9.65            $  8.05",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 54,
    "text": "(In millions)                                                   Fair ValueLevel             AdjustedCost Basis             UnrealizedGains       UnrealizedLosses      RecordedBasis             Cashand CashEquivalents     Short-termInvestments      EquityInvestments",
    "section": "The components of investments were as follows:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 55,
    "text": "U.S. government securities                                                       Level 1                           65,237                        2                                    (3,870  )                              61,369                                        2,991          58,378         0\n\nU.S. agency securities                                                           Level 2                           2,703                         0                                    0                                      2,703                                         894            1,809          0",
    "section": "Certificates of deposit                                                          Level 2                           2,701                         0                                    0                                      2,701                                         2,657          44             0",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 56,
    "text": "Mortgage- and asset-backed securities                                            Level 2                           824                           1                                    (39     )                              786                                           0              786            0",
    "section": "Foreign government bonds                                                         Level 2                           498                           1                                    (24     )                              475                                           0              475            0",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 57,
    "text": "(In millions)                                                   Fair ValueLevel             AdjustedCost Basis             UnrealizedGains       UnrealizedLosses      RecordedBasis             Cashand CashEquivalents     Short-termInvestments      EquityInvestments",
    "section": "Item 8",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 58,
    "text": "U.S. government securities                                                       Level 1                           79,696                        29                                   (2,178  )                              77,547                                        9              77,538         0\n\nU.S. agency securities                                                           Level 2                           419                           0                                    (9      )                              410                                           0              410            0",
    "section": "Certificates of deposit                                                          Level 2                           2,071                         0                                    0                                      2,071                                         2,032          39             0",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 59,
    "text": "Mortgage- and asset-backed securities                                            Level 2                           727                           1                                    (30     )                              698                                           0              698            0",
    "section": "Foreign government bonds                                                         Level 2                           506                           0                                    (24     )                              482                                           0              482            0",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 60,
    "text": "U.S. government and agency securities    $                    7,950                               $           (336  )    $  45,273           $  (3,534  )    $  53,223      $  (3,870  )",
    "section": "June 30, 2023",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 61,
    "text": "Mortgage- and asset-backed securities                         257                                             (5    )       412                 (34     )       669            (39     )",
    "section": "Foreign government bonds                                      77                                              (5    )       391                 (19     )       468            (24     )",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 62,
    "text": "U.S. government and agency securities    $  59,092                    $  (1,835      )             $  2,210      $  (352  )    $  61,302      $  (2,187  )",
    "section": "June 30, 2022",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 63,
    "text": "Mortgage- and asset-backed securities       510                          (26         )                41            (4    )       551            (30     )",
    "section": "Foreign government bonds                    418                          (18         )                27            (6    )       445            (24     )",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 64,
    "text": "Short-term investments                                      $                 6                              $                 0                              $  8          $  0",
    "section": "Reported as",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 65,
    "text": "(In millions)             Level 1         Level 2           Level 3        Total",
    "section": "The following table presents the fair value of our derivatives instruments on a gross basis:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 66,
    "text": "(In millions, except average life)    Amount           WeightedAverage Life\n\n\nCustomer-related                      $       2,610                          9 years\n\nTechnology-based                              1,540                          5 years\n\nMarketing-related                             215                            4 years",
    "section": "Following are the details of the purchase price allocated to the intangible assets acquired:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 67,
    "text": "(In millions, except average life)    Amount           WeightedAverage Life\n\n\nTechnology-based                      $       1,341                          4 years\n\nMarketing-related                             627                            11 years",
    "section": "Following are details of the purchase price allocated to the intangible assets acquired:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 68,
    "text": "(In millions)      June 30,2021        Acquisitions        Other        June 30,2022        Acquisitions        Other        June 30,\n\n2023",
    "section": "Changes in the carrying amount of goodwill were as follows:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 69,
    "text": "Technology-based     $  11,245      $  (7,589   )       $  3,656      $  11,277          $  (6,958   )    $  4,319\n\nCustomer-related        7,281          (4,047   )          3,234         7,342              (3,171   )       4,171\n\nMarketing-related       4,935          (2,473   )          2,462         4,942              (2,143   )       2,799\n\nContract-based          29             (15      )          14            16                 (7       )       9",
    "section": "June 30,                                        2023                               2022",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 70,
    "text": "(In millions)          Amount         WeightedAverage Life             Amount       WeightedAverage Life",
    "section": "The components of intangible assets acquired during the periods presented were as follows:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 71,
    "text": "Technology-based       $       522                            7 years            $  2,611                       4 years\n\nCustomer-related               0                              0 years               2,837                       9 years\n\nMarketing-related              7                              5 years               233                         4 years\n\nContract-based                 12                             3 years               0                           0 years",
    "section": "Year Ended June 30,    2023                                            2022",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 72,
    "text": "2024                    $  2,363\n\n2025                       1,881\n\n2026                       1,381\n\n2027                       929\n\n2028                       652",
    "section": "Year Ending June 30,",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 73,
    "text": "(In millions, issuance by calendar year)    Maturities(calendar year)        Stated InterestRate          Effective InterestRate         June 30,2023           June 30,2022\n\n\n2009 issuance of $3.8 billion                                                                     2039                                                 5.20%                             5.24%             $  520         $  520\n\n2010 issuance of $4.8 billion                                                                     2040                                                 4.50%                             4.57%                486            486\n\n2011 issuance of $2.3 billion                                                                     2041                                                 5.30%                             5.36%                718            718\n\n2012 issuance of $2.3 billion                                                                     2042                                                 3.50%                             3.57%                454            1,204\n\n2013 issuance of $5.2 billion                                          2023  -                    2043                            3.63%  -             4.88%                  3.73%   -  4.92%                1,814          2,814\n\n2013 issuance of €4.1 billion                                          2028  -                    2033                            2.63%  -             3.13%                  2.69%   -  3.22%                2,509          2,404\n\n2015 issuance of $23.8 billion                                         2025  -                    2055                            2.70%  -             4.75%                  2.77%   -  4.78%                9,805          10,805\n\n2016 issuance of $19.8 billion                                         2023  -                    2056                            2.00%  -             3.95%                  2.10%   -  4.03%                9,430          9,430\n\n2017 issuance of $17.0 billion                                         2024  -                    2057                            2.88%  -             4.50%                  3.04%   -  4.53%                8,945          8,945\n\n2020 issuance of $10.0 billion                                         2050  -                    2060                            2.53%  -             2.68%                  2.53%   -  2.68%                10,000         10,000\n\n2021 issuance of $8.2 billion                                          2052  -                    2062                            2.92%  -             3.04%                  2.92%   -  3.04%                8,185          8,185",
    "section": "The components of debt were as follows:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 74,
    "text": "2024                    $  5,250\n\n2025                       2,250\n\n2026                       3,000\n\n2027                       8,000\n\n2028                       0",
    "section": "Year Ending June 30,",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 75,
    "text": "U.S. federal                  $     14,009           $  8,329           $  3,285\n\nU.S. state and local                2,322               1,679              1,229",
    "section": "Current Taxes",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 76,
    "text": "U.S. federal                  $     (6,146  )        $  (4,815  )       $  25\n\nU.S. state and local                (477    )           (1,062  )          (204   )",
    "section": "Deferred Taxes",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 77,
    "text": "U.S. and foreign components of income before income taxes were as follows:\n\n\n\n(In millions)",
    "section": "Item 8",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 78,
    "text": "Stock-based compensation expense                          $     681               $  601\n\nAccruals, reserves, and other expenses                          3,131                2,874",
    "section": "Deferred Income Tax Assets",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 79,
    "text": "Book/tax basis differences in investments and debt              373                  0",
    "section": "Unearned revenue                                                3,296                2,876",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 80,
    "text": "Book/tax basis differences in investments and debt        $     0                 $  (174    )",
    "section": "Deferred Income Tax Liabilities",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 81,
    "text": "Long-term deferred income tax liabilities                       (433     )           (230    )",
    "section": "Other long-term assets                                    $     20,163            $  13,515",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 82,
    "text": "Right-of-use assets obtained in exchange for lease obligations:",
    "section": "Financing cash flows from finance leases                                         1,056            896              648",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 83,
    "text": "(In millions, except lease term and discount rate)",
    "section": "Supplemental balance sheet information related to leases was as follows:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 84,
    "text": "2024                     $                 2,784                      $  1,747\n\n2025                                       2,508                         2,087\n\n2026                                       2,142                         1,771\n\n2027                                       1,757                         1,780\n\n2028                                       1,582                         1,787",
    "section": "Year Ending June 30,     Operating Leases             Finance Leases",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 85,
    "text": "(In millions)          Shares        Amount             Shares      Amount      Shares            Amount",
    "section": "We repurchased the following shares of common stock under the share repurchase programs:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 86,
    "text": "Balance, beginning of period                                                               $     (13     )        $  (19     )       $  (38     )",
    "section": "Derivatives",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 87,
    "text": "Balance, end of period                                                                     $     (27     )        $  (13     )       $  (19     )",
    "section": "Net change related to derivatives, net of tax of $(4), $1, and $7                                (14     )           6                  19",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 88,
    "text": "Balance, beginning of period                                                               $     (2,138  )        $  3,222           $  5,478",
    "section": "Investments",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 89,
    "text": "Balance, end of period                                                                     $     (3,582  )        $  (2,138  )       $  3,222",
    "section": "Cumulative effect of accounting changes                                                          0                   0                  10",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 90,
    "text": "Balance, beginning of period                                                               $     (2,527  )        $  (1,381  )       $  (2,254  )",
    "section": "Translation Adjustments and Other",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 91,
    "text": "Balance, end of period                                                                     $     (2,734  )        $  (2,527  )       $  (1,381  )",
    "section": "Translation adjustments and other, net of tax of $0, $0, and $(9)                                (207    )           (1,146  )          873",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 92,
    "text": "Stock-based compensation expense and related income tax benefits were as follows:\n\n\n(In millions)",
    "section": "We grant stock-based compensation to employees and directors. Awards that expire or are canceled without delivery of shares generally become available for issuance under the plans. We issue new shares of Microsoft common stock to satisfy vesting of awards granted under our stock plans. We also have an ESPP for all eligible employees.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 93,
    "text": "Stock-based compensation expense                           $     9,611          $  7,502          $  6,118",
    "section": "Year Ended June 30,                                        2023           2022            2021",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 94,
    "text": "•\n\nLinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, and Sales Solutions.\n\n•",
    "section": "Office Consumer, including Microsoft 365 Consumer subscriptions, Office licensed on-premises, and other Office services.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 95,
    "text": "•\n\nWindows, including Windows OEM licensing and other non-volume licensing of the Windows operating system; Windows Commercial, comprising volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; and Windows Internet of Things.\n\n•\n\nDevices, including Surface, HoloLens, and PC accessories.\n\n93\n\n* * *",
    "section": "Our More Personal Computing segment consists of products and services that put customers at the center of the experience with our technology. This segment primarily comprises:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 96,
    "text": "•\n\nGaming, including Xbox hardware and Xbox content and services, comprising first- and third-party content (including games and in-game content), Xbox Game Pass and other subscriptions, Xbox Cloud Gaming, advertising, third-party disc royalties, and other cloud services.\n\n•",
    "section": "Item 8",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 97,
    "text": "Revenue, classified by significant product and service offerings, was as follows:\n\n\n(In millions)",
    "section": "Item 8",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 98,
    "text": "Long-lived assets, excluding financial instruments and tax assets, classified by the location of the controlling statutory company and with countries over 10% of the total shown separately, were as follows:\n\n\n(In millions)",
    "section": "Assets are not allocated to segments for internal reporting presentations. A portion of amortization and depreciation is included with various other costs in an overhead allocation to each segment. It is impracticable for us to separately identify the amount of amortization and depreciation by segment that is included in the measure of segment profit or loss.",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 99,
    "text": "•   We tested the effectiveness of controls related to the identification of distinct performance obligations, the determination of the timing of revenue recognition, and the estimation of variable consideration.\n\n•   We evaluated management's significant accounting policies related to these customer agreements for reasonableness.\n\n•   We selected a sample of customer agreements and performed the following procedures:\n\n-   Obtained and read contract source documents for each selection, including master agreements, and other documents that were part of the agreement.\n\n-   Tested management's identification and treatment of contract terms.\n\n-   Assessed the terms in the customer agreement and evaluated the appropriateness of management's application of their accounting policies, along with their use of estimates, in the determination of revenue recognition conclusions.\n\n•   We evaluated the reasonableness of management's estimate of stand-alone selling prices for products and services that are not sold separately.\n\n•   We tested the mathematical accuracy of management's calculations of revenue and the associated timing of revenue recognized in the financial statements.",
    "section": "Our principal audit procedures related to the Company's revenue recognition for these customer agreements included the following:",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 100,
    "text": "A company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.",
    "section": "Definition and Limitations of Internal Control over Financial Reporting",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 101,
    "text": "A list of our executive officers and biographical information appears in Part I, Item 1 of this Form 10-K. Information about our directors may be found under the caption \"Our Director Nominees\" in our Proxy Statement for the Annual Meeting of Shareholders to be held December 7, 2023 (the \"Proxy Statement\"). Information about our Audit Committee may be found under the caption \"Board Committees\" in the Proxy Statement. That information is incorporated herein by reference.",
    "section": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 102,
    "text": "ExhibitNumber    Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                 FiledHerewith                             Form            PeriodEnding      Exhibit      Filing Date\n\n3.1              Amended and Restated Articles of Incorporation of Microsoft Corporation                                                                                                                                                                                                                                                                                                                                                                                             8-K                                      3.1                12/1/2016\n\n3.2              Bylaws of Microsoft Corporation                                                                                                                                                                                                                                                                                                                                                                                                                                     8-K                                      3.2                7/3/2023\n\n4.1              Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee (\"Base Indenture\")                                                                                                                                                                                                                                                                                                               S-3ASR                                   4.1                10/29/2015\n\n4.2              Form of First Supplemental Indenture for 2.95% Notes due 2014, 4.20% Notes due 2019, and 5.20% Notes due 2039, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Base Indenture                                                                                                                                                                                                       8-K                                      4.2                5/15/2009\n\n4.5              Form of Second Supplemental Indenture for 0.875% Notes due 2013, 1.625% Notes due 2015, 3.00% Notes due 2020, and 4.50% Notes due 2040, dated as of September 27, 2010, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee                                                    8-K                                      4.2                9/27/2010\n\n102\n\n* * *",
    "section": "Incorporated by Reference",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 103,
    "text": "ExhibitNumber    Exhibit Description                                                                                                                                                                                                                                                                                                                                                                  FiledHerewith                             Form         PeriodEnding      Exhibit      Filing Date\n\n4.6              Third Supplemental Indenture for 2.500% Notes due 2016, 4.000% Notes due 2021, and 5.300% Notes due 2041, dated as of February 8, 2011, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee                                                     8-K                                   4.2                2/8/2011\n\n4.7              Fourth Supplemental Indenture for 0.875% Notes due 2017, 2.125% Notes due 2022, and 3.500% Notes due 2042, dated as of November 7, 2012, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee                                                    8-K                                   4.1                11/7/2012\n\n4.8              Fifth Supplemental Indenture for 2.625% Notes due 2033, dated as of May 2, 2013, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee                                                                                                            8-K                                   4.1                5/1/2013\n\n4.9              Sixth Supplemental Indenture for 1.000% Notes due 2018, 2.375% Notes due 2023, and 3.750% Notes due 2043, dated as of May 2, 2013, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee                                                          8-K                                   4.2                5/1/2013\n\n103\n\n* * *",
    "section": "Incorporated by Reference",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 104,
    "text": "ExhibitNumber    Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                            FiledHerewith                             Form         PeriodEnding      Exhibit      Filing Date\n\n4.10             Seventh Supplemental Indenture for 2.125% Notes due 2021 and 3.125% Notes due 2028, dated as of December 6, 2013, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee                                                                                                                                                     8-K                                   4.1                12/6/2013\n\n4.11             Eighth Supplemental Indenture for 1.625% Notes due 2018, 3.625% Notes due 2023, and 4.875% Notes due 2043, dated as of December 6, 2013, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee                                                                                                                              8-K                                   4.2                12/6/2013\n\n4.12             Ninth Supplemental Indenture for 1.850% Notes due 2020, 2.375% Notes due 2022, 2.700% Notes due 2025, 3.500% Notes due 2035, 3.750% Notes due 2045, and 4.000% Notes due 2055, dated as of February 12, 2015, between Microsoft Corporation and U.S. Bank National Association, as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                                          8-K                                   4.1                2/12/2015\n\n4.13             Tenth Supplemental Indenture for 1.300% Notes due 2018, 2.000% Notes due 2020, 2.650% Notes due 2022, 3.125% Notes due 2025, 4.200% Notes due 2035, 4.450% Notes due 2045, and 4.750% Notes due 2055, dated as of November 3, 2015, between Microsoft Corporation and U.S. Bank National Association, as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                    8-K                                   4.1                11/3/2015\n\n104\n\n* * *",
    "section": "Incorporated by Reference",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 105,
    "text": "ExhibitNumber    Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                               FiledHerewith                             Form          PeriodEnding               Exhibit      Filing Date\n\n4.14             Eleventh Supplemental Indenture for 1.100% Notes due 2019, 1.550% Notes due 2021, 2.000% Notes due 2023, 2.400% Notes due 2026, 3.450% Notes due 2036, 3.700% Notes due 2046, and 3.950% Notes due 2056, dated as of August 8, 2016, between Microsoft Corporation and U.S. Bank, National Association, as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                                     8-K                                             4.1                8/5/2016\n\n4.15             Twelfth Supplemental Indenture for 1.850% Notes due 2020, 2.400% Notes due 2022, 2.875% Notes due 2024, 3.300% Notes due 2027, 4.100% Notes due 2037, 4.250% Notes due 2047, and 4.500% Notes due 2057, dated as of February 6, 2017, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                    8-K                                             4.1                2/3/2017\n\n4.16             Thirteenth Supplemental Indenture for 2.525% Notes due 2050 and 2.675% Notes due 2060, dated as of June 1, 2020, between Microsoft Corporation and U.S. Bank National Association, as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                                                                                                                                                          8-K                                             4.1                6/1/2020\n\n4.17             Fourteenth Supplemental Indenture for 2.921% Notes due 2052 and 3.041% Notes due 2062, dated as of March 17, 2021, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, to the Indenture, dated as of May 18, 2009, between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                                                                                                                                       8-K                                             4.1                3/17/2021\n\n4.18             Description of Securities                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         10-K                    6/30/2019               4.16               8/1/2019\n\n10.1*            Microsoft Corporation 2001 Stock Plan                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             10-Q                    9/30/2016               10.1               10/20/2016\n\n10.4*            Microsoft Corporation Employee Stock Purchase Plan                                                                                                                                                                                                                                                                                                                                                                                                                                                                                10-K                    6/30/2012               10.4               7/26/2012\n\n105\n\n* * *",
    "section": "Incorporated by Reference",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 106,
    "text": "ExhibitNumber    Exhibit Description                                                                                                                                                                                    FiledHerewith                             Form            PeriodEnding                Exhibit      Filing Date\n\n10.5*            Microsoft Corporation Deferred Compensation Plan                                                                                                                                                                                                       10-K                      6/30/2018                10.5               8/3/2018\n\n10.6*            Microsoft Corporation 2017 Stock Plan                                                                                                                                                                                                                  DEF14A                                             Annex C            10/16/2017\n\n10.7*            Form of Stock Award Agreement Under the Microsoft Corporation 2017 Stock Plan                                                                                                                                                                          10-Q                      3/31/2018                10.26              4/26/2018\n\n10.8*            Form of Performance Stock Award Agreement Under the Microsoft Corporation 2017 Stock Plan                                                                                                                                                              10-Q                      3/31/2018                10.27              4/26/2018\n\n10.9             Amended and Restated Officers' Indemnification Trust Agreement between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                                                           10-Q                      9/30/2016                10.12              10/20/2016\n\n10.10            Assumption of Beneficiaries' Representative Obligations Under Amended and Restated Officers' Indemnification Trust Agreement                                                                                                                           10-K                      6/30/2020                10.25              7/30/2020\n\n10.11            Form of Indemnification Agreement and Amended and Restated Directors' Indemnification Trust Agreement between Microsoft Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee                                                    10-K                      6/30/2019                10.13              8/1/2019\n\n10.12            Assumption of Beneficiaries' Representative Obligations Under Amended and Restated Directors' Indemnification Trust Agreement                                                                                                                          10-K                      6/30/2020                10.26              7/30/2020\n\n10.14*           Microsoft Corporation Deferred Compensation Plan for Non-Employee Directors                                                                                                                                                                            10-Q                      12/31/2017               10.14              1/31/2018\n\n10.15*           Microsoft Corporation Executive Incentive Plan                                                                                                                                                                                                         8-K                                                10.1               9/19/2018\n\n10.19*           Microsoft Corporation Executive Incentive Plan                                                                                                                                                                                                         10-Q                      9/30/2016                10.17              10/20/2016\n\n10.20*           Form of Executive Incentive Plan (Executive Officer SAs) Stock Award Agreement under the Microsoft Corporation 2001 Stock Plan                                                                                                                         10-Q                      9/30/2016                10.18              10/20/2016\n\n10.21*           Form of Executive Incentive Plan Performance Stock Award Agreement under the Microsoft Corporation 2001 Stock Plan                                                                                                                                     10-Q                      9/30/2016                10.25              10/20/2016\n\n10.22*           Senior Executive Severance Benefit Plan                                                                                                                                                                                                                10-Q                      9/30/2016                10.22              10/20/2016\n\n10.23*           Offer Letter, dated February 3, 2014, between Microsoft Corporation and Satya Nadella                                                                                                                                                                  8-K                                                10.1               2/4/2014\n\n106\n\n* * *",
    "section": "Incorporated by Reference",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 107,
    "text": "ExhibitNumber    Exhibit Description                                                                                                                                                FiledHerewith                             Form          PeriodEnding                Exhibit      Filing Date\n\n10.24*           Long-Term Performance Stock Award Agreement between Microsoft Corporation and Satya Nadella                                                                                                                        10-Q                    12/31/2014               10.24              1/26/2015\n\n10.25*           Offer Letter, dated October 25, 2020, between Microsoft Corporation and Christopher Young                                                                                                                          10-Q                    9/30/2021                10.27              10/26/2021\n\n21               Subsidiaries of Registrant                                                                                                                                         X\n\n23.1             Consent of Independent Registered Public Accounting Firm                                                                                                           X\n\n31.1             Certification of Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002                                                                 X\n\n31.2             Certification of Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002                                                                 X\n\n32.1**           Certification of Chief Executive Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002                                                                 X\n\n32.2**           Certification of Chief Financial Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002                                                                 X\n\n101.INS          Inline XBRL Instance Document--the instance document does not appear in the Interactive Data File as its XBRL tags are embedded within the Inline XBRL document    X\n\n101.SCH          Inline XBRL Taxonomy Extension Schema                                                                                                                              X\n\n101.CAL          Inline XBRL Taxonomy Extension Calculation Linkbase                                                                                                                X\n\n101.DEF          Inline XBRL Taxonomy Extension Definition Linkbase                                                                                                                 X\n\n101.LAB          Inline XBRL Taxonomy Extension Label Linkbase                                                                                                                      X\n\n101.PRE          Inline XBRL Taxonomy Extension Presentation Linkbase                                                                                                               X\n\n104              Cover page formatted as Inline XBRL and contained in Exhibit 101                                                                                                   X\n\n* Indicates a management contract or compensatory plan or arrangement.\n\n** Furnished, not filed.\n\n107\n\n* * *",
    "section": "Incorporated by Reference",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 108,
    "text": "/s/ SATYA NADELLA    Chairman and Chief Executive Officer(Principal Executive Officer)",
    "section": "Signature            Title",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 109,
    "text": "/s/ AMY E. HOOD    Executive Vice President and Chief Financial Officer(Principal Financial Officer)",
    "section": "Padmasree Warrior",
    "type": "section",
    "company": "MSFT",
    "year": null
  },
  {
    "chunk_id": 110,
    "text": "/s/ ALICE L. JOLLA    Corporate Vice President and Chief Accounting Officer(Principal Accounting Officer)",
    "section": "Amy E. Hood",
    "type": "section",
    "company": "MSFT",
    "year": null
  }
]