[
  {
    "chunk_id": 1,
    "text": "COMPANY: TSLA\nYEAR: None",
    "section": null,
    "type": "info",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 2,
    "text": "(Mark One)\n\n☒   ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "FORM 10-K",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 3,
    "text": "OR\n\n☐   TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "For the fiscal year ended December 31, 2022",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 4,
    "text": "Tesla, Inc.\n\n(Exact name of registrant as specified in its charter)",
    "section": "Commission File Number: 001-34756",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 5,
    "text": "(State or other jurisdiction ofincorporation or organization)    (I.R.S. EmployerIdentification No.)\n\n1 Tesla RoadAustin, Texas                                        78725\n\n(Address of principal executive offices)                         (Zip Code)\n\n(512) 516-8177\n\n(Registrant's telephone number, including area code)",
    "section": "Delaware                                                         91-2197729",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 6,
    "text": "Currently, we offer in our vehicles certain advanced driver assist systems under our Autopilot and FSD options. Although at present the driver is ultimately responsible for controlling the vehicle, our systems provide safety and convenience functionality that relieves drivers of the most tedious and potentially dangerous aspects of road travel much like the system that airplane pilots use, when conditions permit. As with other vehicle systems, we improve these functions in our vehicles over time through over-the-air updates.",
    "section": "We have expertise in developing technologies, systems and software to enable self-driving vehicles using primarily vision-based technologies. Our FSD Computer runs our neural networks in our vehicles, and we are also developing additional computer hardware to better enable the massive amounts of field data captured by our vehicles to continually train and improve these neural networks for real-world performance.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 7,
    "text": "Historically, we have been able to generate significant media coverage of our company and our products, and we believe we will continue to do so. Such media coverage and word of mouth are the current primary drivers of our sales leads and have helped us achieve sales without traditional advertising and at relatively low marketing costs.",
    "section": "Sales and Marketing",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 8,
    "text": "Internationally, we also have manufacturing facilities in China (Gigafactory Shanghai) and Germany (Gigafactory Berlin-Brandenburg), which allows us to increase the affordability of our vehicles for customers in local markets by reducing transportation and manufacturing costs and eliminating the impact of unfavorable tariffs. Generally, we continue to expand production capacity at our existing facilities. We also intend to further increase cost-competitiveness in our significant markets by strategically adding local manufacturing.",
    "section": "We currently have manufacturing facilities in the US in Northern California, in Buffalo, New York, Gigafactory New York; in Austin, Texas, Gigafactory Texas and near Reno, Nevada, Gigafactory Nevada. At these facilities, we manufacture and assemble, among other things, vehicles, certain vehicle parts and components, such as our battery packs and battery cells, energy storage components and solar products and components.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 9,
    "text": "Globally, the ownership of our products by our customers is impacted by various government credits, incentives, and policies. Our business and products are also subject to numerous governmental regulations that vary among jurisdictions.",
    "section": "Governmental Programs, Incentives and Regulations",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 10,
    "text": "U.S. federal, state and local governments have established various policies, incentives and financial mechanisms to reduce the cost of solar energy and to accelerate the adoption of solar energy. These incentives include tax credits, cash grants, tax abatements and rebates.",
    "section": "Solar Energy System Incentives and Policies",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 11,
    "text": "Self-Driving Vehicles\n\nGenerally, laws pertaining to self-driving vehicles are evolving globally, and in some cases may create restrictions on features that we develop. While there are currently no federal U.S. regulations pertaining specifically to self-driving vehicles or self-driving equipment, NHTSA has published recommended guidelines on self-driving vehicles, apart from the FMVSS and manufacturer reporting obligations, and retains the authority to investigate and/or take action on the safety or compliance of any vehicle, equipment or features operating on public roads. Certain U.S. states also have legal restrictions on the operation, registration or licensure of self-driving vehicles, and many other states are considering them. This regulatory patchwork increases the legal complexity with respect to self-driving vehicles in the U.S.\n\n9\n\n* * *",
    "section": "Our vehicles sold outside of the U.S. are subject to similar foreign compliance, safety, environmental and other regulations. Many of those regulations are different from those applicable in the U.S. and may require redesign and/or retesting. Some of those regulations impact or prevent the rollout of new vehicle features. Additionally, the European Union established new rules regarding additional compliance oversight that commenced in 2020.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 12,
    "text": "Environmental, Social and Governance (ESG) and Human Capital Resources\n\nESG",
    "section": "We place a strong emphasis on our innovative approach and proprietary designs which bring intrinsic value and uniqueness to our product portfolio. As part of our business, we seek to protect the underlying intellectual property rights of these innovations and designs such as with respect to patents, trademarks, copyrights, trade secrets and other measures, including through employee and third-party nondisclosure agreements and other contractual arrangements. For example, we place a high priority on obtaining patents to provide the broadest and strongest possible protection to enable our freedom to operate our innovations and designs within our products and technologies in the electric vehicle market as well as to protect and defend our product portfolio. We have also adopted a patent policy in which we irrevocably pledged that we will not initiate a lawsuit against any party for infringing our patents through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith. We made this pledge in order to encourage the advancement of a common, rapidly-evolving platform for electric vehicles, thereby benefiting ourselves, other companies making electric vehicles and the world.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 13,
    "text": "14\n\n* * *\n\naddition, we may introduce in the future new or unique manufacturing processes and design features for our products. There is no guarantee that we will be able to successfully and timely introduce and scale such processes or features.",
    "section": "We have previously experienced and may in the future experience launch and production ramp delays for new products and features. For example, we encountered unanticipated supplier issues that led to delays during the initial ramp of our first Model X and experienced challenges with a supplier and with ramping full automation for certain of our initial Model 3 manufacturing processes. In",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 14,
    "text": "15\n\n* * *\n\nmanagement and other systems to accommodate the increased complexity in our supply chain and parts management, we may incur unexpected production disruption, storage, transportation and write-off costs, which may harm our business and operating results.",
    "section": "As the scale of our vehicle production increases, we will also need to accurately forecast, purchase, warehouse and transport components at high volumes to our manufacturing facilities and servicing locations internationally. If we are unable to accurately match the timing and quantities of component purchases to our actual needs or successfully implement automation, inventory",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 15,
    "text": "Moreover, because of our unique expertise with our vehicles, we recommend that our vehicles be serviced by us or by certain authorized professionals. If we experience delays in adding servicing capacity or servicing our vehicles efficiently, or experience unforeseen issues with the reliability of our vehicles, particularly higher-volume additions to our fleet such as Model 3 and Model Y, it could overburden our servicing capabilities and parts inventory. Similarly, the increasing number of Tesla vehicles also requires us to continue to rapidly increase the number of our Supercharger stations and connectors throughout the world.",
    "section": "Because we do not have independent dealer networks, we are responsible for delivering all of our vehicles to our customers. As our production volumes continue to grow, we have faced in the past, and may face challenges with deliveries at increasing volumes, particularly in international markets requiring significant transit times. We have also deployed a number of delivery models, such as deliveries to customers' homes and workplaces and touchless deliveries, but there is no guarantee that such models will be scalable or be accepted globally. Likewise, as we ramp our energy products, we are working to substantially increase our production and installation capabilities. If we experience production delays or inaccurately forecast demand, our business, financial condition and operating results may be harmed.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 16,
    "text": "16\n\n* * *\n\nthan currently available cells. However, our efforts to develop and manufacture such battery cells have required, and may continue to require, significant investments, and there can be no assurance that we will be able to achieve these targets in the timeframes that we have planned or at all. If we are unable to do so, we may have to curtail our planned vehicle and energy storage product production or procure additional cells from suppliers at potentially greater costs, either of which may harm our business and operating results.",
    "section": "We are dependent on the continued supply of lithium-ion battery cells for our vehicles and energy storage products, and we will require substantially more cells to grow our business according to our plans. Currently, we rely on suppliers such as Panasonic and Contemporary Amperex Technology Co. Limited (CATL) for these cells. We have to date fully qualified only a very limited number of such suppliers and have limited flexibility in changing suppliers. Any disruption in the supply of battery cells from our suppliers could limit production of our vehicles and energy storage products. In the long term, we intend to supplement cells from our suppliers with cells manufactured by us, which we believe will be more efficient, manufacturable at greater volumes and more cost-effective",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 17,
    "text": "•\n\nperceptions about electric vehicle features, quality, safety, performance and cost;\n\n•\n\nperceptions about the limited range over which electric vehicles may be driven on a single battery charge, and access to charging facilities;\n\n•\n\ncompetition, including from other types of alternative fuel vehicles, plug-in hybrid electric vehicles and high fuel-economy internal combustion engine vehicles;\n\n•\n\nvolatility in the cost of oil, gasoline and energy, such as wide fluctuations in crude oil prices during 2020;\n\n•\n\ngovernment regulations and economic incentives and conditions; and\n\n•\n\nconcerns about our future viability.\n\nFinally, the target demographics for our vehicles, particularly Model 3 and Model Y, are highly competitive. Sales of vehicles in the automotive industry tend to be cyclical in many markets, which may expose us to further volatility.",
    "section": "In addition, electric vehicles still constitute a small percentage of overall vehicle sales. As a result, the market for our vehicles could be negatively affected by numerous factors, such as:",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 18,
    "text": "Finally, the high volumes of lithium-ion cells and battery modules and packs manufactured by us and by our suppliers are stored and recycled at our various facilities. Any mishandling of these products may cause disruption to the operation of such facilities. While we have implemented safety procedures related to the handling of the cells, there can be no assurance that a safety issue or fire related to the cells would not disrupt our operations. Any such disruptions or issues may harm our brand and business.",
    "section": "Our plan to grow the volume and profitability of our vehicles and energy storage products depends on significant lithium-ion battery cell production, including by our partner Panasonic at Gigafactory Nevada. We also produce several vehicle components at our Gigafactories, such as battery modules and packs and drive units, and manufacture energy storage products. In the past, some of the manufacturing lines for certain product components took longer than anticipated to ramp to their full capacity, and additional bottlenecks may arise in the future as we continue to increase the production rate and introduce new lines. In addition, as the IRA provides new incentives for domestic energy production and manufacturing, we may face increasing competition from other automobile manufacturers as well as suppliers for the resources and capacity to build additional factories and expand our operations domestically. If we are unable to or otherwise do not maintain and grow our respective operations, or if we are unable to do so cost-effectively or hire and retain highly-skilled personnel there, our ability to manufacture our products profitably would be limited, which may harm our business and operating results.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 19,
    "text": "18\n\n* * *\n\nsmoke and flames in a manner that can ignite nearby materials as well as other lithium-ion cells. While we have designed our battery packs to passively contain any single cell's release of energy without spreading to neighboring cells, there can be no assurance that a field or testing failure of our vehicles or other battery packs that we produce will not occur, in particular due to a high-speed crash. Likewise, as our solar energy systems and energy storage products generate and store electricity, they have the potential to fail or cause injury to people or property. Any product liability claim may subject us to lawsuits and substantial monetary damages, product recalls or redesign efforts, and even a meritless claim may require us to defend it, all of which may generate negative publicity and be expensive and time-consuming. In most jurisdictions, we generally self-insure against the risk of product liability claims for vehicle exposure, meaning that any product liability claims will likely have to be paid from company funds and not by insurance.",
    "section": "The automobile industry generally experiences significant product liability claims, and as such we face the risk of such claims in the event our vehicles do not perform or are claimed to not have performed as expected. As is true for other automakers, our vehicles have been involved and we expect in the future will be involved in accidents resulting in death or personal injury, and such accidents where Autopilot, Enhanced Autopilot or FSD Capability features are engaged are the subject of significant public attention, especially in light of NHTSA's Standing General Order requiring reports regarding crashes involving vehicles with advanced driver assistance systems. We have experienced, and we expect to continue to face, claims and regulatory scrutiny arising from or related to misuse or claimed failures or alleged misrepresentations of such new technologies that we are pioneering. In addition, the battery packs that we produce make use of lithium-ion cells. On rare occasions, lithium-ion cells can rapidly release the energy they contain by venting",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 20,
    "text": "Similarly, we have provided resale value guarantees to vehicle customers and partners for certain financing programs, under which such counterparties may sell their vehicles back to us at certain points in time at pre-determined amounts. However, actual resale values are subject to fluctuations over the term of the financing arrangements, such as from the vehicle pricing changes discussed above. If the actual resale values of any vehicles resold or returned to us pursuant to these programs are materially lower than the pre-determined amounts we have offered, our financial condition and operating results may be harmed.\n\nFinally, our vehicle and solar energy system financing programs and our energy storage sales programs also expose us to customer credit risk. In the event of a widespread economic downturn or other catastrophic event, our customers may be unable or unwilling to satisfy their payment obligations to us on a timely basis or at all. If a significant number of our customers default, we may incur substantial credit losses and/or impairment charges with respect to the underlying assets.\n\n19\n\n* * *",
    "section": "The profitability of any directly-leased vehicles returned to us at the end of their leases depends on our ability to accurately project our vehicles' residual values at the outset of the leases, and such values may fluctuate prior to the end of their terms depending on various factors such as supply and demand of our used vehicles, economic cycles and the pricing of new vehicles. We have made in the past and may make in the future certain adjustments to our prices from time to time in the ordinary course of business, which may impact the residual values of our vehicles and reduce the profitability of our vehicle leasing program. The funding and growth of this program also rely on our ability to secure adequate financing and/or business partners. If we are unable to adequately fund our leasing program through internal funds, partners or other financing sources, and compelling alternative financing programs are not available for our customers who may expect or need such options, we may be unable to grow our vehicle deliveries. Furthermore, if our vehicle leasing business grows substantially, our business may suffer if we cannot effectively manage the resulting greater levels of residual risk.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 21,
    "text": "Finally, our compensation philosophy for all of our personnel reflects our startup origins, with an emphasis on equity-based awards and benefits in order to closely align their incentives with the long-term interests of our stockholders. We periodically seek and obtain approval from our stockholders for future increases to the number of awards available under our equity incentive and employee stock purchase plans. If we are unable to obtain the requisite stockholder approvals for such future increases, we may have to expend additional cash to compensate our employees and our ability to retain and hire qualified personnel may be harmed.",
    "section": "Employees may leave Tesla or choose other employers over Tesla due to various factors, such as a very competitive labor market for talented individuals with automotive or technology experience, or any negative publicity related to us. In regions where we have or will have operations, particularly significant engineering and manufacturing centers, there is strong competition for individuals with skillsets needed for our business, including specialized knowledge of electric vehicles, engineering and electrical and building construction expertise. Moreover, we may be impacted by perceptions relating to reductions in force that we have conducted in the past in order to optimize our organizational structure and reduce costs and the departure of certain senior personnel for various reasons. We also compete with both mature and prosperous companies that have far greater financial resources than we do and start-ups and emerging companies that promise short-term growth opportunities.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 22,
    "text": "Further, the implementation, maintenance, segregation and improvement of these systems require significant management time, support and cost, and there are inherent risks associated with developing, improving and expanding our core systems as well as implementing new systems and updating current systems, including disruptions to the related areas of business operation. These risks may affect our ability to manage our data and inventory, procure parts or supplies or manufacture, sell, deliver and service products, adequately protect our intellectual property or achieve and maintain compliance with, or realize available benefits under, tax laws and other applicable regulations.\n\nMoreover, if we do not successfully implement, maintain or expand these systems as planned, our operations may be disrupted, our ability to accurately and/or timely report our financial results could be impaired and deficiencies may arise in our internal control over financial reporting, which may impact our ability to certify our financial results. Moreover, our proprietary information, including intellectual property and personal information, could be compromised or misappropriated and our reputation may be adversely affected. If these systems or their functionality do not operate as we expect them to, we may be required to expend significant resources to make corrections or find alternative sources for performing these functions.",
    "section": "We also rely on service providers, and similar incidents relating to their information technology systems could also have a material adverse effect on our business. There have been and may continue to be significant supply chain attacks. Our service providers, including our workforce management software provider, have been subject to ransomware and other security incidents, and we cannot guarantee that our or our service providers' systems have not been breached or that they do not contain exploitable defects, bugs, or vulnerabilities that could result in a security incident, or other disruption to, our or our service providers' systems. Our ability to monitor our service providers' security measures is limited, and, in any event, malicious third parties may be able to circumvent those security measures.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 23,
    "text": "Finally, we and our fund investors claim these U.S. federal tax credits and certain state incentives in amounts based on independently appraised fair market values of our solar and energy storage systems. Some governmental authorities have audited such values and in certain cases have determined that these values should be lower, and they may do so again in the future. Such determinations may result in adverse tax consequences and/or our obligation to make indemnification or other payments to our funds or fund investors.",
    "section": "In addition, certain governmental rebates, tax credits and other financial incentives that are currently available with respect to our solar and energy storage product businesses allow us to lower our costs and encourage customers to buy our products and investors to invest in our solar financing funds. However, these incentives may expire when the allocated funding is exhausted, reduced or terminated as renewable energy adoption rates increase, sometimes without warning. Likewise, in jurisdictions where net metering is currently available, our customers receive bill credits from utilities for energy that their solar energy systems generate and export to the grid in excess of the electric load they use. The benefit available under net metering has been or has been proposed to be reduced, altered or eliminated in several jurisdictions, and has also been contested and may continue to be contested before the Federal Energy Regulatory Commission. Any reductions or terminations of such incentives may harm our business, prospects, financial condition and operating results by making our products less competitive for customers, increasing our cost of capital and adversely impacting our ability to attract investment partners and to form new financing funds for our solar and energy storage assets.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 24,
    "text": "Finally, as a manufacturer, installer and service provider with respect to solar generation and energy storage systems, a supplier of electricity generated and stored by certain of the solar energy and energy storage systems we install for customers, and a provider of\n\n25\n\n* * *\n\ngrid services through virtual power plant models, we are impacted by federal, state and local regulations and policies concerning the import or export of components, electricity pricing, the interconnection of electricity generation and storage equipment with the electrical grid and the sale of electricity generated by third party-owned systems. If regulations and policies are introduced that adversely impact the import or export of components, or the interconnection, maintenance or use of our solar and energy storage systems, they could deter potential customers from purchasing our solar and energy storage products and services, threaten the economics of our existing contracts and cause us to cease solar and energy storage system sales and services in the relevant jurisdictions, which may harm our business, financial condition and operating results.",
    "section": "In particular, we offer in our vehicles in certain markets Autopilot and FSD Capability features that today assist drivers with certain tedious and potentially dangerous aspects of road travel, but which currently require drivers to remain fully engaged in the driving operation. We are continuing to develop our Autopilot and FSD Capability technology. There are a variety of international, federal and state regulations that may apply to, and may adversely affect, the design and performance, sale, registration and operation of Autopilot and FSD Capability, and future capability, including full self-driving vehicles that may not be operated by a human driver. This includes many existing vehicle standards that were not originally intended to apply to vehicles that may not be operated by a human driver. Such regulations continue to rapidly change, which increases the likelihood of a patchwork of complex or conflicting regulations, or may delay, restrict or prohibit the availability of certain functionalities and vehicle designs, which could adversely affect our business.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 25,
    "text": "Internationally, there may be laws in jurisdictions we have not yet entered or laws we are unaware of in jurisdictions we have entered that may restrict our sales or other business practices. Even for those jurisdictions we have analyzed, the laws in this area can be complex, difficult to interpret and may change over time. Continued regulatory limitations and other obstacles interfering with our ability to sell vehicles directly to consumers may harm our financial condition and operating results.",
    "section": "While we intend to continue to leverage our most effective sales strategies, including sales through our website, we may not be able to sell our vehicles through our own stores in certain states in the U.S. with laws that may be interpreted to impose limitations on this direct-to-consumer sales model. It has also been asserted that the laws in some states limit our ability to obtain dealer licenses from state motor vehicle regulators, and such assertions persist. In certain locations, decisions by regulators permitting us to sell vehicles have been, and may be, challenged by dealer associations and others as to whether such decisions comply with applicable state motor vehicle industry laws. We have prevailed in many of these lawsuits and such results have reinforced our continuing belief that state franchise laws were not intended to apply to a manufacturer that does not have franchise dealers anywhere in the world. In some states, there have also been regulatory and legislative efforts by dealer associations to propose laws that, if enacted, would prevent us from obtaining dealer licenses in their states given our current sales model. A few states have passed legislation that clarifies our ability to operate, but at the same time limits the number of dealer licenses we can obtain or stores that we can operate. The application of state laws applicable to our operations continues to be difficult to predict.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 26,
    "text": "Anti-takeover provisions contained in our governing documents, applicable laws and our convertible senior notes could impair a takeover attempt.",
    "section": "Certain banking institutions have made extensions of credit to Elon Musk, our Chief Executive Officer, a portion of which was used to purchase shares of common stock in certain of our public offerings and private placements at the same prices offered to third-party participants in such offerings and placements. We are not a party to these loans, which are partially secured by pledges of a portion of the Tesla common stock currently owned by Mr. Musk. If the price of our common stock were to decline substantially, Mr. Musk may be forced by one or more of the banking institutions to sell shares of Tesla common stock to satisfy his loan obligations if he could not do so through other means. Any such sales could cause the price of our common stock to decline further. Further, Mr. Musk from time to time may commit to investing in significant business or other ventures, and as a result, be required to sell shares of our common stock in satisfaction of such commitments.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 27,
    "text": "* We own the building and the land use rights with an initial term of 50 years. The land use rights are treated as operating lease right-of-use assets.",
    "section": "Megafactory                         Lathrop, California    Leased",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 28,
    "text": "TBD                               Tesla Roadster       In development\n\nTBD                               Robotaxi & Others    In development\n\n32\n\n* * *",
    "section": "Gigafactory Nevada                Tesla Semi           Pilot production",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 29,
    "text": "However, these plans are subject to uncertainties inherent in establishing and ramping manufacturing operations, which may be exacerbated by the new product and manufacturing technologies we are introducing, the number of concurrent international projects, any industry-wide component constraints, labor shortages and any future impact from events outside of our control such as the COVID-19 pandemic. Moreover, we have set ambitious technological targets with our plans for battery cells as well as for iterative manufacturing and design improvements for our vehicles with each new factory.\n\nAutomotive--Demand and Sales",
    "section": "We are focused on growing our manufacturing capacity, which includes ramping all of our production vehicles to their installed production capacities as well as increasing production rate, efficiency and capacity at our current factories. The next phase of production growth will depend on the ramp at Gigafactory Berlin-Brandenburg and Gigafactory Texas, as well as our ability to add to our available sources of battery cell supply by manufacturing our own cells that we are developing to have high-volume output, lower capital and production costs and longer range. Our goals are to improve vehicle performance, decrease production costs and increase affordability.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 30,
    "text": "However, we operate in a cyclical industry that is sensitive to political and regulatory uncertainty, including with respect to trade and the environment, all of which can be compounded by inflationary pressures, rising energy prices, increases in interest rates and any future global impact from the COVID-19 pandemic. For example, in the earlier part of 2022, the automotive industry in general experienced part shortages and supplier disruptions which impacted production leading to a general increase in vehicle pricing. As the year progressed, inflationary pressures increased across the markets in which we operate. In an effort to curb this trend, central banks in developed countries raised interest rates rapidly and substantially, impacting the affordability of vehicle lease and finance arrangements. Further, sales of vehicles in the automotive industry also tend to be cyclical in many markets, which may expose us to increased volatility as we expand and adjust our operations. Moreover, as additional competitors enter the marketplace and help bring the world closer to sustainable transportation, we will have to adjust and continue to execute well to maintain our momentum. These macroeconomic and industry trends have had, and will likely continue to have, an impact on the pricing of, and order rate for our vehicles, and we will continue to adjust accordingly to such developments.\n\nAutomotive--Deliveries and Customer Infrastructure",
    "section": "Our cost reduction efforts, cost innovation strategies, and additional localized procurement and manufacturing are key to our vehicles' affordability, and for example, have allowed us to competitively price our vehicles in China. We will also continue to generate demand and brand awareness by improving our vehicles' performance and functionality, including through products based on artificial intelligence such as Autopilot and FSD, and other software features, and delivering new vehicles, such as the Tesla Semi in December 2022. Moreover, we expect to continue to benefit from ongoing electrification of the automotive sector and increasing environmental awareness.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 31,
    "text": "Furthermore, significant judgment is required in evaluating our tax positions. In the ordinary course of business, there are many transactions and calculations for which the ultimate tax settlement is uncertain. As a result, we recognize the effect of this uncertainty on our tax attributes or taxes payable based on our estimates of the eventual outcome. These effects are recognized when, despite our belief that our tax return positions are supportable, we believe that it is more likely than not that some of those positions may not be fully sustained upon review by tax authorities. We are required to file income tax returns in the U.S. and various foreign jurisdictions, which requires us to interpret the applicable tax laws and regulations in effect in such jurisdictions. Such returns are subject to audit by the various federal, state and foreign taxing authorities, who may disagree with respect to our tax positions. We believe that our consideration is adequate for all open audit years based on our assessment of many factors, including past experience and interpretations of tax law. We review and update our estimates in light of changing facts and circumstances, such as the closing of a tax audit, the lapse of a statute of limitations or a change in estimate. To the extent that the final tax outcome of these matters differs from our expectations, such differences may impact income tax expense in the period in which such determination is made. The eventual impact on our income tax expense depends in part if we still have a valuation allowance recorded against our deferred tax assets in the period that such determination is made.\n\n36\n\n* * *",
    "section": "We are subject to taxes in the U.S. and in many foreign jurisdictions. Significant judgment is required in determining our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance recorded against our net deferred tax assets. We make these estimates and judgments about our future taxable income that are based on assumptions that are consistent with our future plans. Tax laws, regulations and administrative practices may be subject to change due to economic or political conditions including fundamental changes to the tax laws applicable to corporate multinationals. The U.S., many countries in the European Union and a number of other countries are actively considering changes in this regard. As of December 31, 2022, we had recorded a full valuation allowance on our net U.S. deferred tax assets because we expect that it is more likely than not that our U.S. deferred tax assets will not be realized. Should the actual amounts differ from our estimates, the amount of our valuation allowance could be materially impacted.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 32,
    "text": "(Dollars in millions)            2022                               2021                             2020                       $           %            $        %",
    "section": "Year Ended December 31,            2022 vs. 2021 Change             2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 33,
    "text": "segment revenue                                     77,553         51,034         29,542         26,519        52  %       21,492        73  %",
    "section": "Total automotive & services and other",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 34,
    "text": "(Dollars in millions)                2022                               2021                             2020                       $           %            $        %",
    "section": "Year Ended December 31,            2022 vs. 2021 Change             2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 35,
    "text": "segment cost of revenues                    56,988          37,299          22,930          19,689        53  %       14,369        63  %",
    "section": "Total automotive & services and other",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 36,
    "text": "38\n\n* * *\n\n2022 compared to 2021",
    "section": "Cost of services and other revenue includes costs associated with providing non-warranty after-sales services and parts, costs of paid Supercharging, cost of used vehicles including refurbishment costs, costs for retail merchandise, and costs to provide vehicle insurance.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 37,
    "text": "(Dollars in millions)          2022                               2021                            2020                       $           %         $        %",
    "section": "Year Ended December 31,            2022 vs. 2021 Change            2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 38,
    "text": "R&D expenses increased $482 million, or 19%, in the year ended December 31, 2022 as compared to the year ended December 31, 2021. The increase was primarily due to a $175 million increase in employee and labor related expenses, a $132 million increase in facilities, outside services, freight and depreciation expense, a $101 million increase in R&D expensed materials and an $87 million increase in stock-based compensation expense. These increases were to support our expanding product roadmap and technologies including our proprietary battery cells. Further, there were additional R&D expenses in the first quarter of 2022 as we were in the pre-production phase at Gigafactory Texas and started production at Gigafactory Berlin-Brandenburg only closer to the end of the first quarter of 2022.\n\nR&D expenses as a percentage of revenue decreased from 5% to 4% in the year ended December 31, 2022 as compared to the year ended December 31, 2021. Our R&D expenses have decreased as a proportion of total revenues despite expanding product roadmap and technologies.\n\nSelling, General and Administrative Expense",
    "section": "Research and development (\"R&D\") expenses consist primarily of personnel costs for our teams in engineering and research, manufacturing engineering and manufacturing test organizations, prototyping expense, contract and professional services and amortized equipment expense.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 39,
    "text": "(Dollars in millions)                  2022                               2021                            2020                       $           %           $         %\n\nSelling, general and administrative    $                        3,946                           $  4,517                          $  3,145       $  (571  )       (13  )%    $  1,372        44  %",
    "section": "Year Ended December 31,            2022 vs. 2021 Change            2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 40,
    "text": "Selling, general and administrative (\"SG&A\") expenses generally consist of personnel and facilities costs related to our stores, marketing, sales, executive, finance, human resources, information technology and legal organizations, as well as fees for professional and contract services and litigation settlements.\n\nSG&A expenses decreased $571 million, or 13%, in the year ended December 31, 2022 as compared to the year ended December 31, 2021. This is primarily due to a decrease of $822 million in stock-based compensation expense, most of which is attributable to the lower stock-based compensation expense of $844 million on the 2018 CEO Performance Award. This was partially offset by the overall growth in stock-based compensation due to increased headcount. See Note 13, Equity Incentive Plans, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K. There was also a decrease of $87 million in overall employee and labor related expenses driven by a decrease of $340 million of additional payroll tax due to our CEO's option exercises from the 2012 CEO Performance Award in 2021, partially offset by an increase in other employee and labor costs from increased headcount. These decreases were partially offset by an increase of $222 million in facilities-related expenses, and an increase of $117 million in professional services, sales and marketing activities and other costs.\n\nSG&A expenses as a percentage of revenue decreased from 8% to 5% in the year ended December 31, 2022 as compared to the year ended December 31, 2021. Our SG&A expenses have decreased as a proportion of total revenues due to the decrease in expenses as discussed above, in addition to operational efficiencies.",
    "section": "As a percentage of revenues                                     5      %                           8      %                          10     %",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 41,
    "text": "(Dollars in millions)      2022                            2021                                           2020       $       %       $                    %",
    "section": "Year Ended December 31,         2022 vs. 2021 Change     2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 42,
    "text": "(Dollars in millions)    2022                            2021                         2020                       $       %         $         %",
    "section": "Year Ended December 31,         2022 vs. 2021 Change         2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 43,
    "text": "(Dollars in millions)    2022                              2021                           2020                       $          %         $         %",
    "section": "Year Ended December 31,           2022 vs. 2021 Change           2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 44,
    "text": "(Dollars in millions)          2022                             2021                                           2020       $          %        $                    %",
    "section": "Year Ended December 31,          2022 vs. 2021 Change     2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 45,
    "text": "(Dollars in millions)         2022                               2021                          2020                       $         %         $        %",
    "section": "Year Ended December 31,            2022 vs. 2021 Change          2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 46,
    "text": "(Dollars in millions)    2022                         2021                      2020                      $      %      $      %",
    "section": "Year Ended December 31,      2022 vs. 2021 Change      2021 vs. 2020 Change",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 47,
    "text": "interests and redeemable noncontrolling interests\n\nin subsidiaries    $  31      $  125      $  141      $  (94  )      (75  )%    $  (16  )      (11  )%\n\n41\n\n* * *",
    "section": "Net income attributable to noncontrolling",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 48,
    "text": "Accordingly, we believe that our current sources of funds will provide us with adequate liquidity during the 12-month period following December 31, 2022, as well as in the long-term.",
    "section": "In addition, because a large portion of our future expenditures will be to fund our growth, we expect that if needed we will be able to adjust our capital and operating expenditures by operating segment. For example, if our near-term manufacturing operations decrease in scale or ramp more slowly than expected, including due to global economic or business conditions, we may choose to correspondingly slow the pace of our capital expenditures. Finally, we continually evaluate our cash needs and may decide it is best to raise additional capital or seek alternative financing sources to fund the rapid growth of our business, including through drawdowns on existing or new debt facilities or financing funds. Conversely, we may also from time to time determine that it is in our best interests to voluntarily repay certain indebtedness early.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 49,
    "text": "A company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.\n\n46\n\n* * *",
    "section": "Definition and Limitations of Internal Control over Financial Reporting",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 50,
    "text": "3,164 and 3,100 shares issued and outstanding as of",
    "section": "Common stock; $0.001 par value; 6,000 shares authorized;",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 51,
    "text": "interests and redeemable noncontrolling interests\n\nin subsidiaries                                      31             125           141",
    "section": "Net income attributable to noncontrolling",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 52,
    "text": "Less: Comprehensive income attributable to\n\nnoncontrolling interests and redeemable\n\nnoncontrolling interests in subsidiaries      31        125        141",
    "section": "Comprehensive income                                                12,172              5,335             1,261",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 53,
    "text": "common stockholders    $  12,141      $  5,210      $  1,120",
    "section": "Comprehensive income attributable to",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 54,
    "text": "notes                                                                            --              --            --         (51     )       --            --              (51     )       --            (51     )",
    "section": "Reclassification between equity and mezzanine equity for convertible senior",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 55,
    "text": "Stock-based compensation                                                         --              --            --         1,861           --            --              1,861           --            1,861",
    "section": "Issuance of common stock in public offerings, net of issuance costs of $68       --              103           0          12,269          --            --              12,269          --            12,269",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 56,
    "text": "Buy-outs of noncontrolling interests                                             (4    )         --            --         (31     )       --            --              (31     )       --            (31     )",
    "section": "Distributions to noncontrolling interests                                        (67   )         --            --         --              --            --              --              (132  )       (132    )",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 57,
    "text": "Stock-based compensation                                                         --              --            --         2,299           --            --              2,299           --            2,299",
    "section": "Issuance of common stock for equity incentive awards                             --              107           0          707             --            --              707             --            707",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 58,
    "text": "Buy-outs of noncontrolling interests                                             (15   )         --            --         5               --            --              5               --            5",
    "section": "Distributions to noncontrolling interests                                        (66   )         --            --         --              --            --              --              (106  )       (106    )",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 59,
    "text": "Stock-based compensation                                                         --              --            --         1,806           --            --              1,806           --            1,806",
    "section": "Issuance of common stock for equity incentive awards                             --              27            0          541             --            --              541             --            541",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 60,
    "text": "Buy-outs of noncontrolling interests                                             (11   )         --            --         27              --            --              27              (61   )       (34     )",
    "section": "Distributions to noncontrolling interests                                        (46   )         --            --         --              --            --              --              (113  )       (113    )",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 61,
    "text": "Depreciation, amortization and impairment                                                                      3,747                2,911               2,322\n\nStock-based compensation                                                                                       1,560                2,121               1,734",
    "section": "Adjustments to reconcile net income to net cash provided by operating activities:",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 62,
    "text": "Non-cash interest and other operating activities                                                               340                  245                 525",
    "section": "Foreign currency transaction net unrealized loss (gain)                                                        81                   (55      )          114",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 63,
    "text": "Tesla, Inc. (\"Tesla\", the \"Company\", \"we\", \"us\" or \"our\") was incorporated in the State of Delaware on July 1, 2003. We design, develop, manufacture, sell and lease high-performance fully electric vehicles and energy generation and storage systems, and offer services related to our products. Our Chief Executive Officer, as the chief operating decision maker (\"CODM\"), organizes our company, manages resource allocations and measures performance among two operating and reportable segments: (i) automotive and (ii) energy generation and storage.",
    "section": "Note 1 - Overview",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 64,
    "text": "Furthermore, in connection with the offerings of our convertible senior notes, we entered into convertible note hedges and warrants (see Note 11, Debt). However, our convertible note hedges are not included when calculating potentially dilutive shares since their effect is always anti-dilutive. The strike price on the warrants were below our average share price during the period and were included in the tables below. Warrants are included in the weighted-average shares used in computing basic net income per share of common stock in the period(s) they are settled.\n\n59\n\n* * *",
    "section": "Basic net income per share of common stock attributable to common stockholders is calculated by dividing net income attributable to common stockholders by the weighted-average shares of common stock outstanding for the period. Potentially dilutive shares, which are based on the weighted-average shares of common stock underlying outstanding stock-based awards, warrants and convertible senior notes using the treasury stock method or the if-converted method, as applicable, are included when calculating diluted net income per share of common stock attributable to common stockholders when their effect is dilutive.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 65,
    "text": "Less: Buy-out of noncontrolling interest                                                              (27     )           (5     )          31",
    "section": "Net income attributable to common stockholders                               $                        12,556           $  5,519          $  721",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 66,
    "text": "Less: Dilutive convertible debt                                                                       (1      )           (9     )          --",
    "section": "Net income used in computing basic net income per share of common stock                               12,583              5,524             690",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 67,
    "text": "2022                           2021        2020\n\nStock-based awards                                       4             1             6",
    "section": "Year Ended December 31,",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 68,
    "text": "solar energy system lease acquisition\n\ncosts        Lease term (up to 25 years)",
    "section": "Initial direct costs related to customer",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 69,
    "text": "Property, Plant and Equipment, Net\n\nProperty, plant and equipment, net, including leasehold improvements, are recognized at cost less accumulated depreciation. Depreciation is generally computed using the straight-line method over the estimated useful lives of the respective assets, as follows:\n\n\n\nMachinery, equipment, vehicles and\n\noffice furniture                          3 to 15 years",
    "section": "Solar energy systems pending interconnection will be depreciated as solar energy systems in service when they have been interconnected and placed in-service. Solar energy systems under construction represents systems that are under installation, which will be depreciated as solar energy systems in service when they are completed, interconnected and placed in service. Initial direct costs related to customer solar energy system agreement acquisition costs are capitalized and amortized over the term of the related customer agreements.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 70,
    "text": "63\n\n* * *\n\nLong-Lived Assets Including Acquired Intangible Assets",
    "section": "Interest expense on outstanding debt is capitalized during the period of significant capital asset construction. Capitalized interest on construction in progress is included within Property, plant and equipment, net and is amortized over the life of the related assets.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 71,
    "text": "including expirations and foreign exchange impact       522           102           66",
    "section": "Net changes in liability for pre-existing warranties,",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 72,
    "text": "Globally, the operation of our business is impacted by various government programs, incentives, and other arrangements. Government incentives are recorded in our consolidated financial statements in accordance with their purpose as a reduction of expense, or an offset to the related capital asset. The benefit is generally recorded when all conditions attached to the incentive have been met or are expected to be met and there is reasonable assurance of their receipt. The government incentives received by us are immaterial in all periods presented since the adoption of ASU 2021-10.",
    "section": "Government Assistance Programs and Incentives",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 73,
    "text": "Accordingly, the cumulative effect of the changes made on our January 1, 2021 consolidated balance sheet for the adoption of the ASU was as follows (in millions):",
    "section": "On January 1, 2021, we adopted the ASU using the modified retrospective method. We recognized a cumulative effect of initially applying the ASU as an adjustment to the January 1, 2021 opening balance of accumulated deficit. Due to the recombination of the equity conversion component of our convertible debt remaining outstanding, additional paid in capital and convertible senior notes (mezzanine equity) were reduced. The removal of the remaining debt discounts recorded for this previous separation had the effect of increasing our net debt balance and the reduction of property, plant and equipment was related to previously capitalized interest. The prior period consolidated financial statements have not been retrospectively adjusted and continue to be reported under the accounting standards in effect for those periods.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 74,
    "text": "Property, plant and equipment, net                 $  12,747       $  (45   )    $  12,702",
    "section": "Assets",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 75,
    "text": "ASC 820 states that fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or a liability. The three-tiered fair value hierarchy, which prioritizes which inputs should be used in measuring fair value, is comprised of: (Level I) observable inputs such as quoted prices in active markets; (Level II) inputs other than quoted prices in active markets that are observable either directly or indirectly and (Level III) unobservable inputs for which there is little or no market data. The fair value hierarchy requires the use of observable market data when available in determining fair value. Our assets and liabilities that were measured at fair value on a recurring basis were as follows (in millions):",
    "section": "Note 5 - Fair Value of Financial Instruments",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 76,
    "text": "U.S. government securities                                      894                            --                    894                        --                --                    --                --          --",
    "section": "Money market funds                           $                  2,188                       $  2,188              $  --             $           --             $  9,548              $  9,548          $  --       $  --",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 77,
    "text": "U.S. government securities                                                    897                                  --                                (3          )                               894                                  --             894",
    "section": "Money market funds                                                            2,188                                --                                --                                          2,188                                2,188          --",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 78,
    "text": "system lease acquisition costs                            104             104\n\n6,889           6,913\n\nLess: accumulated depreciation and amortization (1)       (1,418  )       (1,187  )\n\n5,471           5,726",
    "section": "Initial direct costs related to customer solar energy",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 79,
    "text": "2022                     2021\n\nMachinery, equipment, vehicles and office furniture    $             13,558                   $  9,953",
    "section": "December 31,             December 31,",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 80,
    "text": "32,589                      25,615\n\nLess: Accumulated depreciation                                       (9,041  )                   (6,731  )",
    "section": "Construction in progress                                             4,263                       5,559",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 81,
    "text": "2024 Notes                                   $                     --                          $    37                     $              37                               $                --           2.00            %                  May 2024",
    "section": "Recourse debt:",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 82,
    "text": "2022 Notes                                   $                      29                          $     --                     $               29                               $                  --                    2.375           %                             March 2022\n\n2024 Notes                                                          1                                 89                                     91                                                  --                    2.00            %                             May 2024",
    "section": "Recourse debt:",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 83,
    "text": "2023          $              0                        $  1,020           $  1,020\n\n2024                         37                          648                685\n\n2025                         4                           35                 39\n\n2026                         0                           35                 35\n\n2027                         --                          25                 25",
    "section": "Recourse debt        Non-recourse debt            Total",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 84,
    "text": "Long-term debt and finance leases, net of current portion                       568                            991",
    "section": "Current portion of long-term debt and finance leases         $                  486                         $  501",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 85,
    "text": "2023                                      $          610               $  534\n\n2024                                                 558                  387\n\n2025                                                 490                  122\n\n2026                                                 383                  52\n\n2027                                                 300                  31",
    "section": "Leases              Leases",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 86,
    "text": "Less: Current portion                                485                  486\n\nLong-term portion of lease obligations    $          2,164             $  568",
    "section": "Present value of lease obligations                   2,649                1,054",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 87,
    "text": "2023                       $          1,212                $  202\n\n2024                                  900                     208\n\n2025                                  463                     192\n\n2026                                  215                     174\n\n2027                                  194                     49",
    "section": "Leases              Leases",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 88,
    "text": "2023          $  26\n\n2024             18\n\n2025             27\n\n2026             28\n\n2027             29",
    "section": "Under a lease pass-through fund arrangement, the investor makes a large upfront payment to the lessor, which is one of our subsidiaries, and in some cases, subsequent periodic payments. As of December 31, 2022, the future minimum master lease payments to be received from investors, for each of the next five years and thereafter, were as follows (in millions):",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 89,
    "text": "(in thousands)              Price                 Life (years)          (in billions)       (in thousands)      Value",
    "section": "Options                     Exercise              Contractual           Value               of RSUs             Date Fair",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 90,
    "text": "to vest, December 31, 2022      343,105      $  30.61        5.19      $  32.75        21,323      $  162.33",
    "section": "Vested and expected",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 91,
    "text": "2022                                2021             2020\n\nRisk-free interest rate                                         3.11    %           0.66    %          0.26   %",
    "section": "Year Ended December 31,",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 92,
    "text": "(in billions)           Achievement Status                Milestone\n\n(in billions)           Achievement Status\n\n$              20.0                         Achieved                 $  1.5       Achieved\n\n$              35.0                         Achieved                 $  3.0       Achieved\n\n$              55.0                         Achieved                 $  4.5       Achieved\n\n$              75.0                         Achieved (1)             $  6.0       Achieved\n\n$              100.0                        -                        $  8.0       Achieved\n\n$              125.0                        -                        $  10.0      Achieved\n\n$              150.0                        -                        $  12.0      Achieved\n\n$              175.0                        -                        $  14.0      Achieved\n\n(1)",
    "section": "Milestone",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 93,
    "text": "79\n\n* * *\n\nStock-based compensation under the 2018 CEO Performance Award represents a non-cash expense and is recorded as a Selling, general, and administrative operating expense in our consolidated statements of operations. In each quarter since the grant of the 2018 CEO Performance Award, we have recognized expense, generally on a pro-rated basis, for only the number of tranches (up to the maximum of 12 tranches) that corresponds to the number of operational milestones that have been achieved or have been determined probable of being achieved in the future, in accordance with the following principles.",
    "section": "Achieved in the fourth quarter of 2022 and expected to be certified following the filing of this Annual Report on Form 10-K.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 94,
    "text": "A provision for income taxes of $1.13 billion, $699 million and $292 million has been recognized for the years ended December 31, 2022, 2021 and 2020, respectively, related primarily to our subsidiaries located outside of the U.S. Our income before provision for income taxes for the years ended December 31, 2022, 2021 and 2020 was as follows (in millions):",
    "section": "Note 14 - Income Taxes",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 95,
    "text": "U.S. tax credits                      (276  )      (328    )      (181  )",
    "section": "Foreign income rate differential      (923  )      (668    )      33",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 96,
    "text": "noncontrolling interests adjustment       42              11            5\n\nGILTI inclusion                           1,279           1,008         133",
    "section": "Noncontrolling interests and redeemable",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 97,
    "text": "Additionally, on June 1, 2022 the Equal Employment Opportunity Commission (\"EEOC\") issued a cause finding against Tesla that closely parallels the CRD's allegations. Tesla is in the process of setting up a mandatory mediation with the EEOC.",
    "section": "On February 9, 2022, shortly after the Diaz jury verdict, the California Civil Rights Department (\"CRD,\" formerly \"DFEH\") filed a civil complaint against Tesla in Alameda County, California Superior Court, alleging systemic race discrimination, hostile work environment and pay equity claims, among others. CRD's amended complaint seeks monetary damages and injunctive relief. On September 22, 2022, Tesla filed a cross complaint against CRD, alleging that it violated the Administrative Procedures Act by failing to follow statutory pre-requisites prior to filing suit and that cross complaint was subject to a sustained demurrer. Tesla has until February 3, 2023 to amend its cross complaint. The case is now in discovery.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 98,
    "text": "Separately, the company has received requests from the DOJ for documents related to Tesla's Autopilot and FSD features. To our knowledge no government agency in any ongoing investigation has concluded that any wrongdoing occurred. We cannot predict the outcome or impact of any ongoing matters. Should the government decide to pursue an enforcement action, there exists the possibility of a material adverse impact on our business, results of operation, prospects, cash flows and financial position.",
    "section": "For example, the SEC had issued subpoenas to Tesla in connection with Elon Musk's prior statement that he was considering taking Tesla private. The take-private investigation was resolved and closed with a settlement entered into with the SEC in September 2018 and as further clarified in April 2019 in an amendment. The SEC also has periodically issued subpoenas to us seeking information on our governance processes around compliance with the SEC settlement, as amended.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 99,
    "text": "Generally, our subsidiary has the option to acquire the fund investor's interest in the fund for an amount based on the market value of the fund or the formula specified in the agreements.",
    "section": "As the primary beneficiary of these VIEs, we consolidate in the financial statements the financial position, results of operations and cash flows of these VIEs, and all intercompany balances and transactions between us and these VIEs are eliminated in the consolidated financial statements. Cash distributions of income and other receipts by a fund, net of agreed upon expenses, estimated expenses, tax benefits and detriments of income and loss and tax credits, are allocated to the fund investor and our subsidiary as specified in the agreements.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 100,
    "text": "Management's Report on Internal Control over Financial Reporting",
    "section": "Based on this evaluation, our Chief Executive Officer and our Chief Financial Officer concluded that, as of December 31, 2022, our disclosure controls and procedures were designed at a reasonable assurance level and were effective to provide reasonable assurance that the information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 101,
    "text": "1\\. Financial statements (see Index to Consolidated Financial Statements in Part II, Item 8 of this report)\n\n2\\. All financial statement schedules have been omitted since the required information was not applicable or was not present in amounts sufficient to require submission of the schedules, or because the information required is included in the consolidated financial statements or the accompanying notes\n\n3\\. The exhibits listed in the following Index to Exhibits are filed or incorporated by reference as part of this report\n\n92\n\n* * *",
    "section": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 102,
    "text": "3.1        Amended and Restated Certificate of Incorporation of the Registrant.                                                                                                                                                                                           10-K                         001-34756     3.1        March 1, 2017\n\n3.2        Certificate of Amendment to the Amended and Restated Certificate of Incorporation of the Registrant.                                                                                                                                                           10-K                         001-34756     3.2        March 1, 2017\n\n3.3        Amended and Restated Bylaws of the Registrant.                                                                                                                                                                                                                 8-K                          001-34756     3.2        February 1, 2017\n\n4.1        Specimen common stock certificate of the Registrant.                                                                                                                                                                                                           10-K                         001-34756     4.1        March 1, 2017\n\n4.2        Fifth Amended and Restated Investors' Rights Agreement, dated as of August 31, 2009, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                                   S-1                          333-164593    4.2        January 29, 2010\n\n4.3        Amendment to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 20, 2010, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                         S-1/A                        333-164593    4.2A       May 27, 2010\n\n4.4        Amendment to Fifth Amended and Restated Investors' Rights Agreement between Registrant, Toyota Motor Corporation and certain holders of the Registrant's capital stock named therein.                                                                          S-1/A                        333-164593    4.2B       May 27, 2010\n\n4.5        Amendment to Fifth Amended and Restated Investor's Rights Agreement, dated as of June 14, 2010, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                        S-1/A                        333-164593    4.2C       June 15, 2010\n\n4.6        Amendment to Fifth Amended and Restated Investor's Rights Agreement, dated as of November 2, 2010, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                     8-K                          001-34756     4.1        November 4, 2010\n\n4.7        Waiver to Fifth Amended and Restated Investor's Rights Agreement, dated as of May 22, 2011, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                            S-1/A                        333-174466    4.2E       June 2, 2011\n\n4.8        Amendment to Fifth Amended and Restated Investor's Rights Agreement, dated as of May 30, 2011, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                         8-K                          001-34756     4.1        June 1, 2011\n\n4.9        Sixth Amendment to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 15, 2013 among the Registrant, the Elon Musk Revocable Trust dated July 22, 2003 and certain other holders of the capital stock of the Registrant named therein.    8-K                          001-34756     4.1        May 20, 2013\n\n93\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                            Form                         File No.      Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 103,
    "text": "4.10       Waiver to Fifth Amended and Restated Investor's Rights Agreement, dated as of May 14, 2013, between the Registrant and certain holders of the capital stock of the Registrant named therein.       8-K                          001-34756    4.2        May 20, 2013\n\n4.11       Waiver to Fifth Amended and Restated Investor's Rights Agreement, dated as of August 13, 2015, between the Registrant and certain holders of the capital stock of the Registrant named therein.    8-K                          001-34756    4.1        August 19, 2015\n\n4.12       Waiver to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 18, 2016, between the Registrant and certain holders of the capital stock of the Registrant named therein.       8-K                          001-34756    4.1        May 24, 2016\n\n4.13       Waiver to Fifth Amended and Restated Investors' Rights Agreement, dated as of March 15, 2017, between the Registrant and certain holders of the capital stock of the Registrant named therein.     8-K                          001-34756    4.1        March 17, 2017\n\n4.14       Waiver to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 1, 2019, between the Registrant and certain holders of the capital stock of the Registrant named therein.        8-K                          001-34756    4.1        May 3, 2019\n\n4.15       Indenture, dated as of May 22, 2013, by and between the Registrant and U.S. Bank National Association.                                                                                             8-K                          001-34756    4.1        May 22, 2013\n\n4.16       Fourth Supplemental Indenture, dated as of March 22, 2017, by and between the Registrant and U.S. Bank National Association.                                                                       8-K                          001-34756    4.2        March 22, 2017\n\n4.17       Form of 2.375% Convertible Senior Note Due March 15, 2022 (included in Exhibit 4.18).                                                                                                              8-K                          001-34756    4.2        March 22, 2017\n\n4.18       Fifth Supplemental Indenture, dated as of May 7, 2019, by and between Registrant and U.S. Bank National Association, related to 2.00% Convertible Senior Notes due May 15, 2024.                   8-K                          001-34756    4.2        May 8, 2019\n\n4.19       Form of 2.00% Convertible Senior Notes due May 15, 2024 (included in Exhibit 4.20).                                                                                                                8-K                          001-34756    4.2        May 8, 2019\n\n94\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                Form                         File No.     Exhibit    Filing Date        Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 104,
    "text": "4.20       Indenture, dated as of October 15, 2014, between SolarCity and U.S. Bank National Association, as trustee.                                                                  S-3ASR(1)                    333-199321    4.1        October 15, 2014\n\n4.21       Tenth Supplemental Indenture, dated as of March 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/6-10.              8-K(1)                       001-35758     4.3        March 9, 2015\n\n4.22       Eleventh Supplemental Indenture, dated as of March 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/7-15.           8-K(1)                       001-35758     4.4        March 9, 2015\n\n4.23       Fifteenth Supplemental Indenture, dated as of March 19, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C4-10.        8-K(1)                       001-35758     4.5        March 19, 2015\n\n4.24       Sixteenth Supplemental Indenture, dated as of March 19, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C5-15.        8-K(1)                       001-35758     4.6        March 19, 2015\n\n4.25       Twentieth Supplemental Indenture, dated as of March 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C9-10.        8-K(1)                       001-35758     4.5        March 26, 2015\n\n4.26       Twenty-First Supplemental Indenture, dated as of March 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C10-15.    8-K(1)                       001-35758     4.6        March 26, 2015\n\n4.27       Twenty-Sixth Supplemental Indenture, dated as of April 2, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C14-10.     8-K(1)                       001-35758     4.5        April 2, 2015\n\n4.28       Thirtieth Supplemental Indenture, dated as of April 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C19-10.        8-K(1)                       001-35758     4.5        April 9, 2015\n\n4.29       Thirty-First Supplemental Indenture, dated as of April 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C20-15.     8-K(1)                       001-35758     4.6        April 9, 2015\n\n4.30       Thirty-Fifth Supplemental Indenture, dated as of April 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C24-10.    8-K(1)                       001-35758     4.5        April 14, 2015\n\n4.31       Thirty-Sixth Supplemental Indenture, dated as of April 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C25-15.    8-K(1)                       001-35758     4.6        April 14, 2015\n\n95\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                         Form                         File No.      Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 105,
    "text": "4.32       Thirty-Eighth Supplemental Indenture, dated as of April 21, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C27-10.    8-K(1)                       001-35758    4.3        April 21, 2015\n\n4.33       Thirty-Ninth Supplemental Indenture, dated as of April 21, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C28-15.     8-K(1)                       001-35758    4.4        April 21, 2015\n\n4.34       Forty-Third Supplemental Indenture, dated as of April 27, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C32-10.      8-K(1)                       001-35758    4.5        April 27, 2015\n\n4.35       Forty-Fourth Supplemental Indenture, dated as of April 27, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C33-15.     8-K(1)                       001-35758    4.6        April 27, 2015\n\n4.36       Forty-Eighth Supplemental Indenture, dated as of May 1, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/12-10.         8-K(1)                       001-35758    4.5        May 1, 2015\n\n4.37       Forty-Ninth Supplemental Indenture, dated as of May 1, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/13-15.          8-K(1)                       001-35758    4.6        May 1, 2015\n\n4.38       Fifty-Second Supplemental Indenture, dated as of May 11, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C36-10.       8-K(1)                       001-35758    4.4        May 11, 2015\n\n4.39       Fifty-Third Supplemental Indenture, dated as of May 11, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C37-15.        8-K(1)                       001-35758    4.5        May 11, 2015\n\n4.40       Fifty-Seventh Supplemental Indenture, dated as of May 18, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C40-10.      8-K(1)                       001-35758    4.4        May 18, 2015\n\n4.41       Fifty-Eighth Supplemental Indenture, dated as of May 18, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C41-15.       8-K(1)                       001-35758    4.5        May 18, 2015\n\n4.42       Sixty-First Supplemental Indenture, dated as of May 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C44-10.        8-K(1)                       001-35758    4.4        May 26, 2015\n\n4.43       Sixty-Second Supplemental Indenture, dated as of May 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C45-15.       8-K(1)                       001-35758    4.5        May 26, 2015\n\n96\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                          Form                         File No.     Exhibit    Filing Date       Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 106,
    "text": "4.44       Seventieth Supplemental Indenture, dated as of June 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C52-10.                    8-K(1)                       001-35758    4.4        June 16, 2015\n\n4.45       Seventy-First Supplemental Indenture, dated as of June 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C53-15.                 8-K(1)                       001-35758    4.5        June 16, 2015\n\n4.46       Seventy-Fourth Supplemental Indenture, dated as of June 22, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C56-10.                8-K(1)                       001-35758    4.4        June 23, 2015\n\n4.47       Seventy-Fifth Supplemental Indenture, dated as of June 22, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C57-15.                 8-K(1)                       001-35758    4.5        June 23, 2015\n\n4.48       Eightieth Supplemental Indenture, dated as of June 29, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C61-10.                     8-K(1)                       001-35758    4.5        June 29, 2015\n\n4.49       Eighty-First Supplemental Indenture, dated as of June 29, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C62-15.                  8-K(1)                       001-35758    4.6        June 29, 2015\n\n4.50       Ninetieth Supplemental Indenture, dated as of July 20, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C71-10.                     8-K(1)                       001-35758    4.5        July 21, 2015\n\n4.51       Ninety-First Supplemental Indenture, dated as of July 20, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C72-15.                  8-K(1)                       001-35758    4.6        July 21, 2015\n\n4.52       Ninety-Fifth Supplemental Indenture, dated as of July 31, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/20-10.                   8-K(1)                       001-35758    4.5        July 31, 2015\n\n4.53       Ninety-Sixth Supplemental Indenture, dated as of July 31, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/21-15.                   8-K(1)                       001-35758    4.6        July 31, 2015\n\n4.54       One Hundred-and-Fifth Supplemental Indenture, dated as of August 10, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C81-10.       8-K(1)                       001-35758    4.5        August 10, 2015\n\n4.55       One Hundred-and-Eleventh Supplemental Indenture, dated as of August 17, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C87-15.    8-K(1)                       001-35758    4.6        August 17, 2015\n\n97\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                      Form                         File No.     Exhibit    Filing Date        Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 107,
    "text": "4.56       One Hundred-and-Sixteenth Supplemental Indenture, dated as of August 24, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C92-15.            8-K(1)                       001-35758    4.6        August 24, 2015\n\n4.57       One Hundred-and-Twenty-First Supplemental Indenture, dated as of August 31, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C97-15.         8-K(1)                       001-35758    4.6        August 31, 2015\n\n4.58       One Hundred-and-Twenty-Eighth Supplemental Indenture, dated as of September 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C101-10.    8-K(1)                       001-35758    4.5        September 15, 2015\n\n4.59       One Hundred-and-Twenty-Ninth Supplemental Indenture, dated as of September 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C102-15.     8-K(1)                       001-35758    4.6        September 15, 2015\n\n4.60       One Hundred-and-Thirty-Third Supplemental Indenture, dated as of September 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C106-10.     8-K(1)                       001-35758    4.5        September 29, 2015\n\n4.61       One Hundred-and-Thirty-Fourth Supplemental Indenture, dated as of September 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C107-15.    8-K(1)                       001-35758    4.6        September 29, 2015\n\n4.62       One Hundred-and-Thirty-Eighth Supplemental Indenture, dated as of October 13, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C111-10.      8-K(1)                       001-35758    4.5        October 13, 2015\n\n4.63       One Hundred-and-Forty-Third Supplemental Indenture, dated as of October 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/25-10.          8-K(1)                       001-35758    4.5        October 30, 2015\n\n4.64       One Hundred-and-Forty-Fourth Supplemental Indenture, dated as of October 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/26-15.         8-K(1)                       001-35758    4.6        October 30, 2015\n\n4.65       One Hundred-and-Forty-Eighth Supplemental Indenture, dated as of November 4, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C116-10.       8-K(1)                       001-35758    4.5        November 4, 2015\n\n98\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                               Form                         File No.     Exhibit    Filing Date           Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 108,
    "text": "4.66       One Hundred-and-Fifty-Third Supplemental Indenture, dated as of November 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C121-10.     8-K(1)                       001-35758    4.5        November 17, 2015\n\n4.67       One Hundred-and-Fifty-Fourth Supplemental Indenture, dated as of November 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C122-15.    8-K(1)                       001-35758    4.6        November 17, 2015\n\n4.68       One Hundred-and-Fifty-Eighth Supplemental Indenture, dated as of November 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C126-10.    8-K(1)                       001-35758    4.5        November 30, 2015\n\n4.69       One Hundred-and-Fifty-Ninth Supplemental Indenture, dated as of November 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C127-15.     8-K(1)                       001-35758    4.6        November 30, 2015\n\n4.70       One Hundred-and-Sixty-Third Supplemental Indenture, dated as of December 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C131-10.     8-K(1)                       001-35758    4.5        December 14, 2015\n\n4.71       One Hundred-and-Sixty-Fourth Supplemental Indenture, dated as of December 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C132-15.    8-K(1)                       001-35758    4.6        December 14, 2015\n\n4.72       One Hundred-and-Sixty-Eighth Supplemental Indenture, dated as of December 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C136-10.    8-K(1)                       001-35758    4.5        December 28, 2015\n\n4.73       One Hundred-and-Sixty-Ninth Supplemental Indenture, dated as of December 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C137-15.     8-K(1)                       001-35758    4.6        December 28, 2015\n\n4.74       One Hundred-and-Seventy-Third Supplemental Indenture, dated as of January 29, 2016, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2016/4-10.       8-K(1)                       001-35758    4.5        January 29, 2016\n\n4.75       One Hundred-and-Seventy-Fourth Supplemental Indenture, dated as of January 29, 2016, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2016/5-15.      8-K(1)                       001-35758    4.6        January 29, 2016\n\n4.76       Description of Registrant's Securities                                                                                                                                                          10-K                         001-34756    4.119      February 13, 2020\n\n99\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                             Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 109,
    "text": "10.1**     Form of Indemnification Agreement between the Registrant and its directors and officers.                                   S-1/A                        333-164593    10.1          June 15, 2010\n\n10.2**     2003 Equity Incentive Plan.                                                                                                S-1/A                        333-164593    10.2          May 27, 2010\n\n10.3**     Form of Stock Option Agreement under 2003 Equity Incentive Plan.                                                           S-1                          333-164593    10.3          January 29, 2010\n\n10.4**     Amended and Restated 2010 Equity Incentive Plan.                                                                           10-K                         001-34756     10.4          February 23, 2018\n\n10.5**     Form of Stock Option Agreement under 2010 Equity Incentive Plan.                                                           10-K                         001-34756     10.6          March 1, 2017\n\n10.6**     Form of Restricted Stock Unit Award Agreement under 2010 Equity Incentive Plan.                                            10-K                         001-34756     10.7          March 1, 2017\n\n10.7**     Amended and Restated 2010 Employee Stock Purchase Plan, effective as of February 1, 2017.                                  10-K                         001-34756     10.8          March 1, 2017\n\n10.8**     2019 Equity Incentive Plan.                                                                                                S-8                          333-232079    4.2           June 12, 2019\n\n10.9**     Form of Stock Option Agreement under 2019 Equity Incentive Plan.                                                           S-8                          333-232079    4.3           June 12, 2019\n\n10.10**    Form of Restricted Stock Unit Award Agreement under 2019 Equity Incentive Plan.                                            S-8                          333-232079    4.4           June 12, 2019\n\n10.11**    Employee Stock Purchase Plan, effective as of June 12, 2019.                                                               S-8                          333-232079    4.5           June 12, 2019\n\n10.12**    2007 SolarCity Stock Plan and form of agreements used thereunder.                                                          S-1(1)                       333-184317    10.2          October 5, 2012\n\n10.13**    2012 SolarCity Equity Incentive Plan and form of agreements used thereunder.                                               S-1(1)                       333-184317    10.3          October 5, 2012\n\n10.14**    2010 Zep Solar, Inc. Equity Incentive Plan and form of agreements used thereunder.                                         S-8(1)                       333-192996    4.5           December 20, 2013\n\n10.15**    Offer Letter between the Registrant and Elon Musk dated October 13, 2008.                                                  S-1                          333-164593    10.9          January 29, 2010\n\n10.16**    Performance Stock Option Agreement between the Registrant and Elon Musk dated January 21, 2018.                            DEF 14A                      001-34756     Appendix A    February 8, 2018\n\n10.17**    Maxwell Technologies, Inc. 2005 Omnibus Equity Incentive Plan, as amended through May 6, 2010                              8-K(2)                       001-15477     10.1          May 10, 2010\n\n10.18**    Maxwell Technologies, Inc. 2013 Omnibus Equity Incentive Plan                                                              DEF 14A(2)                   001-15477     Appendix A    June 2, 2017\n\n10.19      Indemnification Agreement, effective as of June 23, 2020, between Registrant and Elon R. Musk.                             10-Q                         001-34756     10.4          July 28, 2020\n\n10.20      Indemnification Agreement, dated as of February 27, 2014, by and between the Registrant and J.P. Morgan Securities LLC.    8-K                          001-34756     10.1          March 5, 2014\n\n10.21      Form of Call Option Confirmation relating to 1.25% Convertible Senior Notes Due March 1, 2021.                             8-K                          001-34756     10.3          March 5, 2014\n\n100\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                        Form                         File No.      Exhibit       Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 110,
    "text": "10.22      Form of Warrant Confirmation relating to 1.25% Convertible Senior Notes Due March 1, 2021.                                                                                                                                         8-K                          001-34756    10.5       March 5, 2014\n\n10.23      Form of Call Option Confirmation relating to 2.00% Convertible Senior Notes due May 15, 2024.                                                                                                                                      8-K                          001-34756    10.1       May 3, 2019\n\n10.24      Form of Warrant Confirmation relating to 2.00% Convertible Senior Notes due May 15, 2024.                                                                                                                                          8-K                          001-34756    10.2       May 3, 2019\n\n10.25†     Supply Agreement between Panasonic Corporation and the Registrant dated October 5, 2011.                                                                                                                                           10-K                         001-34756    10.50      February 27, 2012\n\n10.26†     Amendment No. 1 to Supply Agreement between Panasonic Corporation and the Registrant dated October 29, 2013.                                                                                                                       10-K                         001-34756    10.35A     February 26, 2014\n\n10.27      Agreement between Panasonic Corporation and the Registrant dated July 31, 2014.                                                                                                                                                    10-Q                         001-34756    10.1       November 7, 2014\n\n10.28†     General Terms and Conditions between Panasonic Corporation and the Registrant dated October 1, 2014.                                                                                                                               8-K                          001-34756    10.2       October 11, 2016\n\n10.29      Letter Agreement, dated as of February 24, 2015, regarding addition of co-party to General Terms and Conditions, Production Pricing Agreement and Investment Letter Agreement between Panasonic Corporation and the Registrant.    10-K                         001-34756    10.25A     February 24, 2016\n\n10.30†     Amendment to Gigafactory General Terms, dated March 1, 2016, by and among the Registrant, Panasonic Corporation and Panasonic Energy Corporation of North America.                                                                 8-K                          001-34756    10.1       October 11, 2016\n\n10.31††    Amended and Restated General Terms and Conditions for Gigafactory, entered into on June 10, 2020, by and among Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and Panasonic Corporation of North America.        10-Q                         001-34756    10.2       July 28, 2020\n\n10.32†     Production Pricing Agreement between Panasonic Corporation and the Registrant dated October 1, 2014.                                                                                                                               10-Q                         001-34756    10.3       November 7, 2014\n\n10.33†     Investment Letter Agreement between Panasonic Corporation and the Registrant dated October 1, 2014.                                                                                                                                10-Q                         001-34756    10.4       November 7, 2014\n\n101\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 111,
    "text": "10.34      Amendment to Gigafactory Documents, dated April 5, 2016, by and among the Registrant, Panasonic Corporation, Panasonic Corporation of North America and Panasonic Energy Corporation of North America.                                                                                                                                                                                                                                                                                                                                                                                           10-Q                         001-34756     10.2       May 10, 2016\n\n10.35††    2019 Pricing Agreement (Japan Cells) with respect to 2011 Supply Agreement, executed September 20, 2019, by and among the Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and SANYO Electric Co., Ltd.                                                                                                                                                                                                                                                                                                                                                                          10-Q                         001-34756     10.6       October 29, 2019\n\n10.36††    2020 Pricing Agreement (Gigafactory 2170 Cells), entered into on June 9, 2020, by and among Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and Panasonic Corporation of North America.                                                                                                                                                                                                                                                                                                                                                                                         10-Q                         001-34756     10.3       July 28, 2020\n\n10.37††    2021 Pricing Agreement (Japan Cells) with respect to 2011 Supply Agreement, executed December 29, 2020, by and among the Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation of North America and SANYO Electric Co., Ltd.                                                                                                                                                                                                                                                                                                                                                          10-K                         001-34756     10.39      February 8, 2021\n\n10.38††    Amended and Restated Factory Lease, executed as of March 26, 2019, by and between the Registrant and Panasonic Energy North America, a division of Panasonic Corporation of North America, as tenant.                                                                                                                                                                                                                                                                                                                                                                                            10-Q                         001-34756     10.3       July 29, 2019\n\n10.39††    Lease Amendment, executed September 20, 2019, by and among the Registrant, Panasonic Corporation of North America, on behalf of its division Panasonic Energy of North America, with respect to the Amended and Restated Factory Lease, executed as of March 26, 2019.                                                                                                                                                                                                                                                                                                                           10-Q                         001-34756     10.7       October 29, 2019\n\n10.40††    Second Lease Amendment, entered into on June 9, 2020, by and between the Registrant and Panasonic Energy of North America, a division of Panasonic Corporation of North America, with respect to the Amended and Restated Factory Lease dated January 1, 2017.                                                                                                                                                                                                                                                                                                                                   10-Q                         001-34756     10.1       July 28, 2020\n\n10.41      Amendment and Restatement in respect of ABL Credit Agreement, dated as of March 6, 2019, by and among certain of the Registrant's and Tesla Motors Netherlands B.V.'s direct or indirect subsidiaries from time to time party thereto, as borrowers, Wells Fargo Bank, National Association, as documentation agent, JPMorgan Chase Bank, N.A., Goldman Sachs Bank USA, Morgan Stanley Senior Funding Inc. and Bank of America, N.A., as syndication agents, the lenders from time to time party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent.    S-4/A                        333-229749    10.68      April 3, 2019\n\n102\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              Form                         File No.      Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 112,
    "text": "10.42      First Amendment to Amended and Restated ABL Credit Agreement, dated as of December 23, 2020, in respect of the Amended and Restated ABL Credit Agreement, dated as of March 6, 2019, by and among certain of the Registrant's and Tesla Motors Netherlands B.V.'s direct or indirect subsidiaries from time to time party thereto, as borrowers, Wells Fargo Bank, National Association, as documentation agent, JPMorgan Chase Bank, N.A., Goldman Sachs Bank USA, Morgan Stanley Senior Funding Inc. and Bank of America, N.A., as syndication agents, the lenders from time to time party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent.    10-K                         001-34756    10.44      February 8, 2021\n\n10.43†     Agreement for Tax Abatement and Incentives, dated as of May 7, 2015, by and between Tesla Motors, Inc. and the State of Nevada, acting by and through the Nevada Governor's Office of Economic Development.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  10-Q                         001-34756    10.1       August 7, 2015\n\n10.44      Purchase Agreement, dated as of August 11, 2017, by and among the Registrant, SolarCity and Goldman Sachs & Co. LLC and Morgan Stanley & Co. LLC as representatives of the several initial purchasers named therein.                                                                                                                                                                                                                                                                                                                                                                                                                                                                         8-K                          001-34756    10.1       August 23, 2017\n\n10.45      Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of September 2, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.                                                                                                                                                                                                                                                                                                                                                           10-Q(1)                      001-35758    10.16      November 6, 2014\n\n10.46      First Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 31, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.                                                                                                                                                                                                                                                                                                                                         10-K(1)                      001-35758    10.16a     February 24, 2015\n\n10.47      Second Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of December 15, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.                                                                                                                                                                                                                                                                                                                                       10-K(1)                      001-35758    10.16b     February 24, 2015\n\n103\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 113,
    "text": "10.48      Third Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of February 12, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.    10-Q(1)                      001-35758    10.16c     May 6, 2015\n\n10.49      Fourth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of March 30, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.      10-Q(1)                      001-35758    10.16d     May 6, 2015\n\n10.50      Fifth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of June 30, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.        10-Q(1)                      001-35758    10.16e     July 30, 2015\n\n10.51      Sixth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of September 1, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.    10-Q(1)                      001-35758    10.16f     October 30, 2015\n\n10.52      Seventh Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 9, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.    10-Q(1)                      001-35758    10.16g     October 30, 2015\n\n10.53      Eighth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 26, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.    10-Q(1)                      001-35758    10.16h     October 30, 2015\n\n104\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                      Form                         File No.     Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 114,
    "text": "10.54      Ninth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of December 9, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.    10-K(1)    001-35758    10.16i     February 10, 2016\n\n10.55      Tenth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of March 31, 2017, by and between The Research Foundation For The State University of New York, on behalf of the Colleges of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.     10-Q       001-34756    10.8       May 10, 2017\n\n10.56      Eleventh Amendment to Amended and Restated Agreement for Research & Development Alliance on Triex Module Technology, effective as of July 22, 2020, among the Research Foundation for the State University of New York, Silevo, LLC and Tesla Energy Operations, Inc.                                                                                   10-Q       001-34756    10.6       July 28, 2020\n\n10.57      Twelfth Amendment to Amended and Restated Agreement for Research & Development Alliance on Triex Module Technology, effective as of May 1, 2021, among the Research Foundation for the State University of New York, Silevo, LLC and Tesla Energy Operations, Inc.                                                                                      10-Q       001-34756    10.1       October 25, 2021\n\n10.58††    Grant Contract for State-Owned Construction Land Use Right, dated as of October 17, 2018, by and between Shanghai Planning and Land Resource Administration Bureau, as grantor, and Tesla (Shanghai) Co., Ltd., as grantee (English translation).                                                                                                       10-Q       001-34756    10.2       July 29, 2019\n\n10.59      Credit Agreement, dated as of January 20, 2023, among Tesla, Inc., the Lenders and Issuing Banks from time to time party thereto, Citibank, N.A., as Administrative Agent and Deutsche Bank Securities, Inc., as Syndication Agent                                                                                                                      --         --           --         --                   X\n\n105\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                     Form       File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 115,
    "text": "21.1       List of Subsidiaries of the Registrant                                                                                                  --                           --          --         --             X\n\n23.1       Consent of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm                                                    --                           --          --         --             X\n\n31.1       Rule 13a-14(a) / 15(d)-14(a) Certification of Principal Executive Officer                                                               --                           --          --         --             X\n\n31.2       Rule 13a-14(a) / 15(d)-14(a) Certification of Principal Financial Officer                                                               --                           --          --         --             X\n\n32.1*      Section 1350 Certifications                                                                                                             --                           --          --         --             X\n\n101.INS    Inline XBRL Instance Document                                                                                                           --                           --          --         --             X\n\n101.SCH    Inline XBRL Taxonomy Extension Schema Document                                                                                          --                           --          --         --             X\n\n101.CAL    Inline XBRL Taxonomy Extension Calculation Linkbase Document.                                                                           --                           --          --         --             X\n\n101.DEF    Inline XBRL Taxonomy Extension Definition Linkbase Document                                                                             --                           --          --         --             X\n\n101.LAB    Inline XBRL Taxonomy Extension Label Linkbase Document                                                                                  --                           --          --         --             X\n\n101.PRE    Inline XBRL Taxonomy Extension Presentation Linkbase Document                                                                           --                           --          --         --             X\n\n104        Cover Page Interactive Data File (formatted as inline XBRL with applicable taxonomy extension information contained in Exhibits 101)\n\n* Furnished herewith\n\n** Indicates a management contract or compensatory plan or arrangement\n\n† Confidential treatment has been requested for portions of this exhibit\n\n†† Portions of this exhibit have been redacted in compliance with Regulation S-K Item 601(b)(10).\n\n(1) Indicates a filing of SolarCity\n\n(2) Indicates a filing of Maxwell Technologies, Inc.",
    "section": "Number     Exhibit Description                                                                                                                     Form                         File No.    Exhibit    Filing Date    Herewith",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 116,
    "text": "Tesla, Inc.\n\nDate: January 30, 2023    /s/ Elon Musk",
    "section": "Pursuant to the requirements of Section 13 or 15(d) the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 117,
    "text": "/s/ Elon Musk                   Chief Executive Officer and Director (Principal Executive Officer)    January 30, 2023",
    "section": "Signature                       Title                                                                 Date",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 118,
    "text": "/s/ Zachary J. Kirkhorn         Chief Financial Officer (Principal Financial Officer)                 January 30, 2023",
    "section": "Elon Musk",
    "type": "section",
    "company": "TSLA",
    "year": null
  },
  {
    "chunk_id": 119,
    "text": "/s/ Vaibhav Taneja              Chief Accounting Officer (Principal Accounting Officer)               January 30, 2023",
    "section": "Zachary J. Kirkhorn",
    "type": "section",
    "company": "TSLA",
    "year": null
  }
]