[
  {
    "chunk_id": 1,
    "text": "COMPANY: TSLA\nYEAR: 2000",
    "section": null,
    "type": "info",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 2,
    "text": "(Mark One)\n\n☒   ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "FORM 10-K",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 3,
    "text": "OR\n\n☐   TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "For the fiscal year ended December 31, 2021",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 4,
    "text": "Tesla, Inc.\n\n(Exact name of registrant as specified in its charter)",
    "section": "Commission File Number: 001-34756",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 5,
    "text": "(State or other jurisdiction ofincorporation or organization)    (I.R.S. EmployerIdentification No.)\n\n13101 Tesla RoadAustin, Texas                                    78725\n\n(Address of principal executive offices)                         (Zip Code)\n\n(512) 516-8177\n\n(Registrant's telephone number, including area code)",
    "section": "Delaware                                                         91-2197729",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 6,
    "text": "Currently, we offer in our vehicles certain advanced driver assist systems under our Autopilot and FSD options. Although at present the driver is ultimately responsible for controlling the vehicle, our systems provide safety and convenience functionality that relieves drivers of the most tedious and potentially dangerous aspects of road travel much like the system that airplane pilots use, when conditions permit. As with other vehicle systems, we improve these functions in our vehicles over time through over-the-air updates.",
    "section": "We have expertise in developing technologies, systems and software to enable self-driving vehicles using primarily vision-based sensors. Our FSD Computer runs our neural networks in our vehicles, and we are also developing additional computer hardware to better enable the massive amounts of field data captured by our vehicles to continually train and improve these neural networks for real-world performance.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 7,
    "text": "Historically, we have been able to generate significant media coverage of our company and our products, and we believe we will continue to do so. Such media coverage and word of mouth are the current primary drivers of our sales leads and have helped us achieve sales without traditional advertising and at relatively low marketing costs.",
    "section": "Sales and Marketing",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 8,
    "text": "Generally, we continue to expand production capacity at our existing facilities. We also intend to further increase cost-competitiveness in our significant markets by strategically adding local manufacturing, including at Gigafactory Berlin in Germany and Gigafactory Texas in Austin, Texas, which will begin production in 2022.",
    "section": "Other Manufacturing",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 9,
    "text": "Globally, both the operation of our business by us and the ownership of our products by our customers are impacted by various government programs, incentives and other arrangements. Our business and products are also subject to numerous governmental regulations that vary among jurisdictions.",
    "section": "Governmental Programs, Incentives and Regulations",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 10,
    "text": "U.S. federal, state and local governments have established various policies, incentives and financial mechanisms to reduce the cost of solar energy and to accelerate the adoption of solar energy. These incentives include tax credits, cash grants, tax abatements and rebates.",
    "section": "Solar Energy System Incentives and Policies",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 11,
    "text": "Self-Driving Vehicles\n\nGenerally, laws pertaining to self-driving vehicles are evolving globally, and in some cases may create restrictions on features that we develop. While there are currently no federal U.S. regulations specifically pertaining to self-driving vehicles or self-driving equipment, NHTSA has published recommended guidelines on self-driving vehicles, and retains the authority to investigate and/or take action on the safety of any vehicle, equipment or features operating on public roads. Certain U.S. states also have legal restrictions on the operation, registration or licensure of self-driving vehicles, and many other states are considering them. This regulatory patchwork increases the legal complexity with respect to self-driving vehicles in the U.S.\n\n10\n\n* * *",
    "section": "Our vehicles sold outside of the U.S. are subject to similar foreign compliance, safety, environmental and other regulations. Many of those regulations are different from those applicable in the U.S. and may require redesign and/or retesting. Some of those regulations impact or prevent the rollout of new vehicle features. Additionally, the European Union established new rules regarding additional compliance oversight that commenced in 2020.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 12,
    "text": "Environmental, Social and Governance (ESG) and Human Capital Resources\n\nESG",
    "section": "We place a strong emphasis on our innovative approach and proprietary designs which bring intrinsic value and uniqueness to our product portfolio. As part of our business, we seek to protect the underlying intellectual property rights of these innovations and designs such as with respect to patents, trademarks, copyrights, trade secrets and other measures, including through employee and third-party nondisclosure agreements and other contractual arrangements. For example, we place a high priority on obtaining patents to provide the broadest and strongest possible protection to enable our freedom to operate our innovations and designs within our products and technologies in the electric vehicle market as well as to protect and defend our product portfolio. We have also adopted a patent policy in which we irrevocably pledged that we will not initiate a lawsuit against any party for infringing our patents through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith. We made this pledge in order to encourage the advancement of a common, rapidly-evolving platform for electric vehicles, thereby benefiting ourselves, other companies making electric vehicles and the world.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 13,
    "text": "14\n\n* * *\n\nfunctionalities, the autonomous Tesla ride-hailing network and robotics. Likewise, we may encounter delays with the design, construction and regulatory or other approvals necessary to build and bring online future manufacturing facilities and products.",
    "section": "We may also experience similar future delays in launching and/or ramping production of our energy storage products and Solar Roof; new product versions or variants such as the recently updated Model S and Model X; new vehicles such as Tesla Semi, Cybertruck and the new Tesla Roadster; and future features and services based on artificial intelligence, such as new Autopilot or FSD",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 14,
    "text": "Moreover, because of our unique expertise with our vehicles, we recommend that our vehicles be serviced by us or by certain authorized professionals. If we experience delays in adding servicing capacity or servicing our vehicles efficiently, or experience unforeseen issues with the reliability of our vehicles, particularly higher-volume and relatively newer additions to our fleet such as Model 3 and Model Y, it could overburden our servicing capabilities and parts inventory. Similarly, the increasing number of Tesla vehicles also requires us to continue to rapidly increase the number of our Supercharger stations and connectors throughout the world.",
    "section": "Because we do not have independent dealer networks, we are responsible for delivering all of our vehicles to our customers. We may face difficulties with deliveries at increasing volumes, particularly in international markets requiring significant transit times. For example, we saw challenges in ramping our logistics channels in China and Europe to initially deliver Model 3 there in the first quarter of 2019. We have deployed a number of delivery models, such as deliveries to customers' homes and workplaces and touchless deliveries, but there is no guarantee that such models will be scalable or be accepted globally. Likewise, as we ramp our energy products, we are working to substantially increase our production and installation capabilities. If we experience production delays or inaccurately forecast demand, our business, financial condition and operating results may be harmed.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 15,
    "text": "•\n\nperceptions about electric vehicle features, quality, safety, performance and cost;\n\n•\n\nperceptions about the limited range over which electric vehicles may be driven on a single battery charge, and access to charging facilities;\n\n•\n\ncompetition, including from other types of alternative fuel vehicles, plug-in hybrid electric vehicles and high fuel-economy internal combustion engine vehicles;\n\n•\n\nvolatility in the cost of oil and gasoline, such as wide fluctuations in crude oil prices during 2020;\n\n•\n\ngovernment regulations and economic incentives; and\n\n•\n\nconcerns about our future viability.\n\n15\n\n* * *\n\nFinally, the target demographics for our vehicles, particularly Model 3 and Model Y, are highly competitive. Sales of vehicles in the automotive industry tend to be cyclical in many markets, which may expose us to further volatility.",
    "section": "We are still at an earlier stage of development and have limited resources and production relative to established competitors that offer internal combustion engine vehicles. In addition, electric vehicles still comprise a small percentage of overall vehicle sales. As a result, the market for our vehicles could be negatively affected by numerous factors, such as:",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 16,
    "text": "16\n\n* * *\n\nof such suppliers and have limited flexibility in changing suppliers. Any disruption in the supply of battery cells from our suppliers could limit production of our vehicles and energy storage products. In the long term, we intend to supplement cells from our suppliers with cells manufactured by us, which we believe will be more efficient, manufacturable at greater volumes and more cost-effective than currently available cells. However, our efforts to develop and manufacture such battery cells have required, and may continue to require, significant investments, and there can be no assurance that we will be able to achieve these targets in the timeframes that we have planned or at all. If we are unable to do so, we may have to curtail our planned vehicle and energy storage product production or procure additional cells from suppliers at potentially greater costs, either of which may harm our business and operating results.",
    "section": "We are dependent on the continued supply of lithium-ion battery cells for our vehicles and energy storage products, and we will require substantially more cells to grow our business according to our plans. Currently, we rely on suppliers such as Panasonic and Contemporary Amperex Technology Co. Limited (CATL) for these cells. We have to date fully qualified only a very limited number",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 17,
    "text": "Finally, the high volumes of lithium-ion cells and battery modules and packs manufactured at Gigafactory Nevada are stored and recycled at our various facilities. Any mishandling of battery cells may cause disruption to the operation of such facilities. While we have implemented safety procedures related to the handling of the cells, there can be no assurance that a safety issue or fire related to the cells would not disrupt our operations. Any such disruptions or issues may harm our brand and business.",
    "section": "Our plan to grow the volume and profitability of our vehicles and energy storage products depends on significant lithium-ion battery cell production, including by our partner Panasonic at Gigafactory Nevada. In addition, we produce several vehicle components, such as battery modules and packs and drive units at Gigafactory Nevada and Gigafactory Shanghai, and we also manufacture energy storage products at Gigafactory Nevada. In the past, some of the manufacturing lines for certain product components took longer than anticipated to ramp to their full capacity, and additional bottlenecks may arise in the future as we continue to increase the production rate and introduce new lines. If we are unable to or otherwise do not maintain and grow our respective operations at Gigafactory Nevada and Gigafactory Shanghai production, or if we are unable to do so cost-effectively or hire and retain highly-skilled personnel there, our ability to manufacture our products profitably would be limited, which may harm our business and operating results.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 18,
    "text": "17\n\n* * *\n\ngovernment taxes, regulations and permit requirements; enforceability of our contractual rights; trade restrictions, customs regulations, tariffs and price or exchange controls; and preferences in foreign nations for domestically manufactured products. Such conditions may increase our costs, impact our ability to sell our products and require significant management attention, and may harm our business if we are unable to manage them effectively.",
    "section": "We are subject to legal and regulatory requirements, political uncertainty and social, environmental and economic conditions in numerous jurisdictions, including markets in which we generate significant sales, over which we have little control and which are inherently unpredictable. Our operations in such jurisdictions, particularly as a company based in the U.S., create risks relating to conforming our products to regulatory and safety requirements and charging and other electric infrastructures; organizing local operating entities; establishing, staffing and managing foreign business locations; attracting local customers; navigating foreign",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 19,
    "text": "18\n\n* * *\n\nunder which we typically receive only a very small portion of the total vehicle purchase price at the time of lease, followed by a stream of payments over the term of the lease. We have also offered various arrangements for customers of our solar energy systems whereby they pay us a fixed payment to lease or finance the purchase of such systems or purchase electricity generated by them. If we do not successfully monitor and comply with applicable national, state and/or local financial regulations and consumer protection laws governing these transactions, we may become subject to enforcement actions or penalties.",
    "section": "We offer financing arrangements for our vehicles in North America, Europe and Asia primarily ourselves and through various financial institutions. We also currently offer vehicle financing arrangements directly through our local subsidiaries in certain markets. Depending on the country, such arrangements are available for specified models and may include operating leases directly with us",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 20,
    "text": "Similarly, we have provided resale value guarantees to vehicle customers and partners for certain financing programs, under which such counterparties may sell their vehicles back to us at certain points in time at pre-determined amounts. However, actual resale values are subject to fluctuations over the term of the financing arrangements, such as from the vehicle pricing changes discussed above. If the actual resale values of any vehicles resold or returned to us pursuant to these programs are materially lower than the pre-determined amounts we have offered, our financial condition and operating results may be harmed.\n\nFinally, our vehicle and solar energy system financing programs and our energy storage sales programs also expose us to customer credit risk. In the event of a widespread economic downturn or other catastrophic event, our customers may be unable or unwilling to satisfy their payment obligations to us on a timely basis or at all. If a significant number of our customers default, we may incur substantial credit losses and/or impairment charges with respect to the underlying assets.",
    "section": "The profitability of any directly-leased vehicles returned to us at the end of their leases depends on our ability to accurately project our vehicles' residual values at the outset of the leases, and such values may fluctuate prior to the end of their terms depending on various factors such as supply and demand of our used vehicles, economic cycles and the pricing of new vehicles. We have made in the past and may make in the future certain adjustments to our prices from time to time in the ordinary course of business, which may impact the residual values of our vehicles and reduce the profitability of our vehicle leasing program. The funding and growth of this program also relies on our ability to secure adequate financing and/or business partners. If we are unable to adequately fund our leasing program through internal funds, partners or other financing sources, and compelling alternative financing programs are not available for our customers who may expect or need such options, we may be unable to grow our vehicle deliveries. Furthermore, if our vehicle leasing business grows substantially, our business may suffer if we cannot effectively manage the resulting greater levels of residual risk.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 21,
    "text": "19\n\n* * *\n\nhave or will have operations, particularly significant engineering and manufacturing centers, there is strong competition for individuals with skillsets needed for our business, including specialized knowledge of electric vehicles, engineering and electrical and building construction expertise. Moreover, we may be impacted by perceptions relating to reductions in force that we have conducted in the past in order to optimize our organizational structure and reduce costs and the departure of certain senior personnel for various reasons. Likewise, as a result of our temporary suspension of various U.S. manufacturing operations in the first half of 2020, in April 2020, we temporarily furloughed certain hourly employees and reduced most salaried employees' base salaries. We also compete with both mature and prosperous companies that have far greater financial resources than we do and start-ups and emerging companies that promise short-term growth opportunities.\n\nFinally, our compensation philosophy for all of our personnel reflects our startup origins, with an emphasis on equity-based awards and benefits in order to closely align their incentives with the long-term interests of our stockholders. We periodically seek and obtain approval from our stockholders for future increases to the number of awards available under our equity incentive and employee stock purchase plans. If we are unable to obtain the requisite stockholder approvals for such future increases, we may have to expend additional cash to compensate our employees and our ability to retain and hire qualified personnel may be harmed.",
    "section": "Employees may leave Tesla or choose other employers over Tesla due to various factors, such as a very competitive labor market for talented individuals with automotive or technology experience, or any negative publicity related to us. In regions where we",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 22,
    "text": "Further, the implementation, maintenance, segregation and improvement of these systems require significant management time, support and cost, and there are inherent risks associated with developing, improving and expanding our core systems as well as implementing new systems and updating current systems, including disruptions to the related areas of business operation. These risks may affect our ability to manage our data and inventory, procure parts or supplies or manufacture, sell, deliver and service products, adequately protect our intellectual property or achieve and maintain compliance with, or realize available benefits under, tax laws and other applicable regulations.\n\nMoreover, if we do not successfully implement, maintain or expand these systems as planned, our operations may be disrupted, our ability to accurately and/or timely report our financial results could be impaired and deficiencies may arise in our internal control over financial reporting, which may impact our ability to certify our financial results. Moreover, our proprietary information,\n\n20\n\n* * *\n\nincluding intellectual property and personal information, could be compromised or misappropriated and our reputation may be adversely affected. If these systems or their functionality do not operate as we expect them to, we may be required to expend significant resources to make corrections or find alternative sources for performing these functions.",
    "section": "We also rely on service providers, and similar incidents relating to their information technology systems could also have a material adverse effect on our business. There have been and may continue to be significant supply chain attacks. Our service providers, including our workforce management software provider, have been subject to ransomware and other security incidents, and we cannot guarantee that our or our service providers' systems have not been breached or that they do not contain exploitable defects, bugs, or vulnerabilities that could result in a security incident, or other disruption to, our or our service providers' systems. Our ability to monitor our service providers' security measures is limited, and, in any event, malicious third parties may be able to circumvent those security measures.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 23,
    "text": "21\n\n* * *\n\nfrom third party manufacturers. These risks are exacerbated in the event such manufacturers cease operations or fail to honor their warranties.",
    "section": "We provide a manufacturer's warranty on all new and used Tesla vehicles we sell. We also provide certain warranties with respect to the energy generation and storage systems we sell, including on their installation and maintenance. For components not manufactured by us, we generally pass through to our customers the applicable manufacturers' warranties, but may retain some warranty responsibilities for some or all of the life of such components. As part of our energy generation and storage system contracts, we may provide the customer with performance guarantees that guarantee that the underlying system will meet or exceed the minimum energy generation or other energy performance requirements specified in the contract. Under these performance guarantees, we generally bear the risk of electricity production or other performance shortfalls, even if they result from failures in components",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 24,
    "text": "Moreover, digital assets are currently considered indefinite-lived intangible assets under applicable accounting rules, meaning that any decrease in their fair values below our carrying values for such assets at any time subsequent to their acquisition will require us to recognize impairment charges, whereas we may make no upward revisions for any market price increases until a sale, which may adversely affect our operating results in any period in which such impairment occurs. Moreover, there is no guarantee that future changes in GAAP will not require us to change the way we account for digital assets held by us.\n\nFinally, as intangible assets without centralized issuers or governing bodies, digital assets have been, and may in the future be, subject to security breaches, cyberattacks or other malicious activities, as well as human errors or computer malfunctions that may result in the loss or destruction of private keys needed to access such assets. While we intend to take all reasonable measures to secure any digital assets, if such threats are realized or the measures or controls we create or implement to secure our digital assets fail, it could result in a partial or total misappropriation or loss of our digital assets, and our financial condition and operating results may be harmed.",
    "section": "The prices of digital assets have been in the past and may continue to be highly volatile, including as a result of various associated risks and uncertainties. For example, the prevalence of such assets is a relatively recent trend, and their long-term adoption by investors, consumers and businesses is unpredictable. Moreover, their lack of a physical form, their reliance on technology for their creation, existence and transactional validation and their decentralization may subject their integrity to the threat of malicious attacks and technological obsolescence. Finally, the extent to which securities laws or other regulations apply or may apply in the future to such assets is unclear and may change in the future. If we hold digital assets and their values decrease relative to our purchase prices, our financial condition may be harmed.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 25,
    "text": "23\n\n* * *\n\nsubstantial costs, negative publicity and management attention, regardless of merit. While we endeavor to obtain and protect the intellectual property rights that we expect will allow us to retain or advance our strategic initiatives, there can be no assurance that we will be able to adequately identify and protect the portions of intellectual property that are strategic to our business, or mitigate the risk of potential suits or other legal demands by our competitors. Accordingly, we may consider the entering into licensing agreements with respect to such rights, although no assurance can be given that such licenses can be obtained on acceptable terms or that litigation will not occur, and such licenses and associated litigation could significantly increase our operating expenses. In addition, if we are determined to have or believe there is a high likelihood that we have infringed upon a third party's intellectual property rights, we may be required to cease making, selling or incorporating certain components or intellectual property into the goods and services we offer, to pay substantial damages and/or license royalties, to redesign our products and services and/or to establish and maintain alternative branding for our products and services. In the event that we are required to take one or more such actions, our brand, business, financial condition and operating results may be harmed.",
    "section": "Our competitors or other third parties may hold or obtain patents, copyrights, trademarks or other proprietary rights that could prevent, limit or interfere with our ability to make, use, develop, sell or market our products and services, which could make it more difficult for us to operate our business. From time to time, the holders of such intellectual property rights may assert their rights and urge us to take licenses and/or may bring suits alleging infringement or misappropriation of such rights, which could result in",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 26,
    "text": "24\n\n* * *\n\nincreasing our cost of capital and adversely impacting our ability to attract investment partners and to form new financing funds for our solar and energy storage assets.\n\nFinally, we and our fund investors claim these U.S. federal tax credits and certain state incentives in amounts based on independently appraised fair market values of our solar and energy storage systems. Some governmental authorities have audited such values and in certain cases have determined that these values should be lower, and they may do so again in the future. Such determinations may result in adverse tax consequences and/or our obligation to make indemnification or other payments to our funds or fund investors.",
    "section": "In addition, certain governmental rebates, tax credits and other financial incentives that are currently available with respect to our solar and energy storage product businesses allow us to lower our costs and encourage customers to buy our products and investors to invest in our solar financing funds. However, these incentives may expire when the allocated funding is exhausted, reduced or terminated as renewable energy adoption rates increase, sometimes without warning. For example, the U.S. federal government currently offers certain tax credits for the installation of solar power facilities and energy storage systems that are charged from a co-sited solar power facility; however, these tax credits are currently scheduled to decline and/or expire in 2023 and beyond. Likewise, in jurisdictions where net metering is currently available, our customers receive bill credits from utilities for energy that their solar energy systems generate and export to the grid in excess of the electric load they use. The benefit available under net metering has been or has been proposed to be reduced, altered or eliminated in several jurisdictions, and has also been contested and may continue to be contested before the Federal Energy Regulatory Commission. Any reductions or terminations of such incentives may harm our business, prospects, financial condition and operating results by making our products less competitive for customers,",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 27,
    "text": "Finally, as a manufacturer, installer and service provider with respect to solar generation and energy storage systems, a supplier of electricity generated and stored by certain of the solar energy and energy storage systems we install for customers, and a provider of grid services through virtual power plant models, we are impacted by federal, state and local regulations and policies concerning electricity pricing, the interconnection of electricity generation and storage equipment with the electrical grid and the sale of electricity generated by third party-owned systems. If regulations and policies that adversely impact the interconnection or use of our solar and energy storage systems are introduced, they could deter potential customers from purchasing our solar and energy storage products and services, threaten the economics of our existing contracts and cause us to cease solar and energy storage system sales and services in the relevant jurisdictions, which may harm our business, financial condition and operating results.",
    "section": "In particular, we offer in our vehicles Autopilot and FSD Capability features that today assist drivers with certain tedious and potentially dangerous aspects of road travel, but which currently require drivers to remain fully engaged in the driving operation. We are continuing to develop our FSD Capability technology with the goal of achieving fully self-driving capability in the future. There are a variety of international, federal and state regulations that may apply to the sale, registration and operation of fully self-driving vehicles, which include many existing vehicle standards that were not originally intended to apply to vehicles that may not have a human driver. Such regulations continue to rapidly change, which increases the likelihood of a patchwork of complex or conflicting regulations, or may delay products or restrict self-driving features and their availability, which could adversely affect our business.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 28,
    "text": "25\n\n* * *\n\nbreach requirements if, for example, third parties improperly obtain and use the personal information of our customers or we otherwise experience a data loss with respect to customers' personal information. A major breach of our network security and systems may result in fines, penalties and damages and harm our brand, prospects and operating results.",
    "section": "Any failure by us or our vendor or other business partners to comply with our public privacy notice or with federal, state or international privacy, data protection or security laws or regulations relating to the processing, collection, use, retention, security and transfer of personally identifiable information could result in regulatory or litigation-related actions against us, legal liability, fines, damages, ongoing audit requirements and other significant costs. Substantial expenses and operational changes may be required in connection with maintaining compliance with such laws, and even an unsuccessful challenge by customers or regulatory authorities of our activities could result in adverse publicity and could require a costly response from and defense by us. In addition, certain emerging privacy laws are still subject to a high degree of uncertainty as to their interpretation, application and impact, and may require extensive system and operational changes, be difficult to implement, increase our operating costs, adversely impact the cost or attractiveness of the products or services we offer, or result in adverse publicity and harm our reputation. For example, the General Data Protection Regulation applies to the processing of personal information collected from individuals located in the European Union, and has created new compliance obligations and significantly increased fines for noncompliance. Similarly, the California Consumer Privacy Act imposes certain legal obligations on our use and processing of personal information related to California residents. Finally, new privacy and cybersecurity laws have come into effect in China. Notwithstanding our efforts to protect the security and integrity of our customers' personal information, we may be required to expend significant resources to comply with data",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 29,
    "text": "Internationally, there may be laws in jurisdictions we have not yet entered or laws we are unaware of in jurisdictions we have entered that may restrict our sales or other business practices. Even for those jurisdictions we have analyzed, the laws in this area can be complex, difficult to interpret and may change over time. Continued regulatory limitations and other obstacles interfering with our ability to sell vehicles directly to consumers may harm our financial condition and operating results.",
    "section": "While we intend to continue to leverage our most effective sales strategies, including sales through our website, we may not be able to sell our vehicles through our own stores in certain states in the U.S. with laws that may be interpreted to impose limitations on this direct-to-consumer sales model. It has also been asserted that the laws in some states limit our ability to obtain dealer licenses from state motor vehicle regulators, and such assertions persist. In certain locations, decisions by regulators permitting us to sell vehicles have been, and may be, challenged by dealer associations and others as to whether such decisions comply with applicable state motor vehicle industry laws. We have prevailed in many of these lawsuits and such results have reinforced our continuing belief that state laws were not intended to apply to a manufacturer that does not have franchise dealers. In some states, there have also been regulatory and legislative efforts by dealer associations to propose laws that, if enacted, would prevent us from obtaining dealer licenses in their states given our current sales model. A few states have passed legislation that clarifies our ability to operate, but at the same time limits the number of dealer licenses we can obtain or stores that we can operate. The application of state laws applicable to our operations continues to be difficult to predict.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 30,
    "text": "Anti-takeover provisions contained in our governing documents, applicable laws and our convertible senior notes could impair a takeover attempt.",
    "section": "Certain banking institutions have made extensions of credit to Elon Musk, our Chief Executive Officer, a portion of which was used to purchase shares of common stock in certain of our public offerings and private placements at the same prices offered to third-party participants in such offerings and placements. We are not a party to these loans, which are partially secured by pledges of a portion of the Tesla common stock currently owned by Mr. Musk. If the price of our common stock were to decline substantially, Mr. Musk may be forced by one or more of the banking institutions to sell shares of Tesla common stock to satisfy his loan obligations if he could not do so through other means. Any such sales could cause the price of our common stock to decline further.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 31,
    "text": "* We own the building and the land use rights with an initial term of 50 years. The land use rights are treated as operating lease right-of-use assets.",
    "section": "Gigafactory New York                Buffalo, New York      Leased",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 32,
    "text": "Ultimately, we cannot predict the duration of the COVID-19 pandemic. We will continue to monitor macroeconomic conditions to remain flexible and to optimize and evolve our business as appropriate, and we will have to accurately project demand and infrastructure requirements globally and deploy our production, workforce and other resources accordingly.\n\n31\n\n* * *\n\nAutomotive--Production",
    "section": "Beginning in the first quarter of 2021, there has been a trend in many parts of the world of increasing availability and administration of vaccines against COVID-19, as well as an easing of restrictions on social, business, travel and government activities and functions. On the other hand, infection rates and regulations continue to fluctuate in various regions and there are ongoing global impacts resulting from the pandemic, including challenges and increases in costs for logistics and supply chains, such as increased port congestion, intermittent supplier delays and a shortfall of semiconductor supply. We have also previously been affected by temporary manufacturing closures, employment and compensation adjustments, and impediments to administrative activities supporting our product deliveries and deployments.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 33,
    "text": "TBD                     Tesla Semi           In development\n\nTBD                     Tesla Roadster       In development",
    "section": "Cybertruck           In development",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 34,
    "text": "However, these plans are subject to uncertainties inherent in establishing and ramping manufacturing operations, which may be exacerbated by the number of concurrent international projects, any industry-wide component constraints which may increase the number of manufacturing and production design workaround solutions required, labor shortages and any future impact from events outside of our control such as the COVID-19 pandemic. Moreover, we must meet ambitious technological targets with our plans for battery cells as well as for iterative manufacturing and design improvements for our vehicles with each new factory.\n\nAutomotive--Demand and Sales",
    "section": "We are focused on ramping all of our production vehicles to their installed production capacities as well as increasing capacity at our current factories. Our current production continues to be affected by the industry-wide semiconductor and other component shortages, requiring additional workaround manufacturing and production design solutions to be implemented which may be difficult to sustain. Builds of Model Y in Gigafactory Texas and equipment testing through the vehicle production process in Gigafactory Berlin started in late 2021. The next phase of production growth will depend on the testing and ramp at Gigafactory Berlin and Gigafactory Texas, as well as our ability to add to our available sources of battery cell supply by manufacturing our own cells that we are developing to have high-volume output, lower capital and production costs and longer range. Consistent with our approach of innovating manufacturing techniques at our new factories, we expect as well to pioneer new methods related to the mass production of these cells and our unique structural battery pack concept. Our goals are to improve vehicle performance, decrease production costs and increase affordability.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 35,
    "text": "However, we operate in a cyclical industry that is sensitive to trade, environmental and political uncertainty, all of which may also be compounded by any future global impact from the COVID-19 pandemic. Moreover, as additional competitors enter the marketplace and help bring the world closer to sustainable transportation, we will have to continue to execute well to maintain our momentum.\n\nAutomotive--Deliveries and Customer Infrastructure",
    "section": "Our cost reduction efforts and additional localized procurement and manufacturing are key to our vehicles' affordability, and for example, have allowed us to competitively price our vehicles in China. In addition to ramping production in 2022, we will also continue to generate demand and brand awareness by improving our vehicles' performance and functionality, including through products based on artificial intelligence such as Autopilot and FSD, and other software features. Moreover, we expect to continue to benefit from a spike in demand in the automotive industry generally, as well as ongoing electrification of the automotive sector and increasing environmental awareness.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 36,
    "text": "Furthermore, significant judgment is required in evaluating our tax positions. In the ordinary course of business, there are many transactions and calculations for which the ultimate tax settlement is uncertain. As a result, we recognize the effect of this uncertainty on our tax attributes or taxes payable based on our estimates of the eventual outcome. These effects are recognized when, despite our belief that our tax return positions are supportable, we believe that it is more likely than not that some of those positions may not be fully sustained upon review by tax authorities. We are required to file income tax returns in the U.S. and various foreign jurisdictions, which requires us to interpret the applicable tax laws and regulations in effect in such jurisdictions. Such returns are subject to audit by the various federal, state and foreign taxing authorities, who may disagree with respect to our tax positions. We believe that our consideration is adequate for all open audit years based on our assessment of many factors, including past experience and interpretations of tax law. We review and update our estimates in light of changing facts and circumstances, such as the closing of a tax audit, the lapse of a statute of limitations or a change in estimate. To the extent that the final tax outcome of these matters differs from our expectations, such differences may impact income tax expense in the period in which such determination is made. The eventual impact on our income tax expense depends in part if we still have a valuation allowance recorded against our deferred tax assets in the period that such determination is made.\n\n36\n\n* * *",
    "section": "We are subject to taxes in the U.S. and in many foreign jurisdictions. Significant judgment is required in determining our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance recorded against our net deferred tax assets. We make these estimates and judgments about our future taxable income that are based on assumptions that are consistent with our future plans. Tax laws, regulations and administrative practices may be subject to change due to economic or political conditions including fundamental changes to the tax laws applicable to corporate multinationals. The U.S., many countries in the European Union and a number of other countries are actively considering changes in this regard. As of December 31, 2021, we had recorded a full valuation allowance on our net U.S. deferred tax assets because we expect that it is more likely than not that our U.S. deferred tax assets will not be realized. Should the actual amounts differ from our estimates, the amount of our valuation allowance could be materially impacted.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 37,
    "text": "(Dollars in millions)            2021                               2020                             2019                       $           %             $        %",
    "section": "Year Ended December 31,            2021 vs. 2020 Change             2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 38,
    "text": "segment revenue                                     51,034         29,542         23,047         21,492        73  %       6,495        28  %",
    "section": "Total automotive & services and other",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 39,
    "text": "37\n\n* * *\n\n2021 compared to 2020",
    "section": "Energy generation and storage revenue includes sales and leasing of solar energy generation and energy storage products, services related to such products and sales of solar energy systems incentives.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 40,
    "text": "(Dollars in millions)                2021                               2020                             2019                       $           %            $        %",
    "section": "Year Ended December 31,            2021 vs. 2020 Change             2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 41,
    "text": "segment cost of revenues                    37,299          22,930          19,168          14,369        63  %       3,762        20  %",
    "section": "Total automotive & services and other",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 42,
    "text": "(Dollars in millions)          2021                               2020                            2019                       $           %           $        %",
    "section": "Year Ended December 31,            2021 vs. 2020 Change            2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 43,
    "text": "39\n\n* * *\n\nR&D expenses increased $1.10 billion, or 74%, in the year ended December 31, 2021 as compared to the year ended December 31, 2020. The increase was primarily due to a $506 million increase in employee and labor related expenses due to an increase in headcount, a $263 million increase in R&D expensed materials, a $211 million increase in facilities, outside services, freight and depreciation expense and an $103 million increase in stock-based compensation expense. These increases were to support our expanding product roadmap such as the new versions of Model S and Model X and technologies including our proprietary battery cells and there were additional R&D expenses as we were in the pre-production phases at both Gigafactory Texas and Gigafactory Berlin in the current year.\n\nR&D expenses as a percentage of revenue remained consistent at 5% in the year ended December 31, 2021 as compared to the year ended December 31, 2020. R&D expenses increased proportionately with the increase in total revenues from expanding sales.\n\nSelling, General and Administrative Expense",
    "section": "Research and development (\"R&D\") expenses consist primarily of personnel costs for our teams in engineering and research, manufacturing engineering and manufacturing test organizations, prototyping expense, contract and professional services and amortized equipment expense.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 44,
    "text": "(Dollars in millions)                  2021                               2020                            2019                       $           %           $        %\n\nSelling, general and administrative    $                        4,517                           $  3,145                          $  2,646       $  1,372         44  %    $  499        19  %",
    "section": "Year Ended December 31,            2021 vs. 2020 Change            2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 45,
    "text": "Selling, general and administrative (\"SG&A\") expenses generally consist of personnel and facilities costs related to our stores, marketing, sales, executive, finance, human resources, information technology and legal organizations, as well as fees for professional and contract services and litigation settlements.\n\nSG&A expenses increased $1.37 billion, or 44%, in the year ended December 31, 2021 as compared to the year ended December 31, 2020. The increase is primarily due to an increase of $568 million in employee and labor related expenses from increased headcount and increased payroll taxes due to our higher average share price in the year ended December 31, 2021 compared to the prior year. Additionally, there was $340 million of additional payroll tax due to our CEO's option exercises from the 2012 CEO Performance Award, a $319 million increase in office, information technology, facilities-related expenses, sales and marketing activities and other costs and an increase of $145 million in stock-based compensation expense, of which $72 million was attributable to the 2018 CEO Performance Award. See Note 13, Equity Incentive Plans, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\n\nSG&A expenses as a percentage of revenue decreased from 10% in the year ended December 31, 2020 to 8% in the year ended December 31, 2021. Our SG&A expenses have decreased as a proportion of total revenues due to operational efficiencies.",
    "section": "As a percentage of revenues                                     8      %                           10     %                          11     %",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 46,
    "text": "(Dollars in millions)          2021                             2020                                           2019       $         %       $                    %",
    "section": "Year Ended December 31,          2021 vs. 2020 Change     2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 47,
    "text": "(Dollars in millions)          2021                              2020                           2019                       $          %         $         %",
    "section": "Year Ended December 31,           2021 vs. 2020 Change           2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 48,
    "text": "(Dollars in millions)          2021                             2020                                           2019       $        %       $                    %",
    "section": "Year Ended December 31,          2021 vs. 2020 Change     2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 49,
    "text": "(Dollars in millions)         2021                             2020                          2019                       $         %         $         %",
    "section": "Year Ended December 31,          2021 vs. 2020 Change          2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 50,
    "text": "(Dollars in millions)    2021                         2020                      2019                      $      %      $      %",
    "section": "Year Ended December 31,      2021 vs. 2020 Change      2020 vs. 2019 Change",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 51,
    "text": "redeemable noncontrolling interests in subsidiaries    $  125      $  141      $  87      $  (16  )      -11  %    $  54        62  %",
    "section": "Net income attributable to noncontrolling interests and",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 52,
    "text": "Accordingly, we believe that our current sources of funds will provide us with adequate liquidity during the 12-month period following December 31, 2021, as well as in the long-term.\n\n41\n\n* * *",
    "section": "In addition, because a large portion of our future expenditures will be to fund our growth, we expect that if needed we will be able to adjust our capital and operating expenditures by operating segment. For example, if our near-term manufacturing operations decrease in scale or ramp more slowly than expected, including due to global economic or business conditions, we may choose to correspondingly slow the pace of our capital expenditures. Finally, we continually evaluate our cash needs and may decide it is best to raise additional capital or seek alternative financing sources to fund the rapid growth of our business, including through drawdowns on existing or new debt facilities or financing funds. Conversely, we may also from time to time determine that it is in our best interests to voluntarily repay certain indebtedness early.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 53,
    "text": "A company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.",
    "section": "Definition and Limitations of Internal Control over Financial Reporting",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 54,
    "text": "1,033 and 960 shares issued and outstanding as of",
    "section": "Common stock; $0.001 par value; 2,000 shares authorized;",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 55,
    "text": "redeemable noncontrolling interests in subsidiaries         125           141         87",
    "section": "Net income attributable to noncontrolling interests and",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 56,
    "text": "Less: Comprehensive income attributable to\n\nnoncontrolling interests and redeemable\n\nnoncontrolling interests in subsidiaries      125        141        87",
    "section": "Comprehensive income (loss)                                              5,335              1,261             (803  )",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 57,
    "text": "common stockholders    $  5,210      $  1,120      $  (890  )",
    "section": "Comprehensive income (loss) attributable to",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 58,
    "text": "Notes\")                                  --          --        --        491          --        --        491          --        491",
    "section": "Conversion feature of 2.00% Convertible Senior Notes due in 2024 (\"2024",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 59,
    "text": "net of transaction costs      --          24        0        482        --        --        482        --        482",
    "section": "Issuance of common stock for equity incentive awards and acquisitions,",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 60,
    "text": "net of issuance costs of $15                                  --            18          0          848             --           --              848            --            848\n\nStock-based compensation                                      --            --          --         973             --           --              973            --            973",
    "section": "Issuance of common stock in May 2019 public offering at $48.60 per share,",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 61,
    "text": "notes                                                                            --            --            --         (51     )       --            --              (51     )       --            (51     )",
    "section": "Reclassification between equity and mezzanine equity for convertible senior",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 62,
    "text": "Stock-based compensation                                                         --            --            --         1,861           --            --              1,861           --            1,861",
    "section": "Issuance of common stock in public offerings, net of issuance costs of $68       --            34            0          12,269          --            --              12,269          --            12,269",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 63,
    "text": "Buy-outs of noncontrolling interests                                             (4   )        --            --         (31     )       --            --              (31     )       --            (31     )",
    "section": "Distributions to noncontrolling interests                                        (67  )        --            --         --              --            --              --              (132  )       (132    )",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 64,
    "text": "Stock-based compensation                                                         --            --            --         2,299           --            --              2,299           --            2,299",
    "section": "Issuance of common stock for equity incentive awards                             --            35            0          707             --            --              707             --            707",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 65,
    "text": "Buy-outs of noncontrolling interests                                             (15  )        --            --         5               --            --              5               --            5",
    "section": "Distributions to noncontrolling interests                                        (66  )        --            --         --              --            --              --              (106  )       (106    )",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 66,
    "text": "Depreciation, amortization and impairment                                                                            2,911                2,322               2,154\n\nStock-based compensation                                                                                             2,121                1,734               898",
    "section": "Adjustments to reconcile net income (loss) to net cash provided by operating activities:",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 67,
    "text": "Non-cash interest and other operating activities                                                                     245                  525                 520",
    "section": "Foreign currency transaction net unrealized (gain) loss                                                              (55      )           114                 (48     )",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 68,
    "text": "Tesla, Inc. (\"Tesla\", the \"Company\", \"we\", \"us\" or \"our\") was incorporated in the State of Delaware on July 1, 2003. We design, develop, manufacture and sell high-performance fully electric vehicles and design, manufacture, install and sell solar energy generation and energy storage products. Our Chief Executive Officer, as the chief operating decision maker (\"CODM\"), organizes our company, manages resource allocations and measures performance among two operating and reportable segments: (i) automotive and (ii) energy generation and storage.",
    "section": "Note 1 - Overview",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 69,
    "text": "resale value guarantee-- beginning of period           $  1,926       $  1,472",
    "section": "Deferred revenue on automotive sales with and without",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 70,
    "text": "resale value guarantee-- end of period    $  2,382      $  1,926",
    "section": "Deferred revenue on automotive sales with and without",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 71,
    "text": "Marketing, Promotional and Advertising Costs\n\nMarketing, promotional and advertising costs are expensed as incurred and are included as an element of selling, general and administrative expense in the consolidated statement of operations. Marketing, promotional and advertising costs were immaterial for the years ended December 31, 2021, 2020 and 2019.",
    "section": "Research and development costs are expensed as incurred.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 72,
    "text": "Less: Buy-out of noncontrolling interest                                          (5     )           31              8",
    "section": "Net income (loss) attributable to common stockholders    $                        5,519           $  721          $  (862  )",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 73,
    "text": "income (loss) per share of common stock      5,524         690        (870  )\n\nLess: Dilutive convertible debt              (9     )      --         --",
    "section": "Net income (loss) used in computing basic net",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 74,
    "text": "income (loss) per share of common stock    $  5,533      $  690      $  (870  )",
    "section": "Net income (loss) used in computing diluted net",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 75,
    "text": "net income (loss) per share of common stock, basic      986        933        887\n\nAdd:\n\nStock-based awards                                      98         66         --",
    "section": "Weighted average shares used in computing",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 76,
    "text": "net income (loss) per share of common stock, diluted      1,129        1,083        887",
    "section": "Weighted average shares used in computing",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 77,
    "text": "2021                           2020       2019\n\nStock-based awards                                       0             2            50",
    "section": "Year Ended December 31,",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 78,
    "text": "63\n\n* * *\n\nMyPower Customer Notes Receivable",
    "section": "Depending on the day of the week on which the end of a fiscal quarter falls, our accounts receivable balance may fluctuate as we are waiting for certain customer payments to clear through our banking institutions and receipts of payments from our financing partners, which can take up to approximately two weeks based on the contractual payment terms with such partners. Our accounts receivable balances associated with our sales of regulatory credits, which are typically transferred to other manufacturers during the last few days of the quarter, is dependent on contractual payment terms. Additionally, government rebates can take up to a year or more to be collected depending on the customary processing timelines of the specific jurisdictions issuing them. These various factors may have a significant impact on our accounts receivable balance from period to period. As of December 31, 2021 and 2020, we had $627 million and $46 million, respectively, of long-term government rebates receivable in Other non-current assets on our consolidated balance sheets.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 79,
    "text": "solar energy system lease acquisition\n\ncosts        Lease term (up to 25 years)",
    "section": "Initial direct costs related to customer",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 80,
    "text": "Property, Plant and Equipment, Net\n\nProperty, plant and equipment, net, including leasehold improvements, are recognized at cost less accumulated depreciation. Depreciation is generally computed using the straight-line method over the estimated useful lives of the respective assets, as follows:\n\n\n\nMachinery, equipment, vehicles and\n\noffice furniture                          3 to 15 years",
    "section": "Solar energy systems pending interconnection will be depreciated as solar energy systems in service when they have been interconnected and placed in-service. Solar energy systems under construction represents systems that are under installation, which will be depreciated as solar energy systems in service when they are completed, interconnected and placed in service. Initial direct costs related to customer solar energy system agreement acquisition costs are capitalized and amortized over the term of the related customer agreements.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 81,
    "text": "65\n\n* * *\n\nLong-Lived Assets Including Acquired Intangible Assets",
    "section": "Interest expense on outstanding debt is capitalized during the period of significant capital asset construction. Capitalized interest on construction in progress is included within Property, plant and equipment, net and is amortized over the life of the related assets.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 82,
    "text": "including expirations and foreign exchange impact       102           66            36",
    "section": "Net changes in liability for pre-existing warranties,",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 83,
    "text": "Accordingly, the cumulative effect of the changes made on our January 1, 2021 consolidated balance sheet for the adoption of the ASU was as follows (in millions):",
    "section": "On January 1, 2021, we adopted the ASU using the modified retrospective method. We recognized a cumulative effect of initially applying the ASU as an adjustment to the January 1, 2021 opening balance of accumulated deficit. Due to the recombination of the equity conversion component of our convertible debt remaining outstanding, additional paid in capital and convertible senior notes (mezzanine equity) were reduced. The removal of the remaining debt discounts recorded for this previous separation had the effect of increasing our net debt balance and the reduction of property, plant and equipment was related to previously capitalized interest. The prior period consolidated financial statements have not been retrospectively adjusted and continue to be reported under the accounting standards in effect for those periods.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 84,
    "text": "Property, plant and equipment, net                 $  12,747       $  (45   )    $  12,702",
    "section": "Assets",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 85,
    "text": "leases, net      113        (40  )      --        73        113        (32  )    --         81",
    "section": "Favorable contracts and",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 86,
    "text": "intangible assets      450        (212  )      4        242        456        (162  )      4        298\n\nIndefinite-lived\n\nintangible assets:",
    "section": "Total finite-lived",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 87,
    "text": "water rights                  15          --            --         15          15          --            --         15",
    "section": "Gigafactory Nevada",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 88,
    "text": "2022          $  49\n\n2023             43\n\n2024             28\n\n2025             28\n\n2026             28",
    "section": "Total future amortization expense for finite-lived intangible assets was estimated as follows (in millions):",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 89,
    "text": "ASC 820, Fair Value Measurements, states that fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or a liability. The three-tiered fair value hierarchy, which prioritizes which inputs should be used in measuring fair value, is comprised of: (Level I) observable inputs such as quoted prices in active markets; (Level II) inputs other than quoted prices in active markets that are observable either directly or indirectly and (Level III) unobservable inputs for which there is little or no market data. The fair value hierarchy requires the use of observable market data when available in determining fair value. Our assets and liabilities that were measured at fair value on a recurring basis were as follows (in millions):",
    "section": "Note 5 - Fair Value of Financial Instruments",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 90,
    "text": "and cash equivalents)    $  9,548      $  9,548      $  --      $  --      $  13,847      $  13,847      $  --      $  --",
    "section": "Money market funds (cash",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 91,
    "text": "(short-term marketable\n\nsecurities)                          131           --            131         --         --             --             --         --",
    "section": "Corporate debt securities",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 92,
    "text": "2025 Notes (1)                       $                  --                        $  --                       $  1,785           $  1,877",
    "section": "Convertible Senior Notes (1)         $                  119                       $  2,016                    $  1,971           $  24,596",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 93,
    "text": "system lease acquisition costs                            104             103\n\n6,913           6,861\n\nLess: accumulated depreciation and amortization (1)       (1,187  )       (955   )\n\n5,726           5,906",
    "section": "Initial direct costs related to customer solar energy",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 94,
    "text": "2021                     2020\n\nMachinery, equipment, vehicles and office furniture    $             9,953                    $  8,493",
    "section": "December 31,             December 31,",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 95,
    "text": "25,615                      17,864\n\nLess: Accumulated depreciation                                       (6,731  )                   (5,117  )",
    "section": "Construction in progress                                             5,559                       1,621",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 96,
    "text": "2022 Notes                                   $                      29                          $     --                     $               29                               $                  --                  2.375           %                                March 2022\n\n2024 Notes                                                          1                                 89                                     91                                                  --                  2.00            %                                May 2024",
    "section": "Recourse debt:",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 97,
    "text": "2021 Notes                                 $                     419                       $    --                     $              422                              $                --           1.25      %    March 2021\n\n2022 Notes                                                       115                            366                                   503                                               --           2.375     %    March 2022\n\n2024 Notes                                                       171                            856                                   1,282                                             --           2.00      %    May 2024\n\n2025 Notes                                                       --                             1,785                                 1,800                                             --           5.30      %    August 2025",
    "section": "Recourse debt:",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 98,
    "text": "other Loans                           --                81                81                 23           2.7%-5.1  %    June 2022-February 2033",
    "section": "Solar Revolving Credit Facility and",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 99,
    "text": "74\n\n* * *\n\n2021 Notes, Bond Hedges and Warrant Transactions",
    "section": "Recourse debt refers to debt that is recourse to our general assets. Non-recourse debt refers to debt that is recourse to only assets of our subsidiaries. The differences between the unpaid principal balances and the net carrying values are due to debt discounts or deferred financing costs. On January 1, 2021, we adopted ASU 2020-06 using the modified retrospective method. As a result of this adoption, we have de-recognized the remaining debt discounts on the 2021, 2022 and 2024 Notes and therefore no longer recognized any amortization of debt discounts as interest expense (see Note 2, Summary of Significant Accounting Policies). As of December 31, 2021, we were in material compliance with all financial debt covenants.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 100,
    "text": "2022          $              30                          $  1,065           $  1,095\n\n2023                         1,250                          1,206              2,456\n\n2024                         90                             970                1,060\n\n2025                         4                              174                178\n\n2026                         --                             64                 64",
    "section": "Recourse debt           Non-recourse debt            Total",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 101,
    "text": "Long-term debt and finance leases, net of current portion                       991                            1,094",
    "section": "Current portion of long-term debt and finance leases         $                  501                         $  374",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 102,
    "text": "2022                                      $          458               $  587\n\n2023                                                 412                  524\n\n2024                                                 366                  381\n\n2025                                                 319                  102\n\n2026                                                 232                  45",
    "section": "Leases              Leases",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 103,
    "text": "Less: Current portion                                368                  501\n\nLong-term portion of lease obligations    $          1,671             $  991\n\n80\n\n* * *",
    "section": "Present value of lease obligations                   2,039                1,492",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 104,
    "text": "2022                       $          1,024                $  91\n\n2023                                  779                     91\n\n2024                                  458                     100\n\n2025                                  218                     95\n\n2026                                  192                     39",
    "section": "Leases              Leases",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 105,
    "text": "2022          $  33\n\n2023             26\n\n2024             18\n\n2025             27\n\n2026             28",
    "section": "Under a lease pass-through fund arrangement, the investor makes a large upfront payment to the lessor, which is one of our subsidiaries, and in some cases, subsequent periodic payments. As of December 31, 2021, the future minimum master lease payments to be received from investors, for each of the next five years and thereafter, were as follows (in millions):",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 106,
    "text": "(in thousands)              Price                 Life (years)          (in billions)       (in thousands)      Value",
    "section": "Options                     Exercise              Contractual           Value               of RSUs             Date Fair",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 107,
    "text": "to vest, December 31, 2021      115,794      $  83.15        6.11      $  112.74        11,181      $  250.49",
    "section": "Vested and expected",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 108,
    "text": "2021                                2020             2019\n\nRisk-free interest rate                                     0.66    %           0.26    %          2.4    %",
    "section": "Year Ended December 31,",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 109,
    "text": "(in billions)           Achievement Status            Milestone\n\n(in billions)           Achievement Status\n\n$              20.0                         Achieved             $  1.5       Achieved\n\n$              35.0                         Achieved             $  3.0       Achieved\n\n$              55.0                         Probable             $  4.5       Achieved\n\n$              75.0                         Probable             $  6.0       Achieved\n\n$              100.0                        -                    $  8.0       Achieved\n\n$              125.0                        -                    $  10.0      Achieved (1)\n\n$              150.0                        -                    $  12.0      Probable\n\n$              175.0                        -                    $  14.0      Probable\n\n(1)",
    "section": "Milestone",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 110,
    "text": "Stock-based compensation under the 2018 CEO Performance Award represents a non-cash expense and is recorded as a Selling, general, and administrative operating expense in our consolidated statement of operations. In each quarter since the grant of the 2018 CEO Performance Award, we have recognized expense, generally on a pro-rated basis, for only the number of tranches (up to the maximum of 12 tranches) that corresponds to the number of operational milestones that have been achieved or have been determined probable of being achieved in the future, in accordance with the following principles.\n\n83\n\n* * *",
    "section": "Achieved in the fourth quarter of 2021 and expected to be certified following the filing of this Annual Report on Form 10-K.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 111,
    "text": "84\n\n* * *\n\n2021 Performance-Based Stock Option & RSU Awards",
    "section": "As of December 31, 2021, the performance milestone of annualized gross margin of greater than 30% for any three-year period was considered not probable of achievement for which the unrecognized stock-based compensation is immaterial. For the years ended December 31, 2021, 2020 and 2019, we did not record any stock-based compensation expense related to this grant.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 112,
    "text": "A provision for income taxes of $699 million, $292 million and $110 million has been recognized for the years ended December 31, 2021, 2020 and 2019, respectively, related primarily to our subsidiaries located outside of the U.S. Our income (loss) before provision for income taxes for the years ended December 31, 2021, 2020 and 2019 was as follows (in millions):",
    "section": "Note 14 - Income Taxes",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 113,
    "text": "U.S. tax credits                      (328    )      (181  )      (107  )",
    "section": "Foreign income rate differential      (668    )      33           189",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 114,
    "text": "noncontrolling interests adjustment       11            5           (29  )\n\nGILTI inclusion                           1,008         133         --",
    "section": "Noncontrolling interests and redeemable",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 115,
    "text": "Generally, our subsidiary has the option to acquire the fund investor's interest in the fund for an amount based on the market value of the fund or the formula specified in the agreements.",
    "section": "As the primary beneficiary of these VIEs, we consolidate in the financial statements the financial position, results of operations and cash flows of these VIEs, and all intercompany balances and transactions between us and these VIEs are eliminated in the consolidated financial statements. Cash distributions of income and other receipts by a fund, net of agreed upon expenses, estimated expenses, tax benefits and detriments of income and loss and tax credits, are allocated to the fund investor and our subsidiary as specified in the agreements.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 116,
    "text": "Management's Report on Internal Control over Financial Reporting",
    "section": "Based on this evaluation, our Chief Executive Officer and our Chief Financial Officer concluded that, as of December 31, 2021, our disclosure controls and procedures were designed at a reasonable assurance level and were effective to provide reasonable assurance that the information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 117,
    "text": "1\\. Financial statements (see Index to Consolidated Financial Statements in Part II, Item 8 of this report)\n\n2\\. All financial statement schedules have been omitted since the required information was not applicable or was not present in amounts sufficient to require submission of the schedules, or because the information required is included in the consolidated financial statements or the accompanying notes\n\n3\\. The exhibits listed in the following Index to Exhibits are filed or incorporated by reference as part of this report\n\n98\n\n* * *",
    "section": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 118,
    "text": "3.1        Amended and Restated Certificate of Incorporation of the Registrant.                                                                                                                                                                                           10-K                         001-34756     3.1        March 1, 2017\n\n3.2        Certificate of Amendment to the Amended and Restated Certificate of Incorporation of the Registrant.                                                                                                                                                           10-K                         001-34756     3.2        March 1, 2017\n\n3.3        Amended and Restated Bylaws of the Registrant.                                                                                                                                                                                                                 8-K                          001-34756     3.2        February 1, 2017\n\n4.1        Specimen common stock certificate of the Registrant.                                                                                                                                                                                                           10-K                         001-34756     4.1        March 1, 2017\n\n4.2        Fifth Amended and Restated Investors' Rights Agreement, dated as of August 31, 2009, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                                   S-1                          333-164593    4.2        January 29, 2010\n\n4.3        Amendment to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 20, 2010, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                         S-1/A                        333-164593    4.2A       May 27, 2010\n\n4.4        Amendment to Fifth Amended and Restated Investors' Rights Agreement between Registrant, Toyota Motor Corporation and certain holders of the Registrant's capital stock named therein.                                                                          S-1/A                        333-164593    4.2B       May 27, 2010\n\n4.5        Amendment to Fifth Amended and Restated Investor's Rights Agreement, dated as of June 14, 2010, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                        S-1/A                        333-164593    4.2C       June 15, 2010\n\n4.6        Amendment to Fifth Amended and Restated Investor's Rights Agreement, dated as of November 2, 2010, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                     8-K                          001-34756     4.1        November 4, 2010\n\n4.7        Waiver to Fifth Amended and Restated Investor's Rights Agreement, dated as of May 22, 2011, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                            S-1/A                        333-174466    4.2E       June 2, 2011\n\n4.8        Amendment to Fifth Amended and Restated Investor's Rights Agreement, dated as of May 30, 2011, between Registrant and certain holders of the Registrant's capital stock named therein.                                                                         8-K                          001-34756     4.1        June 1, 2011\n\n4.9        Sixth Amendment to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 15, 2013 among the Registrant, the Elon Musk Revocable Trust dated July 22, 2003 and certain other holders of the capital stock of the Registrant named therein.    8-K                          001-34756     4.1        May 20, 2013\n\n99\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                            Form                         File No.      Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 119,
    "text": "4.10       Waiver to Fifth Amended and Restated Investor's Rights Agreement, dated as of May 14, 2013, between the Registrant and certain holders of the capital stock of the Registrant named therein.       8-K                          001-34756    4.2        May 20, 2013\n\n4.11       Waiver to Fifth Amended and Restated Investor's Rights Agreement, dated as of August 13, 2015, between the Registrant and certain holders of the capital stock of the Registrant named therein.    8-K                          001-34756    4.1        August 19, 2015\n\n4.12       Waiver to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 18, 2016, between the Registrant and certain holders of the capital stock of the Registrant named therein.       8-K                          001-34756    4.1        May 24, 2016\n\n4.13       Waiver to Fifth Amended and Restated Investors' Rights Agreement, dated as of March 15, 2017, between the Registrant and certain holders of the capital stock of the Registrant named therein.     8-K                          001-34756    4.1        March 17, 2017\n\n4.14       Waiver to Fifth Amended and Restated Investors' Rights Agreement, dated as of May 1, 2019, between the Registrant and certain holders of the capital stock of the Registrant named therein.        8-K                          001-34756    4.1        May 3, 2019\n\n4.15       Indenture, dated as of May 22, 2013, by and between the Registrant and U.S. Bank National Association.                                                                                             8-K                          001-34756    4.1        May 22, 2013\n\n4.16       Third Supplemental Indenture, dated as of March 5, 2014, by and between the Registrant and U.S. Bank National Association.                                                                         8-K                          001-34756    4.4        March 5, 2014\n\n4.17       Form of 1.25% Convertible Senior Note Due March 1, 2021 (included in Exhibit 4.16).                                                                                                                8-K                          001-34756    4.4        March 5, 2014\n\n4.18       Fourth Supplemental Indenture, dated as of March 22, 2017, by and between the Registrant and U.S. Bank National Association.                                                                       8-K                          001-34756    4.2        March 22, 2017\n\n4.19       Form of 2.375% Convertible Senior Note Due March 15, 2022 (included in Exhibit 4.18).                                                                                                              8-K                          001-34756    4.2        March 22, 2017\n\n4.20       Fifth Supplemental Indenture, dated as of May 7, 2019, by and between Registrant and U.S. Bank National Association, related to 2.00% Convertible Senior Notes due May 15, 2024.                   8-K                          001-34756    4.2        May 8, 2019\n\n4.21       Form of 2.00% Convertible Senior Notes due May 15, 2024 (included in Exhibit 4.20).                                                                                                                8-K                          001-34756    4.2        May 8, 2019\n\n4.22       Indenture, dated as of August 18, 2017, by and among the Registrant, SolarCity, and U.S. Bank National Association, as trustee.                                                                    8-K                          001-34756    4.1        August 23, 2017\n\n4.23       Form of 5.30% Senior Note due August 15, 2025.                                                                                                                                                     8-K                          001-34756    4.2        August 23, 2017\n\n100\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                Form                         File No.     Exhibit    Filing Date        Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 120,
    "text": "4.24       Indenture, dated as of October 15, 2014, between SolarCity and U.S. Bank National Association, as trustee.                                                                  S-3ASR(1)                    333-199321    4.1        October 15, 2014\n\n4.25       Eighth Supplemental Indenture, dated as of January 29, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.00% Solar Bonds, Series 2015/4-7.           8-K(1)                       001-35758     4.5        January 29, 2015\n\n4.26       Tenth Supplemental Indenture, dated as of March 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/6-10.              8-K(1)                       001-35758     4.3        March 9, 2015\n\n4.27       Eleventh Supplemental Indenture, dated as of March 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/7-15.           8-K(1)                       001-35758     4.4        March 9, 2015\n\n4.28       Fifteenth Supplemental Indenture, dated as of March 19, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C4-10.        8-K(1)                       001-35758     4.5        March 19, 2015\n\n4.29       Sixteenth Supplemental Indenture, dated as of March 19, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C5-15.        8-K(1)                       001-35758     4.6        March 19, 2015\n\n4.30       Twentieth Supplemental Indenture, dated as of March 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C9-10.        8-K(1)                       001-35758     4.5        March 26, 2015\n\n4.31       Twenty-First Supplemental Indenture, dated as of March 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C10-15.    8-K(1)                       001-35758     4.6        March 26, 2015\n\n4.32       Twenty-Sixth Supplemental Indenture, dated as of April 2, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C14-10.     8-K(1)                       001-35758     4.5        April 2, 2015\n\n4.33       Thirtieth Supplemental Indenture, dated as of April 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C19-10.        8-K(1)                       001-35758     4.5        April 9, 2015\n\n4.34       Thirty-First Supplemental Indenture, dated as of April 9, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C20-15.     8-K(1)                       001-35758     4.6        April 9, 2015\n\n4.35       Thirty-Fifth Supplemental Indenture, dated as of April 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C24-10.    8-K(1)                       001-35758     4.5        April 14, 2015\n\n4.36       Thirty-Sixth Supplemental Indenture, dated as of April 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C25-15.    8-K(1)                       001-35758     4.6        April 14, 2015\n\n101\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                         Form                         File No.      Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 121,
    "text": "4.37       Thirty-Eighth Supplemental Indenture, dated as of April 21, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C27-10.    8-K(1)                       001-35758    4.3        April 21, 2015\n\n4.38       Thirty-Ninth Supplemental Indenture, dated as of April 21, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C28-15.     8-K(1)                       001-35758    4.4        April 21, 2015\n\n4.39       Forty-Third Supplemental Indenture, dated as of April 27, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C32-10.      8-K(1)                       001-35758    4.5        April 27, 2015\n\n4.40       Forty-Fourth Supplemental Indenture, dated as of April 27, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C33-15.     8-K(1)                       001-35758    4.6        April 27, 2015\n\n4.41       Forty-Eighth Supplemental Indenture, dated as of May 1, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/12-10.         8-K(1)                       001-35758    4.5        May 1, 2015\n\n4.42       Forty-Ninth Supplemental Indenture, dated as of May 1, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/13-15.          8-K(1)                       001-35758    4.6        May 1, 2015\n\n4.43       Fifty-Second Supplemental Indenture, dated as of May 11, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C36-10.       8-K(1)                       001-35758    4.4        May 11, 2015\n\n4.44       Fifty-Third Supplemental Indenture, dated as of May 11, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C37-15.        8-K(1)                       001-35758    4.5        May 11, 2015\n\n4.45       Fifty-Seventh Supplemental Indenture, dated as of May 18, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C40-10.      8-K(1)                       001-35758    4.4        May 18, 2015\n\n4.46       Fifty-Eighth Supplemental Indenture, dated as of May 18, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C41-15.       8-K(1)                       001-35758    4.5        May 18, 2015\n\n4.47       Sixty-First Supplemental Indenture, dated as of May 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C44-10.        8-K(1)                       001-35758    4.4        May 26, 2015\n\n4.48       Sixty-Second Supplemental Indenture, dated as of May 26, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C45-15.       8-K(1)                       001-35758    4.5        May 26, 2015\n\n102\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                          Form                         File No.     Exhibit    Filing Date       Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 122,
    "text": "4.49       Seventieth Supplemental Indenture, dated as of June 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C52-10.                    8-K(1)                       001-35758    4.4        June 16, 2015\n\n4.50       Seventy-First Supplemental Indenture, dated as of June 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C53-15.                 8-K(1)                       001-35758    4.5        June 16, 2015\n\n4.51       Seventy-Fourth Supplemental Indenture, dated as of June 22, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C56-10.                8-K(1)                       001-35758    4.4        June 23, 2015\n\n4.52       Seventy-Fifth Supplemental Indenture, dated as of June 22, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C57-15.                 8-K(1)                       001-35758    4.5        June 23, 2015\n\n4.53       Eightieth Supplemental Indenture, dated as of June 29, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C61-10.                     8-K(1)                       001-35758    4.5        June 29, 2015\n\n4.54       Eighty-First Supplemental Indenture, dated as of June 29, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C62-15.                  8-K(1)                       001-35758    4.6        June 29, 2015\n\n4.55       Ninetieth Supplemental Indenture, dated as of July 20, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C71-10.                     8-K(1)                       001-35758    4.5        July 21, 2015\n\n4.56       Ninety-First Supplemental Indenture, dated as of July 20, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C72-15.                  8-K(1)                       001-35758    4.6        July 21, 2015\n\n4.57       Ninety-Fifth Supplemental Indenture, dated as of July 31, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/20-10.                   8-K(1)                       001-35758    4.5        July 31, 2015\n\n4.58       Ninety-Sixth Supplemental Indenture, dated as of July 31, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/21-15.                   8-K(1)                       001-35758    4.6        July 31, 2015\n\n4.59       One Hundred-and-Fifth Supplemental Indenture, dated as of August 10, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C81-10.       8-K(1)                       001-35758    4.5        August 10, 2015\n\n4.60       One Hundred-and-Eleventh Supplemental Indenture, dated as of August 17, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C87-15.    8-K(1)                       001-35758    4.6        August 17, 2015\n\n103\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                      Form                         File No.     Exhibit    Filing Date        Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 123,
    "text": "4.61       One Hundred-and-Sixteenth Supplemental Indenture, dated as of August 24, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C92-15.            8-K(1)                       001-35758    4.6        August 24, 2015\n\n4.62       One Hundred-and-Twenty-First Supplemental Indenture, dated as of August 31, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C97-15.         8-K(1)                       001-35758    4.6        August 31, 2015\n\n4.63       One Hundred-and-Twenty-Eighth Supplemental Indenture, dated as of September 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C101-10.    8-K(1)                       001-35758    4.5        September 15, 2015\n\n4.64       One Hundred-and-Twenty-Ninth Supplemental Indenture, dated as of September 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C102-15.     8-K(1)                       001-35758    4.6        September 15, 2015\n\n4.65       One Hundred-and-Thirty-Third Supplemental Indenture, dated as of September 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C106-10.     8-K(1)                       001-35758    4.5        September 29, 2015\n\n4.66       One Hundred-and-Thirty-Fourth Supplemental Indenture, dated as of September 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C107-15.    8-K(1)                       001-35758    4.6        September 29, 2015\n\n4.67       One Hundred-and-Thirty-Eighth Supplemental Indenture, dated as of October 13, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C111-10.      8-K(1)                       001-35758    4.5        October 13, 2015\n\n4.68       One Hundred-and-Forty-Third Supplemental Indenture, dated as of October 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2015/25-10.          8-K(1)                       001-35758    4.5        October 30, 2015\n\n4.69       One Hundred-and-Forty-Fourth Supplemental Indenture, dated as of October 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2015/26-15.         8-K(1)                       001-35758    4.6        October 30, 2015\n\n4.70       One Hundred-and-Forty-Eighth Supplemental Indenture, dated as of November 4, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C116-10.       8-K(1)                       001-35758    4.5        November 4, 2015\n\n104\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                               Form                         File No.     Exhibit    Filing Date           Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 124,
    "text": "4.71       One Hundred-and-Fifty-Third Supplemental Indenture, dated as of November 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C121-10.     8-K(1)                       001-35758    4.5        November 17, 2015\n\n4.72       One Hundred-and-Fifty-Fourth Supplemental Indenture, dated as of November 16, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C122-15.    8-K(1)                       001-35758    4.6        November 17, 2015\n\n4.73       One Hundred-and-Fifty-Eighth Supplemental Indenture, dated as of November 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C126-10.    8-K(1)                       001-35758    4.5        November 30, 2015\n\n4.74       One Hundred-and-Fifty-Ninth Supplemental Indenture, dated as of November 30, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C127-15.     8-K(1)                       001-35758    4.6        November 30, 2015\n\n4.75       One Hundred-and-Sixty-Third Supplemental Indenture, dated as of December 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C131-10.     8-K(1)                       001-35758    4.5        December 14, 2015\n\n4.76       One Hundred-and-Sixty-Fourth Supplemental Indenture, dated as of December 14, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C132-15.    8-K(1)                       001-35758    4.6        December 14, 2015\n\n4.77       One Hundred-and-Sixty-Eighth Supplemental Indenture, dated as of December 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 4.70% Solar Bonds, Series 2015/C136-10.    8-K(1)                       001-35758    4.5        December 28, 2015\n\n4.78       One Hundred-and-Sixty-Ninth Supplemental Indenture, dated as of December 28, 2015, by and between SolarCity and the Trustee, related to SolarCity's 5.45% Solar Bonds, Series 2015/C137-15.     8-K(1)                       001-35758    4.6        December 28, 2015\n\n4.79       One Hundred-and-Seventy-Third Supplemental Indenture, dated as of January 29, 2016, by and between SolarCity and the Trustee, related to SolarCity's 5.00% Solar Bonds, Series 2016/4-10.       8-K(1)                       001-35758    4.5        January 29, 2016\n\n4.80       One Hundred-and-Seventy-Fourth Supplemental Indenture, dated as of January 29, 2016, by and between SolarCity and the Trustee, related to SolarCity's 5.75% Solar Bonds, Series 2016/5-15.      8-K(1)                       001-35758    4.6        January 29, 2016\n\n4.81       Description of Registrant's Securities                                                                                                                                                          10-K                         001-34756    4.119      February 13, 2020\n\n105\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                             Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 125,
    "text": "10.1**     Form of Indemnification Agreement between the Registrant and its directors and officers.                                   S-1/A                        333-164593    10.1          June 15, 2010\n\n10.2**     2003 Equity Incentive Plan.                                                                                                S-1/A                        333-164593    10.2          May 27, 2010\n\n10.3**     Form of Stock Option Agreement under 2003 Equity Incentive Plan.                                                           S-1                          333-164593    10.3          January 29, 2010\n\n10.4**     Amended and Restated 2010 Equity Incentive Plan.                                                                           10-K                         001-34756     10.4          February 23, 2018\n\n10.5**     Form of Stock Option Agreement under 2010 Equity Incentive Plan.                                                           10-K                         001-34756     10.6          March 1, 2017\n\n10.6**     Form of Restricted Stock Unit Award Agreement under 2010 Equity Incentive Plan.                                            10-K                         001-34756     10.7          March 1, 2017\n\n10.7**     Amended and Restated 2010 Employee Stock Purchase Plan, effective as of February 1, 2017.                                  10-K                         001-34756     10.8          March 1, 2017\n\n10.8**     2019 Equity Incentive Plan.                                                                                                S-8                          333-232079    4.2           June 12, 2019\n\n10.9**     Form of Stock Option Agreement under 2019 Equity Incentive Plan.                                                           S-8                          333-232079    4.3           June 12, 2019\n\n10.10**    Form of Restricted Stock Unit Award Agreement under 2019 Equity Incentive Plan.                                            S-8                          333-232079    4.4           June 12, 2019\n\n10.11**    Employee Stock Purchase Plan, effective as of June 12, 2019.                                                               S-8                          333-232079    4.5           June 12, 2019\n\n10.12**    2007 SolarCity Stock Plan and form of agreements used thereunder.                                                          S-1(1)                       333-184317    10.2          October 5, 2012\n\n10.13**    2012 SolarCity Equity Incentive Plan and form of agreements used thereunder.                                               S-1(1)                       333-184317    10.3          October 5, 2012\n\n10.14**    2010 Zep Solar, Inc. Equity Incentive Plan and form of agreements used thereunder.                                         S-8(1)                       333-192996    4.5           December 20, 2013\n\n10.15**    Offer Letter between the Registrant and Elon Musk dated October 13, 2008.                                                  S-1                          333-164593    10.9          January 29, 2010\n\n10.16**    Performance Stock Option Agreement between the Registrant and Elon Musk dated January 21, 2018.                            DEF 14A                      001-34756     Appendix A    February 8, 2018\n\n10.17**    Maxwell Technologies, Inc. 2005 Omnibus Equity Incentive Plan, as amended through May 6, 2010                              8-K(2)                       001-15477     10.1          May 10, 2010\n\n10.18**    Maxwell Technologies, Inc. 2013 Omnibus Equity Incentive Plan                                                              DEF 14A(2)                   001-15477     Appendix A    June 2, 2017\n\n10.19      Indemnification Agreement, effective as of June 23, 2020, between Registrant and Elon R. Musk.                             10-Q                         001-34756     10.4          July 28, 2020\n\n10.20      Indemnification Agreement, dated as of February 27, 2014, by and between the Registrant and J.P. Morgan Securities LLC.    8-K                          001-34756     10.1          March 5, 2014\n\n10.21      Form of Call Option Confirmation relating to 1.25% Convertible Senior Notes Due March 1, 2021.                             8-K                          001-34756     10.3          March 5, 2014\n\n106\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                        Form                         File No.      Exhibit       Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 126,
    "text": "10.22      Form of Warrant Confirmation relating to 1.25% Convertible Senior Notes Due March 1, 2021.                                                                                                                                         8-K                          001-34756    10.5       March 5, 2014\n\n10.23      Form of Call Option Confirmation relating to 2.375% Convertible Notes due March 15, 2022.                                                                                                                                          8-K                          001-34756    10.1       March 22, 2017\n\n10.24      Form of Warrant Confirmation relating to 2.375% Convertible Notes due March 15, 2022.                                                                                                                                              8-K                          001-34756    10.2       March 22, 2017\n\n10.25      Form of Call Option Confirmation relating to 2.00% Convertible Senior Notes due May 15, 2024.                                                                                                                                      8-K                          001-34756    10.1       May 3, 2019\n\n10.26      Form of Warrant Confirmation relating to 2.00% Convertible Senior Notes due May 15, 2024.                                                                                                                                          8-K                          001-34756    10.2       May 3, 2019\n\n10.27†     Supply Agreement between Panasonic Corporation and the Registrant dated October 5, 2011.                                                                                                                                           10-K                         001-34756    10.50      February 27, 2012\n\n10.28†     Amendment No. 1 to Supply Agreement between Panasonic Corporation and the Registrant dated October 29, 2013.                                                                                                                       10-K                         001-34756    10.35A     February 26, 2014\n\n10.29      Agreement between Panasonic Corporation and the Registrant dated July 31, 2014.                                                                                                                                                    10-Q                         001-34756    10.1       November 7, 2014\n\n10.30†     General Terms and Conditions between Panasonic Corporation and the Registrant dated October 1, 2014.                                                                                                                               8-K                          001-34756    10.2       October 11, 2016\n\n10.31      Letter Agreement, dated as of February 24, 2015, regarding addition of co-party to General Terms and Conditions, Production Pricing Agreement and Investment Letter Agreement between Panasonic Corporation and the Registrant.    10-K                         001-34756    10.25A     February 24, 2016\n\n10.32†     Amendment to Gigafactory General Terms, dated March 1, 2016, by and among the Registrant, Panasonic Corporation and Panasonic Energy Corporation of North America.                                                                 8-K                          001-34756    10.1       October 11, 2016\n\n10.33††    Amended and Restated General Terms and Conditions for Gigafactory, entered into on June 10, 2020, by and among Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and Panasonic Corporation of North America.        10-Q                         001-34756    10.2       July 28, 2020\n\n10.34†     Production Pricing Agreement between Panasonic Corporation and the Registrant dated October 1, 2014.                                                                                                                               10-Q                         001-34756    10.3       November 7, 2014\n\n10.35†     Investment Letter Agreement between Panasonic Corporation and the Registrant dated October 1, 2014.                                                                                                                                10-Q                         001-34756    10.4       November 7, 2014\n\n107\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 127,
    "text": "10.36      Amendment to Gigafactory Documents, dated April 5, 2016, by and among the Registrant, Panasonic Corporation, Panasonic Corporation of North America and Panasonic Energy Corporation of North America.                                                                                                                                                                                                                                                                                                                                                                                           10-Q                         001-34756     10.2       May 10, 2016\n\n10.37††    2019 Pricing Agreement (Japan Cells) with respect to 2011 Supply Agreement, executed September 20, 2019, by and among the Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and SANYO Electric Co., Ltd.                                                                                                                                                                                                                                                                                                                                                                          10-Q                         001-34756     10.6       October 29, 2019\n\n10.38††    2020 Pricing Agreement (Gigafactory 2170 Cells), entered into on June 9, 2020, by and among Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and Panasonic Corporation of North America.                                                                                                                                                                                                                                                                                                                                                                                         10-Q                         001-34756     10.3       July 28, 2020\n\n10.39††    2021 Pricing Agreement (Japan Cells) with respect to 2011 Supply Agreement, executed December 29, 2020, by and among the Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation of North America and SANYO Electric Co., Ltd.                                                                                                                                                                                                                                                                                                                                                          10-K                         001-34756     10.39      February 8, 2021\n\n10.40††    Amended and Restated Factory Lease, executed as of March 26, 2019, by and between the Registrant and Panasonic Energy North America, a division of Panasonic Corporation of North America, as tenant.                                                                                                                                                                                                                                                                                                                                                                                            10-Q                         001-34756     10.3       July 29, 2019\n\n10.41††    Lease Amendment, executed September 20, 2019, by and among the Registrant, Panasonic Corporation of North America, on behalf of its division Panasonic Energy of North America, with respect to the Amended and Restated Factory Lease, executed as of March 26, 2019.                                                                                                                                                                                                                                                                                                                           10-Q                         001-34756     10.7       October 29, 2019\n\n10.42††    Second Lease Amendment, entered into on June 9, 2020, by and between the Registrant and Panasonic Energy of North America, a division of Panasonic Corporation of North America, with respect to the Amended and Restated Factory Lease dated January 1, 2017.                                                                                                                                                                                                                                                                                                                                   10-Q                         001-34756     10.1       July 28, 2020\n\n10.43      Amendment and Restatement in respect of ABL Credit Agreement, dated as of March 6, 2019, by and among certain of the Registrant's and Tesla Motors Netherlands B.V.'s direct or indirect subsidiaries from time to time party thereto, as borrowers, Wells Fargo Bank, National Association, as documentation agent, JPMorgan Chase Bank, N.A., Goldman Sachs Bank USA, Morgan Stanley Senior Funding Inc. and Bank of America, N.A., as syndication agents, the lenders from time to time party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent.    S-4/A                        333-229749    10.68      April 3, 2019\n\n108\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              Form                         File No.      Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 128,
    "text": "10.44      First Amendment to Amended and Restated ABL Credit Agreement, dated as of December 23, 2020, in respect of the Amended and Restated ABL Credit Agreement, dated as of March 6, 2019, by and among certain of the Registrant's and Tesla Motors Netherlands B.V.'s direct or indirect subsidiaries from time to time party thereto, as borrowers, Wells Fargo Bank, National Association, as documentation agent, JPMorgan Chase Bank, N.A., Goldman Sachs Bank USA, Morgan Stanley Senior Funding Inc. and Bank of America, N.A., as syndication agents, the lenders from time to time party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent.    10-K                         001-34756    10.44      February 8, 2021\n\n10.45†     Agreement for Tax Abatement and Incentives, dated as of May 7, 2015, by and between Tesla Motors, Inc. and the State of Nevada, acting by and through the Nevada Governor's Office of Economic Development.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  10-Q                         001-34756    10.1       August 7, 2015\n\n10.46††    Second Amended and Restated Loan and Security Agreement, dated as of August 28, 2020, by and among Tesla 2014 Warehouse SPV LLC, Tesla Finance LLC, the Lenders and Group Agents from time to time party thereto, Deutsche Bank Trust Company Americas, as Paying Agent, and Deutsche Bank AG, New York Branch, as Administrative Agent.                                                                                                                                                                                                                                                                                                                                                     10-Q                         001-34756    10.2       October 26, 2020\n\n10.47      Amendment No. 1 to Second Amended and Restated Loan and Security Agreement, dated as of March 15, 2021, by and among Tesla 2014 Warehouse SPV LLC, Tesla Finance LLC, the Lenders and Group Agents from time to time party thereto, Deutsche Bank Trust Company Americas, as Paying Agent, and Deutsche Bank AG, New York Branch, as Administrative Agent.                                                                                                                                                                                                                                                                                                                                   10-Q                         001-34756    10.1       April 28, 2021\n\n10.48††    Amendment No. 2 to Second Amended and Restated Loan and Security Agreement, dated as of June 8, 2021, by and among Tesla 2014 Warehouse SPV LLC, Tesla Finance LLC, the Lenders and Group Agents from time to time party thereto, Deutsche Bank Trust Company Americas, as Paying Agent, and Deutsche Bank AG, New York Branch, as Administrative Agent.                                                                                                                                                                                                                                                                                                                                     10-Q                         001-34756    10.1       July 27, 2021\n\n109\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Form                         File No.     Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 129,
    "text": "10.49†     Loan and Security Agreement, executed on December 28, 2018, by and among LML 2018 Warehouse SPV, LLC, Tesla Finance LLC, the Lenders and Group Agents from time to time party thereto, Deutsche Bank Trust Company Americas, as Paying Agent, and Deutsche Bank AG, New York Branch, as Administrative Agent.                                                                                                                                           10-K                         001-34756    10.55      February 19, 2019\n\n10.50††    Letter of Consent, dated as of June 14, 2019, by and among LML 2018 Warehouse SPV, LLC, Deutsche Bank AG, New York Branch, as Administrative Agent, and the Group Agents party thereto, in respect of the Loan and Security Agreement, dated as of August 17, 2017 and as amended from time to time, by and among LML Warehouse SPV, LLC, Tesla Finance LLC, and the Lenders, Group Agents and Administrative Agent from time to time party thereto.    10-Q                         001-34756    10.1       July 29, 2019\n\n10.51††    Amendment No. 1 to Loan and Security Agreement, dated as of August 16, 2019, by and among LML 2018 Warehouse SPV, LLC, Deutsche Bank Trust Company Americas, as Paying Agent, and Deutsche Bank AG, New York Branch, as Administrative Agent, and the Lenders and Group Agents from time to time party thereto.                                                                                                                                         10-Q                         001-34756    10.2       October 29, 2019\n\n10.52      Amendment No. 2 to Loan and Security Agreement, dated as of December 13, 2019, by and among LML 2018 Warehouse SPV, LLC, Deutsche Bank Trust Company Americas, as Paying Agent, and Deutsche Bank AG, New York Branch, as Administrative Agent, and the Lenders and Group Agents from time to time party thereto.                                                                                                                                       10-K                         001-34756    10.69      February 13, 2020\n\n110\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                     Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 130,
    "text": "10.53      Letter of Consent, dated February 18, 2020, by and among LML 2018 Warehouse SPV, LLC, Tesla 2014 Warehouse SPV LLC, LLC and Deutsche Bank AG, New York Branch, as Administrative Agent and as Group Agent under the 2018 Loan Agreement and the 2014 Loan Agreement, and the Group Agents party thereto, in respect of (i) the Loan and Security Agreement, dated December 27, 2018 and as amended from time to time, among LML 2018 Warehouse SPV, LLC, Tesla Finance LLC, Deutsche Bank Trust Company Americans, as Paying Agent, Deutsche Bank AG, New York Branch, as Administrative Agent, the lenders parties and agent parties thereto, and (ii) the Amended and Restated Loan and Security Agreement, dated August 17, 2017 and as amended from time to time, among Tesla 2014 Warehouse SPV LLC, Tesla Finance LLC, the lenders and group agents party thereto, Deutsche Bank Trust Company Americas, as Paying Agent, and Deutsche Bank AG, New York Branch, as Administrative Agent.    10-Q                         001-34756    10.1       April 30, 2020\n\n10.54††    Letter of Consent, dated as of August 14, 2020, by and among LML 2018 Warehouse SPV, LLC, Tesla 2014 Warehouse SPV LLC, Deutsche Bank AG, New York Branch, as Administrative Agent and Group Agent, and the Group Agents party thereto, in respect of (i) the Loan and Security Agreement, dated as of December 27, 2018 and as amended from time to time, by and among LML 2018 Warehouse SPV, LLC, Tesla Finance LLC, and the Lenders, Group Agents, Paying Agent and Administrative Agent from time to time party thereto, and (ii) the Amended and Restated Loan and Security Agreement, dated as of August 17, 2017 and as amended from time to time, by and among LML Warehouse SPV, LLC, Tesla Finance LLC, and the Lenders, Group Agents and Administrative Agent from time to time party thereto.                                                                                                                                                                                         10-Q                         001-34756    10.1       October 26, 2020\n\n10.55      Payoff and Termination Letter, executed on August 28, 2020, by and among LML 2018 Warehouse SPV, LLC, the Lenders and Group Agents from time to time party thereto, Deutsche Bank Trust Company Americas, as Paying Agent and Deutsche Bank AG, New York Branch, as Administrative Agent, relating to Loan and Security Agreement.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 10-Q                         001-34756    10.3       October 26, 2020\n\n10.56      Purchase Agreement, dated as of August 11, 2017, by and among the Registrant, SolarCity and Goldman Sachs & Co. LLC and Morgan Stanley & Co. LLC as representatives of the several initial purchasers named therein.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               8-K                          001-34756    10.1       August 23, 2017\n\n111\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                Form                         File No.     Exhibit    Filing Date         Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 131,
    "text": "10.57      Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of September 2, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.                        10-Q(1)                      001-35758    10.16      November 6, 2014\n\n10.58      First Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 31, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.      10-K(1)                      001-35758    10.16a     February 24, 2015\n\n10.59      Second Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of December 15, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.    10-K(1)                      001-35758    10.16b     February 24, 2015\n\n10.60      Third Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of February 12, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.     10-Q(1)                      001-35758    10.16c     May 6, 2015\n\n10.61      Fourth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of March 30, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.       10-Q(1)                      001-35758    10.16d     May 6, 2015\n\n10.62      Fifth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of June 30, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.         10-Q(1)                      001-35758    10.16e     July 30, 2015\n\n112\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                       Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 132,
    "text": "10.63      Sixth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of September 1, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.    10-Q(1)                      001-35758    10.16f     October 30, 2015\n\n10.64      Seventh Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 9, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.    10-Q(1)                      001-35758    10.16g     October 30, 2015\n\n10.65      Eighth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 26, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.    10-Q(1)                      001-35758    10.16h     October 30, 2015\n\n10.66      Ninth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of December 9, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.     10-K(1)                      001-35758    10.16i     February 10, 2016\n\n10.67      Tenth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of March 31, 2017, by and between The Research Foundation For The State University of New York, on behalf of the Colleges of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.      10-Q                         001-34756    10.8       May 10, 2017\n\n10.68      Eleventh Amendment to Amended and Restated Agreement for Research & Development Alliance on Triex Module Technology, effective as of July 22, 2020, among the Research Foundation for the State University of New York, Silevo, LLC and Tesla Energy Operations, Inc.                                                                                    10-Q                         001-34756    10.6       July 28, 2020\n\n113\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                      Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 133,
    "text": "10.69      Twelfth Amendment to Amended and Restated Agreement for Research & Development Alliance on Triex Module Technology, effective as of May 1, 2021, among the Research Foundation for the State University of New York, Silevo, LLC and Tesla Energy Operations, Inc.                                                                                                                                                                                                                                           10-Q                         001-34756    10.1       October 25, 2021\n\n10.70††    Grant Contract for State-Owned Construction Land Use Right, dated as of October 17, 2018, by and between Shanghai Planning and Land Resource Administration Bureau, as grantor, and Tesla (Shanghai) Co., Ltd., as grantee (English translation).                                                                                                                                                                                                                                                            10-Q                         001-34756    10.2       July 29, 2019\n\n10.71††    Facility Agreement, dated as of September 26, 2019, by and between China Merchants Bank Co., Ltd. Beijing Branch and Tesla Automobile (Beijing) Co., Ltd. (English translation).                                                                                                                                                                                                                                                                                                                             10-Q                         001-34756    10.3       October 29, 2019\n\n10.72††    Statement Letter to China Merchants Bank Co., Ltd. Beijing Branch from Tesla Automobile (Beijing) Co., Ltd., dated as of September 26, 2019 (English translation).                                                                                                                                                                                                                                                                                                                                           10-Q                         001-34756    10.4       October 29, 2019\n\n10.73††    Fixed Asset Syndication Loan Agreement, dated as of December 18, 2019, by and among Tesla (Shanghai) Co., Ltd., China Construction Bank Corporation, China (Shanghai) Pilot Free Trade Zone Special Area Branch, Agricultural Bank of China Shanghai Changning Sub-branch, Shanghai Pudong Development Bank Co., Ltd., Shanghai Branch, and Industrial and Commercial Bank of China Limited, China (Shanghai) Pilot Free Trade Zone Special Area Branch (English translation).                               10-K                         001-34756    10.85      February 13, 2020\n\n10.74††    Fixed Asset Syndication Loan Agreement and Supplemental Agreement, dated as of December 18, 2019, by and among Tesla (Shanghai) Co., Ltd., China Construction Bank Corporation, China (Shanghai) Pilot Free Trade Zone Special Area Branch, Agricultural Bank of China Shanghai Changning Sub-branch, Shanghai Pudong Development Bank Co., Ltd., Shanghai Branch, and Industrial and Commercial Bank of China Limited, China (Shanghai) Pilot Free Trade Zone Special Area Branch (English translation).    10-K                         001-34756    10.86      February 13, 2020\n\n114\n\n* * *",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 134,
    "text": "10.75††    Syndication Revolving Loan Agreement, dated as of December 18, 2019, by and among Tesla (Shanghai) Co., Ltd. China Construction Bank Corporation, China (Shanghai) Pilot Free Trade Zone Special Area Branch, Agricultural Bank of China Shanghai Changning Sub-branch, Shanghai Pudong Development Bank Co., Ltd., Shanghai Branch, and Industrial and Commercial Bank of China Limited, China (Shanghai) Pilot Free Trade Zone Special Area Branch (English translation).    10-K                         001-34756    10.87      February 13, 2020\n\n10.76††    Working Capital Loan Contact, dated as of May 7, 2020, between Industrial and Commercial Bank of China, China (Shanghai) Pilot Free Trade Zone Lingang Special Area Branch and Tesla (Shanghai) Co., Ltd.                                                                                                                                                                                                                                                                      10-Q                         001-34756    10.5       July 28, 2020\n\n21.1       List of Subsidiaries of the Registrant                                                                                                                                                                                                                                                                                                                                                                                                                                         --                           --           --         --                   X\n\n23.1       Consent of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm                                                                                                                                                                                                                                                                                                                                                                                           --                           --           --         --                   X\n\n31.1       Rule 13a-14(a) / 15(d)-14(a) Certification of Principal Executive Officer                                                                                                                                                                                                                                                                                                                                                                                                      --                           --           --         --                   X\n\n31.2       Rule 13a-14(a) / 15(d)-14(a) Certification of Principal Financial Officer                                                                                                                                                                                                                                                                                                                                                                                                      --                           --           --         --                   X\n\n32.1*      Section 1350 Certifications                                                                                                                                                                                                                                                                                                                                                                                                                                                    --                           --           --         --                   X\n\n101.INS    Inline XBRL Instance Document                                                                                                                                                                                                                                                                                                                                                                                                                                                  --                           --           --         --                   X\n\n101.SCH    Inline XBRL Taxonomy Extension Schema Document                                                                                                                                                                                                                                                                                                                                                                                                                                 --                           --           --         --                   X\n\n101.CAL    Inline XBRL Taxonomy Extension Calculation Linkbase Document.                                                                                                                                                                                                                                                                                                                                                                                                                  --                           --           --         --                   X\n\n101.DEF    Inline XBRL Taxonomy Extension Definition Linkbase Document                                                                                                                                                                                                                                                                                                                                                                                                                    --                           --           --         --                   X\n\n101.LAB    Inline XBRL Taxonomy Extension Label Linkbase Document                                                                                                                                                                                                                                                                                                                                                                                                                         --                           --           --         --                   X\n\n101.PRE    Inline XBRL Taxonomy Extension Presentation Linkbase Document                                                                                                                                                                                                                                                                                                                                                                                                                  --                           --           --         --                   X\n\n104        Cover Page Interactive Data File (formatted as inline XBRL with applicable taxonomy extension information contained in Exhibits 101)\n\n* Furnished herewith\n\n** Indicates a management contract or compensatory plan or arrangement\n\n† Confidential treatment has been requested for portions of this exhibit\n\n†† Portions of this exhibit have been redacted in compliance with Regulation S-K Item 601(b)(10).\n\n(1) Indicates a filing of SolarCity\n\n(2) Indicates a filing of Maxwell Technologies, Inc.",
    "section": "Number     Exhibit Description                                                                                                                                                                                                                                                                                                                                                                                                                                                            Form                         File No.     Exhibit    Filing Date          Herewith",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 135,
    "text": "Tesla, Inc.\n\nDate: February 4, 2022    /s/ Elon Musk",
    "section": "Pursuant to the requirements of Section 13 or 15(d) the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 136,
    "text": "/s/ Elon Musk                   Chief Executive Officer and Director (Principal Executive Officer)    February 4, 2022",
    "section": "Signature                       Title                                                                 Date",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 137,
    "text": "/s/ Zachary J. Kirkhorn         Chief Financial Officer (Principal Financial Officer)                 February 4, 2022",
    "section": "Elon Musk",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 138,
    "text": "/s/ Vaibhav Taneja              Chief Accounting Officer (Principal Accounting Officer)               February 4, 2022",
    "section": "Zachary J. Kirkhorn",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  },
  {
    "chunk_id": 139,
    "text": "/s/ Lawrence J. Ellison         Director                                                              February 4, 2022",
    "section": "Ira Ehrenpreis",
    "type": "section",
    "company": "TSLA",
    "year": "2000"
  }
]