[
  {
    "chunk_id": 1,
    "text": "COMPANY: AAPL\nYEAR: 2019",
    "section": null,
    "type": "info",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 2,
    "text": "(Mark One)\n\n☒ ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "FORM 10-K",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 3,
    "text": "or\n\n☐ TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "For the fiscal year ended September 28, 2019",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 4,
    "text": "(Exact name of Registrant as specified in its charter)",
    "section": "Apple Inc.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 5,
    "text": "(State or other jurisdictionof incorporation or organization)    (I.R.S. Employer Identification No.)",
    "section": "California                                                       94-2404110",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 6,
    "text": "(Address of principal executive offices)                         (Zip Code)\n\n(408) 996-1010\n\n(Registrant's telephone number, including area code)",
    "section": "Cupertino                                                        California                              95014",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 7,
    "text": "1.000% Notes due 2022                       --                 The Nasdaq Stock Market LLC\n\n1.375% Notes due 2024                       --                 The Nasdaq Stock Market LLC\n\n0.875% Notes due 2025                       --                 The Nasdaq Stock Market LLC\n\n1.625% Notes due 2026                       --                 The Nasdaq Stock Market LLC\n\n2.000% Notes due 2027                       --                 The Nasdaq Stock Market LLC\n\n1.375% Notes due 2029                       --                 The Nasdaq Stock Market LLC\n\n3.050% Notes due 2029                       --                 The Nasdaq Stock Market LLC\n\n3.600% Notes due 2042                       --                 The Nasdaq Stock Market LLC",
    "section": "Common Stock, $0.00001 par value per share  AAPL               The Nasdaq Stock Market LLC",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 8,
    "text": "4,443,265,000 shares of common stock were issued and outstanding as of October 18, 2019.",
    "section": "The aggregate market value of the voting and non-voting stock held by non-affiliates of the Registrant, as of March 29, 2019, the last business day of the Registrant's most recently completed second fiscal quarter, was approximately $874,698,000,000. Solely for purposes of this disclosure, shares of common stock held by executive officers and directors of the Registrant as of such date have been excluded because such persons may be deemed to be affiliates. This determination of executive officers and directors as affiliates is not necessarily a conclusive determination for any other purposes.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 9,
    "text": "iPhone\n\niPhone® is the Company's line of smartphones based on its iOS operating system. In September 2019, the Company introduced three new iPhones: iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max.\n\nMac\n\nMac® is the Company's line of personal computers based on its macOS® operating system. During 2019, the Company released a new version of MacBook Air® and a new Mac mini®, and introduced an updated Mac Pro®, which is expected to be available in the fall of 2019.\n\niPad\n\niPad® is the Company's line of multi-purpose tablets. iPad is based on the Company's iPadOS™ operating system, which was introduced during 2019. Also during 2019, the Company released two new versions of iPad Pro®, an iPad Air®, an updated iPad mini® and a new 10.2-inch iPad.\n\nWearables, Home and Accessories\n\nWearables, Home and Accessories includes AirPods®, Apple TV®, Apple Watch®, Beats® products, HomePod™, iPod touch® and other Apple-branded and third-party accessories. AirPods are the Company's wireless headphones that interact with Siri. In October 2019, the Company introduced AirPods Pro™. Apple Watch is a personal electronic device that combines the watchOS® user interface and other technologies created specifically for a smaller device. In September 2019, the Company introduced Apple Watch Series 5.",
    "section": "Products",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 10,
    "text": "* * *\n\nAppleCare\n\nAppleCare® includes AppleCare \\+ (\"AC+\") and the AppleCare Protection Plan, which are fee-based services that extend the coverage of phone support eligibility and hardware repairs. AC+ offers additional coverage for instances of accidental damage and is available in certain countries for certain products. Additionally, AC+ with theft and loss protection is available for iPhone in the U.S.\n\niCloud\n\niCloud® is the Company's cloud service, which stores music, photos, contacts, calendars, mail, documents and more, keeping them up-to-date and available across multiple Apple devices and Windows personal computers.",
    "section": "The Company also offers subscription-based digital content streaming services, including Apple Music®, which offers users a curated listening experience with on-demand radio stations, and Apple TV+, which offers exclusive original content, and is expected to be available in November 2019.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 11,
    "text": "A downturn in the economic environment could also lead to increased credit and collectibility risk on the Company's trade receivables; the failure of derivative counterparties and other financial institutions; limitations on the Company's ability to issue new debt; reduced liquidity; and declines in the fair value of the Company's financial instruments. These and other economic factors could materially adversely affect the Company's business, results of operations, financial condition and growth.",
    "section": "In addition to an adverse impact on demand for the Company's products, uncertainty about, or a decline in, global or regional economic conditions could have a significant impact on the Company's suppliers, contract manufacturers, logistics providers, distributors, cellular network carriers and other channel partners. Potential effects include financial instability; inability to obtain credit to finance operations and purchases of the Company's products; and insolvency.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 12,
    "text": "Additionally, the Company faces significant competition as competitors imitate the Company's product features and applications within their products or collaborate to offer solutions that are more competitive than those they currently offer. The Company also expects competition to intensify as competitors imitate the Company's approach to providing components seamlessly within their offerings or work collaboratively to offer integrated solutions.",
    "section": "The Company has a minority market share in the global smartphone, personal computer and tablet markets. The Company faces substantial competition in these markets from companies that have significant technical, marketing, distribution and other resources, as well as established hardware, software and digital content supplier relationships. In addition, some of the Company's competitors have broader product lines, lower-priced products and a larger installed base of active devices. Competition has been particularly intense as competitors have aggressively cut prices and lowered product margins. Certain competitors may have the resources, experience or cost structures to provide products at little or no profit or even at a loss.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 13,
    "text": "Conversely, a strengthening of foreign currencies relative to the U.S. dollar, while generally beneficial to the Company's foreign currency-denominated sales and earnings, could cause the Company to reduce international pricing and incur losses on its foreign currency derivative instruments, thereby limiting the benefit. Additionally, strengthening of foreign currencies may increase the Company's cost of product components denominated in those currencies, thus adversely affecting gross margins.",
    "section": "The weakening of foreign currencies relative to the U.S. dollar adversely affects the U.S. dollar value of the Company's foreign currency-denominated sales and earnings, and generally leads the Company to raise international pricing, potentially reducing demand for the Company's products. In some circumstances, for competitive or other reasons, the Company may decide not to raise international pricing to offset the U.S. dollar's strengthening, which would adversely affect the U.S. dollar value of the gross margins the Company earns on foreign currency-denominated sales.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 14,
    "text": "$  78,869\n\n(1)  On April 30, 2019, the Company announced the Board of Directors increased the current share repurchase program authorization from $100 billion to $175 billion of the Company's common stock, of which $96.1 billion had been utilized as of September 28, 2019. The remaining $78.9 billion in the table represents the amount available to repurchase shares under the authorized repurchase program as of September 28, 2019. The Company's share repurchase program does not obligate it to acquire any specific number of shares. Under this program, shares may be repurchased in privately negotiated and/or open market transactions, including under plans complying with Rule 10b5-1 under the Exchange Act.\n\n(2)  In February 2019, the Company entered into an accelerated share repurchase arrangement (\"ASR\") to purchase up to $12.0 billion of the Company's common stock. In August 2019, the purchase period for this ASR ended and an additional 6.9 million shares were delivered and retired. In total, 62.0 million shares were delivered under this ASR at an average repurchase price of $193.69.\n\n* * *",
    "section": "Total                                             92,629",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 15,
    "text": "*  $100 invested on September 26, 2014 in stock or index, including reinvestment of dividends. Data points are the last day of each fiscal year for the Company's common stock and September 30th for indexes.\n\nCopyright(C) 2019 Standard & Poor's, a division of S&P Global. All rights reserved.\n\nCopyright(C) 2019 S&P Dow Jones Indices LLC, a division of S&P Global. All rights reserved.",
    "section": "The following graph shows a comparison of cumulative total shareholder return, calculated on a dividend-reinvested basis, for the Company, the S&P 500 Index, the S&P Information Technology Index and the Dow Jones U.S. Technology Supersector Index for the five years ended September 28, 2019. The graph assumes $100 was invested in each of the Company's common stock, the S&P 500 Index, the S&P Information Technology Index and the Dow Jones U.S. Technology Supersector Index as of the market close on September 26, 2014. Note that historic stock price performance is not necessarily indicative of future stock price performance.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 16,
    "text": "$               116\n\n$               116\n\n$               162\n\n$               240\n\n$               237\n\n\nS&P 500 Index    $  100\n\n$  99\n\n$  115\n\n$  136\n\n$  160\n\n$  167\n\n\nS&P Information Technology Index    $  100\n\n$  102\n\n$  125\n\n$  162\n\n$  213\n\n$  231",
    "section": "Apple Inc.    $               100",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 17,
    "text": "$  100\n\n$  122\n\n$  156\n\n$  205\n\n$  218\n\n* * *",
    "section": "Dow Jones U.S. Technology Supersector Index    $  100",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 18,
    "text": "$        265,595\n\n$        229,234\n\n$        215,639\n\n$        233,715",
    "section": "Total net sales  $     260,174",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 19,
    "text": "$       59,531\n\n$       48,351\n\n$       45,687\n\n$       53,394",
    "section": "Net income  $  55,256",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 20,
    "text": "$      12.01\n\n$      9.27\n\n$      8.35\n\n$      9.28",
    "section": "Basic                $  11.97",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 21,
    "text": "$      11.91\n\n$      9.21\n\n$      8.31\n\n$      9.22",
    "section": "Diluted  $  11.89",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 22,
    "text": "$     2.72\n\n$     2.40\n\n$     2.18\n\n$     1.98",
    "section": "Cash dividends declared per share  $  3.00",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 23,
    "text": "$        237,100\n\n$        268,895\n\n$        237,585\n\n$        205,666",
    "section": "Total cash, cash equivalents and marketable securities  $  205,898",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 24,
    "text": "$        365,725\n\n$        375,319\n\n$        321,686\n\n$        290,345\n\n\nNon-current portion of term debt  $  91,807\n\n$       93,735\n\n$       97,207\n\n$       75,427\n\n$       53,329",
    "section": "Total assets  $  338,516",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 25,
    "text": "$       48,914\n\n$       44,212\n\n$       39,986\n\n$       38,104\n\n* * *",
    "section": "Other non-current liabilities  $  50,503",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 26,
    "text": "iPhone (1)              $     142,381\n\n(14      )%        $     164,888\n\n18       %         $     139,337",
    "section": "Net sales by category:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 27,
    "text": "2   %     25,198\n\n(1  )%    25,569\n\n\niPad (1)  21,280\n\n16  %     18,380\n\n(2  )%    18,802\n\n\nWearables, Home and Accessories (1)(2)  24,482\n\n41  %    17,381\n\n36  %    12,826",
    "section": "Mac (1)  25,740",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 28,
    "text": "(2       )%    $  265,595\n\n16       %     $  229,234\n\n(1)  Products net sales include amortization of the deferred value of unspecified software upgrade rights, which are bundled in the sales price of the respective product.\n\n(2)  Wearables, Home and Accessories net sales include sales of AirPods, Apple TV, Apple Watch, Beats products, HomePod, iPod touch and Apple-branded and third-party accessories.\n\n(3)  Services net sales include sales from the Company's digital content stores and streaming services, AppleCare, licensing and other services. Services net sales also include amortization of the deferred value of Maps, Siri and free iCloud services, which are bundled in the sales price of certain products.\n\niPhone\n\niPhone net sales decreased during 2019 compared to 2018 due primarily to lower iPhone unit sales.\n\nMac",
    "section": "Total net sales  $  260,174",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 29,
    "text": "iPad\n\niPad net sales increased during 2019 compared to 2018 due primarily to higher net sales of iPad Pro.\n\nWearables, Home and Accessories\n\nWearables, Home and Accessories net sales increased during 2019 compared to 2018 due primarily to higher net sales of AirPods and Apple Watch.",
    "section": "Mac net sales increased during 2019 compared to 2018 due primarily to higher net sales of MacBook Air, partially offset by lower net sales of MacBook® and MacBook Pro®.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 30,
    "text": "4        %         $     112,093\n\n16       %         $     96,600",
    "section": "Americas                          $     116,914",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 31,
    "text": "(2       )%    $  265,595\n\n16       %     $  229,234",
    "section": "Total net sales  $  260,174",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 32,
    "text": "Year-over-year Services gross margin increased during 2019 and 2018 due primarily to higher Services net sales and a different services mix. Year-over-year Services gross margin percentage increased during 2019 and 2018 due primarily to a different services mix and leverage of the Company's services fixed cost structure from higher Services net sales.",
    "section": "Services Gross Margin",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 33,
    "text": "14      %         $     14,236\n\n23      %         $     11,581",
    "section": "Research and development  $     16,217",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 34,
    "text": "Selling, general and administrative  $  18,245\n\n9       %    $  16,705\n\n9       %    $  15,261",
    "section": "Percentage of total net sales        6  %               5       %        5  %",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 35,
    "text": "11      %    $  30,941\n\n15      %    $  26,842",
    "section": "Total operating expenses       $  34,462",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 36,
    "text": "(10    )%        $  2,005\n\n(27    )%        $  2,745",
    "section": "Total other income/(expense), net  $       1,807",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 37,
    "text": "2019           2018       2017\n\nCash, cash equivalents and marketable securities (1)  $     205,898\n\n$        237,100\n\n$        268,895\n\n\nProperty, plant and equipment, net  $  37,378\n\n$       41,304\n\n$       33,783",
    "section": "The following table presents selected financial information and statistics as of and for the years ended September 28, 2019, September 29, 2018 and September 30, 2017 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 38,
    "text": "(1)  As of September 28, 2019 and September 29, 2018, total cash, cash equivalents and marketable securities included $18.9 billion and $20.3 billion, respectively, that was restricted from general use, related to the State Aid Decision (refer to Note 5, \"Income Taxes\" in the Notes to Consolidated Financial Statements in Part II, Item 8 of this Form 10-K) and other agreements.",
    "section": "Cash used in financing activities                 $  (90,976  )           $  (87,876  )    $  (17,974  )",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 39,
    "text": "$       18,278\n\n$       19,329\n\n$       53,802\n\n$       101,679",
    "section": "Term debt  $                     10,270",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 40,
    "text": "$       29,286\n\n$       30,956\n\n$       75,940\n\n$       191,578\n\n(1)  Represents amount expected to be paid under manufacturing-related supplier arrangements, which are primarily noncancelable.",
    "section": "Total  $  55,396",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 41,
    "text": "(In millions, except number of shares which are reflected in thousands and per share amounts)",
    "section": "CONSOLIDATED STATEMENTS OF OPERATIONS",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 42,
    "text": "14,236\n\n11,581\n\n\nSelling, general and administrative  18,245\n\n16,705\n\n15,261",
    "section": "Research and development  16,217",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 43,
    "text": "(In millions, except number of shares which are reflected in thousands and par value)",
    "section": "CONSOLIDATED BALANCE SHEETS",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 44,
    "text": "170,799\n\n\nProperty, plant and equipment, net  37,378\n\n41,304",
    "section": "Marketable securities  105,341",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 45,
    "text": "2019    September 29,\n\n2018    September 30,\n\n2017\n\nCash, cash equivalents and restricted cash, beginning balances  $  25,913\n\n$       20,289\n\n$       20,484",
    "section": "September 28,",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 46,
    "text": "10,903\n\n10,157\n\n\nShare-based compensation expense  6,068\n\n5,340\n\n4,840",
    "section": "Depreciation and amortization                                                   12,547",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 47,
    "text": "(87,876  )\n\n(17,974  )\n\nIncrease/(Decrease) in cash, cash equivalents and restricted cash  24,311\n\n5,624\n\n(195    )\n\nCash, cash equivalents and restricted cash, ending balances        $        50,224\n\n$        25,913\n\n$        20,289",
    "section": "Cash used in financing activities                                  (90,976  )",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 48,
    "text": "Additionally, beginning in the first quarter of 2019, the Company classified the amortization of the deferred value of Maps, Siri and free iCloud services, which are bundled in the sales price of iPhone, Mac, iPad and certain other products, in Services net sales. Historically, the Company classified the amortization of these amounts in Products net sales consistent with its management reporting framework. As a result, Products and Services net sales for 2018 and 2017 were reclassified to conform to the 2019 presentation.",
    "section": "In the first quarter of 2019, the Company adopted the Financial Accounting Standards Board's (the \"FASB\") Accounting Standards Update (\"ASU\") No. 2014-09, Revenue from Contracts with Customers (Topic 606) (\"ASU 2014-09\"), and additional ASUs issued to clarify the guidance in ASU 2014-09 (collectively the \"new revenue standard\"), which amends the existing accounting standards for revenue recognition. The Company adopted the new revenue standard utilizing the full retrospective transition method. The Company did not restate total net sales in the prior periods presented, as the adoption of the new revenue standard did not have a material impact on previously reported amounts.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 49,
    "text": "$       59,531\n\n$       48,351\n\n\n\nDenominator:\n\nWeighted-average basic shares outstanding  4,617,834\n\n4,955,377\n\n5,217,242",
    "section": "Net income  $     55,256",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 50,
    "text": "44,732\n\n34,450\n\n\nWeighted-average diluted shares  4,648,913\n\n5,000,109\n\n5,251,692",
    "section": "Effect of dilutive securities  31,079",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 51,
    "text": "Non-cash investing activities involving property, plant and equipment resulted in a net increase/(decrease) to accounts payable and other current liabilities of $(2.9) billion and $3.4 billion during 2019 and 2018, respectively.\n\n* * *\n\nNon-Marketable Securities",
    "section": "Depreciation on property, plant and equipment is recognized on a straight-line basis over the estimated useful lives of the assets, which for buildings is the lesser of 30 years or the remaining life of the underlying building; between one and five years for machinery and equipment, including product tooling and manufacturing process equipment; and the shorter of lease term or useful life for leasehold improvements. Capitalized costs related to internal-use software are amortized on a straight-line basis over the estimated useful lives of the assets, which range from three to five years. Depreciation and amortization expense on property and equipment was $11.3 billion, $9.3 billion and $8.2 billion during 2019, 2018 and 2017, respectively.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 52,
    "text": "2019           2018       2017\n\niPhone (1)  $     142,381\n\n$        164,888\n\n$        139,337",
    "section": "Net sales disaggregated by significant products and services for 2019, 2018 and 2017 were as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 53,
    "text": "25,198\n\n25,569\n\n\niPad (1)  21,280\n\n18,380\n\n18,802\n\n\nWearables, Home and Accessories (1)(2)  24,482\n\n17,381\n\n12,826",
    "section": "Mac (1)  25,740",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 54,
    "text": "$        265,595\n\n$        229,234\n\n(1)  Products net sales include amortization of the deferred value of unspecified software upgrade rights, which are bundled in the sales price of the respective product.\n\n(2)  Wearables, Home and Accessories net sales include sales of AirPods, Apple TV, Apple Watch, Beats products, HomePod, iPod touch and Apple-branded and third-party accessories.\n\n(3)  Services net sales include sales from the Company's digital content stores and streaming services, AppleCare, licensing and other services. Services net sales also include amortization of the deferred value of Maps, Siri and free iCloud services, which are bundled in the sales price of certain products.\n\n(4)  Includes $5.9 billion of revenue recognized in 2019 that was included in deferred revenue as of September 29, 2018, $5.8 billion of revenue recognized in 2018 that was included in deferred revenue as of September 30, 2017, and $6.3 billion of revenue recognized in 2017 that was included in deferred revenue as of September 24, 2016.",
    "section": "Total net sales (4)  $  260,174",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 55,
    "text": "2019\n\nAdjustedCost          UnrealizedGains    UnrealizedLosses    FairValue    Cash andCashEquivalents    Short-TermMarketableSecurities    Long-TermMarketableSecurities",
    "section": "The following tables show the Company's cash and marketable securities by significant investment category as of September 28, 2019 and September 29, 2018 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 56,
    "text": "$       --\n\n$       --\n\n$       12,204\n\n$       12,204\n\n$       --\n\n$       --",
    "section": "Cash  $             12,204",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 57,
    "text": "U.S. Treasury securities  30,293\n\n33\n\n(62     )    30,264\n\n6,165\n\n9,817\n\n14,282\n\n\nU.S. agency securities  9,767\n\n1\n\n(3     )    9,765\n\n6,489\n\n2,249\n\n1,027\n\n\nNon-U.S. government securities  19,821\n\n337\n\n(50     )    20,108\n\n749\n\n3,168\n\n16,191",
    "section": "Level 2 (2):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 58,
    "text": "8\n\n(1   )    965\n\n--\n\n68\n\n897\n\n\nMortgage- and asset-backed securities  14,180\n\n67\n\n(73     )    14,174\n\n--\n\n1,122\n\n13,052",
    "section": "Municipal securities  958",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 59,
    "text": "$        1,202\n\n$        (281     )    $  205,898\n\n$        48,844\n\n$        51,713\n\n$        105,341\n\n\n\n\n2018\n\nAdjustedCost          UnrealizedGains    UnrealizedLosses    FairValue    Cash andCashEquivalents    Short-TermMarketableSecurities    Long-TermMarketableSecurities",
    "section": "Total (3)  $  204,977",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 60,
    "text": "$       --\n\n$       --\n\n$       11,575\n\n$       11,575\n\n$       --\n\n$       --",
    "section": "Cash  $             11,575",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 61,
    "text": "U.S. Treasury securities  47,296\n\n--\n\n(1,202  )    46,094\n\n1,613\n\n7,606\n\n36,875\n\n\nU.S. agency securities  4,127\n\n--\n\n(48    )    4,079\n\n1,732\n\n360\n\n1,987\n\n\nNon-U.S. government securities  21,601\n\n49\n\n(250    )    21,400\n\n--\n\n3,355\n\n18,045",
    "section": "Level 2 (2):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 62,
    "text": "--\n\n(12  )    934\n\n--\n\n178\n\n756\n\n\nMortgage- and asset-backed securities  18,105\n\n8\n\n(623    )    17,490\n\n--\n\n804\n\n16,686",
    "section": "Municipal securities  946",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 63,
    "text": "$        209\n\n$        (4,289   )    $  237,100\n\n$        25,913\n\n$        40,388\n\n$        170,799\n\n(1)  Level 1 fair value estimates are based on quoted prices in active markets for identical assets or liabilities.\n\n(2)  Level 2 fair value estimates are based on observable inputs other than quoted prices in active markets for identical assets and liabilities, quoted prices for identical or similar assets or liabilities in inactive markets, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\n\n(3)  As of September 28, 2019 and September 29, 2018, total cash, cash equivalents and marketable securities included $18.9 billion and $20.3 billion, respectively, that was restricted from general use, related to the State Aid Decision (refer to Note 5, \"Income Taxes\") and other agreements.\n\n* * *",
    "section": "Total (3)  $  241,180",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 64,
    "text": "A reconciliation of the Company's cash and cash equivalents in the Consolidated Balance Sheet to cash, cash equivalents and restricted cash in the Consolidated Statement of Cash Flows as of September 28, 2019 is as follows (in millions):\n\n\n\n2019",
    "section": "Restricted Cash",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 65,
    "text": "Cash, cash equivalents and restricted cash  $  50,224",
    "section": "Restricted cash included in other non-current assets  1,357",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 66,
    "text": "$      --\n\n$      1,456\n\n(1)  The fair value of derivative assets is measured using Level 2 fair value inputs and is recorded as other current assets and other non-current assets in the Consolidated Balance Sheets.\n\n(2)  The fair value of derivative liabilities is measured using Level 2 fair value inputs and is recorded as other current liabilities and other non-current liabilities in the Consolidated Balance Sheets.",
    "section": "Interest rate contracts  $  1,456",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 67,
    "text": "2019        2018     2017\n\nGains/(Losses) recognized in OCI - effective portion:",
    "section": "The following table shows the pre-tax gains and losses of the Company's derivative and non-derivative instruments designated as cash flow, net investment and fair value hedges in OCI and the Consolidated Statements of Operations for 2019, 2018 and 2017 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 68,
    "text": "$    67\n\n\n\nGains/(Losses) reclassified from AOCI into net income - effective portion:",
    "section": "Foreign currency debt   $  (58  )     $  4",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 69,
    "text": "$   (481   )\n\n$   1,956\n\n\n\nGains/(Losses) on derivative instruments:",
    "section": "Total                    $   (123   )",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 70,
    "text": "$       (1,531  )        $    (810  )\n\nGains/(Losses) related to hedged items:",
    "section": "Total                                    $      3,088",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 71,
    "text": "$       --\n\n\nFixed-rate debt  (2,068  )      1,363\n\n810",
    "section": "Marketable securities                    $      (1,018  )          $     167",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 72,
    "text": "2019                    2018\n\nNotionalAmount          Credit RiskAmount    NotionalAmount    Credit RiskAmount",
    "section": "The following table shows the notional amounts of the Company's outstanding derivative instruments and credit risk amounts associated with outstanding or unsettled derivative instruments as of September 28, 2019 and September 29, 2018 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 73,
    "text": "$       16,216\n\n\nMachinery, equipment and internal-use software  69,797\n\n65,982",
    "section": "Land and buildings  $     17,085",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 74,
    "text": "2019          2018\n\nLong-term taxes payable  $     29,545\n\n$       33,589",
    "section": "Other Non-Current Liabilities",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 75,
    "text": "* * *\n\nA reconciliation of the provision for income taxes, with the amount computed by applying the statutory federal income tax rate (21% in 2019; 24.5% in 2018; 35% in 2017) to income before provision for income taxes for 2019, 2018 and 2017, is as follows (dollars in millions):\n\n\n2019          2018      2017",
    "section": "The foreign provision for income taxes is based on foreign pre-tax earnings of $44.3 billion, $48.0 billion and $44.7 billion in 2019, 2018 and 2017, respectively.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 76,
    "text": "Maturities(calendar year)     2019                       2018\n\nAmount(in millions)           EffectiveInterest Rate     Amount(in millions)          EffectiveInterest Rate\n\n2013-2018 debt issuances:\n\nFloating-rate notes                                     2020                       -  2022                       $                    4,250\n\n2.25%                   -  3.28                 %                               $       7,107\n\n1.87%                   -  3.44                 %\n\nFixed-rate 0.350% - 4.650% notes                        2019                       -  2047                       90,429\n\n0.28%                   -  4.78                 %                               97,086\n\n0.28%                   -  4.78                 %\n\n2019 debt issuance:\n\nFixed-rate 1.700% - 2.950% notes                        2022                       -  2049                       7,000\n\n1.71%                   -  2.99                 %                               --\n\n--                   %",
    "section": "As of September 28, 2019, the Company had outstanding floating- and fixed-rate notes with varying maturities for an aggregate principal amount of $101.7 billion (collectively the \"Notes\"). The Notes are senior unsecured obligations and interest is payable in arrears. The following table provides a summary of the Company's term debt as of September 28, 2019 and September 29, 2018:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 77,
    "text": "(1,456                  )\n\nLess: Current portion of term debt                                                                               (10,260              )                                                    (8,784  )",
    "section": "Hedge accounting fair value adjustments                                                                          612",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 78,
    "text": "A portion of the Company's Japanese yen-denominated notes is designated as a hedge of the foreign currency exposure of the Company's net investment in a foreign operation. As of September 28, 2019 and September 29, 2018, the carrying value of the debt designated as a net investment hedge was $1.0 billion and $811 million, respectively. For further discussion regarding the Company's use of derivative instruments, refer to the Derivative Financial Instruments section of Note 3, \"Financial Instruments.\"",
    "section": "To manage interest rate risk on certain of its U.S. dollar-denominated fixed- or floating-rate notes, the Company has entered into interest rate swaps to effectively convert the fixed interest rates to floating interest rates or the floating interest rates to fixed interest rates on a portion of these notes. Additionally, to manage foreign currency risk on certain of its foreign currency-denominated notes, the Company has entered into foreign currency swaps to effectively convert these notes to U.S. dollar-denominated notes.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 79,
    "text": "2020  $  10,270\n\n\n2021  8,750\n\n\n2022  9,528\n\n\n2023  9,290\n\n\n2024  10,039",
    "section": "The future principal payments for the Company's Notes as of September 28, 2019 are as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 80,
    "text": "$  172\n\n$  707\n\n$  (584    )\n\n(1)  Refer to Note 1, \"Summary of Significant Accounting Policies\" for more information on the Company's adoption of ASU 2016-01 in 2019.",
    "section": "Balances as of September 28, 2019  $  (1,463  )",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 81,
    "text": "A summary of the Company's RSU activity and related information for 2019, 2018 and 2017, is as follows:",
    "section": "Restricted Stock Units",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 82,
    "text": "$  97.54\n\nRSUs granted                      50,112\n\n$  121.65\n\nRSUs vested                       (45,735                      )                                                $  95.48\n\nRSUs canceled                     (5,895                       )                                                $  106.87",
    "section": "Balance as of September 24, 2016  99,089",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 83,
    "text": "$  110.33\n\nRSUs granted                      45,351\n\n$  162.86\n\nRSUs vested                       (44,718                      )                                                $  111.24\n\nRSUs canceled                     (6,049                       )                                                $  127.82",
    "section": "Balance as of September 30, 2017  97,571",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 84,
    "text": "$  134.60\n\nRSUs granted                      36,852\n\n$  215.95\n\nRSUs vested                       (42,088                      )                                                $  135.21\n\nRSUs canceled                     (5,402                       )                                                $  162.85",
    "section": "Balance as of September 29, 2018  92,155",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 85,
    "text": "2019         2018     2017\n\nShare-based compensation expense  $     6,068\n\n$      5,340\n\n$      4,840",
    "section": "The following table shows share-based compensation expense and the related income tax benefit included in the Consolidated Statements of Operations for 2019, 2018 and 2017 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 86,
    "text": "2020  $  1,306\n\n\n2021  1,276\n\n\n2022  1,137\n\n\n2023  912\n\n\n2024  834",
    "section": "Rent expense under all operating leases, including both cancelable and noncancelable leases, was $1.3 billion, $1.2 billion and $1.1 billion in 2019, 2018 and 2017, respectively. Future minimum lease payments under noncancelable operating leases having initial or remaining terms in excess of one year as of September 28, 2019, are as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 87,
    "text": "2020  $  2,476\n\n\n2021  2,386\n\n\n2022  1,859\n\n\n2023  1,162\n\n\n2024  218",
    "section": "The Company has entered into certain off-balance sheet commitments that require the future purchase of goods or services (\"unconditional purchase obligations\"). The Company's unconditional purchase obligations primarily consist of payments for supplier arrangements, Internet and telecommunication services, intellectual property licenses and content creation. Future payments under noncancelable unconditional purchase obligations having a remaining term in excess of one year as of September 28, 2019, are as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 88,
    "text": "VirnetX\n\nVirnetX, Inc. (\"VirnetX\") filed two lawsuits in the U.S. District Court for the Eastern District of Texas (the \"Eastern Texas District Court\") against the Company alleging that certain Company products infringe four patents (the \"VirnetX Patents\") relating to network communications technology (\"VirnetX I\" and \"VirnetX II\"). On September 30, 2016, a jury returned a verdict in VirnetX I against the Company and awarded damages of $302 million, which later increased to $440 million in post-trial proceedings. The Company appealed the VirnetX I verdict to the U.S. Court of Appeals for the Federal Circuit (the \"Federal Circuit\"). On April 11, 2018, a jury returned a verdict in VirnetX II against the Company and awarded damages of $503 million. VirnetX II is currently on appeal. The Company has challenged the validity of the VirnetX Patents at the U.S. Patent and Trademark Office (the \"PTO\"). In response, the PTO has declared the VirnetX Patents invalid. VirnetX appealed the invalidity decision of the PTO to the Federal Circuit. The Federal Circuit consolidated the Company's appeal of the Eastern Texas District Court VirnetX I verdict and VirnetX's appeals from the PTO invalidity proceedings. On January 15, 2019, the Federal Circuit affirmed the VirnetX I verdict, which the Company intends to further appeal. On July 8, 2019, the Federal Circuit remanded one of VirnetX's two appeals of the PTO's invalidity decisions back to the PTO for further proceedings. On August 1, 2019, the Federal Circuit affirmed-in-part, vacated-in-part, and remanded back to the PTO portions of VirnetX's second appeal. The Company has accrued its best estimate for the ultimate resolution of these matters.\n\n* * *",
    "section": "The Company is subject to various legal proceedings and claims that have arisen in the ordinary course of business and that have not been fully resolved. The outcome of litigation is inherently uncertain. If one or more legal matters were resolved against the Company in a reporting period for amounts above management's expectations, the Company's financial condition and operating results for that reporting period could be materially adversely affected. In the opinion of management, there was not at least a reasonable possibility the Company may have incurred a material loss, or a material loss greater than a recorded accrual, concerning loss contingencies for asserted legal and other claims, except for the following matters:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 89,
    "text": "$      6,181\n\n$      5,304\n\nA reconciliation of the Company's segment operating income to the Consolidated Statements of Operations for 2019, 2018 and 2017 is as follows (in millions):\n\n\n2019          2018      2017",
    "section": "Operating income  $  6,055",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 90,
    "text": "$  265,595\n\n$  229,234\n\n\n\n2019          2018\n\nLong-lived assets:",
    "section": "Total net sales  $  260,174",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 91,
    "text": "$       41,304\n\n(1)  China includes Hong Kong and Taiwan. Long-lived assets located in China consist primarily of product tooling and manufacturing process equipment and assets related to retail stores and related infrastructure.\n\n* * *",
    "section": "Total long-lived assets  $  37,378",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 92,
    "text": "$     2.34\n\n$     2.73\n\n$     3.89\n\n(1)  Basic and diluted earnings per share are computed independently for each of the quarters presented. Therefore, the sum of quarterly basic and diluted per share information may not equal annual basic and diluted earnings per share.\n\n* * *",
    "section": "Diluted  $  2.91",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 93,
    "text": "A company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.",
    "section": "Definition and Limitations of Internal Control Over Financial Reporting",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 94,
    "text": "(i)  pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company's assets;\n\n(ii)  provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that the Company's receipts and expenditures are being made only in accordance with authorizations of the Company's management and directors; and\n\n(iii)  provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company's assets that could have a material effect on the financial statements.\n\nManagement, including the Company's Chief Executive Officer and Chief Financial Officer, does not expect that the Company's internal controls will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of internal controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, any evaluation of the effectiveness of controls in future periods are subject to the risk that those internal controls may become inadequate because of changes in business conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\nManagement's Annual Report on Internal Control over Financial Reporting",
    "section": "The Company's internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles (\"GAAP\"). The Company's internal control over financial reporting includes those policies and procedures that:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 95,
    "text": "(a)  Documents filed as part of this report\n\n(1)  All financial statements",
    "section": "Item 15.  Exhibits, Financial Statement Schedules",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 96,
    "text": "(3)  Exhibits required by Item 601 of Regulation S-K (1)",
    "section": "All financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and accompanying notes included in this Form 10-K.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 97,
    "text": "3.1               Restated Articles of Incorporation of the Registrant effective as of June 6, 2014.                                                                                                                                                                                                                        8-K     3.1        6/6/14\n\n3.2               Amended and Restated Bylaws of the Registrant effective as of December 13, 2016.                                                                                                                                                                                                                          8-K     3.2        12/15/16\n\n4.1**             Description of Securities of the Registrant.\n\n4.2               Indenture, dated as of April 29, 2013, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee.                                                                                                                                                                            S-3     4.1        4/29/13\n\n4.3               Officer's Certificate of the Registrant, dated as of May 3, 2013, including forms of global notes representing the Floating Rate Notes due 2016, Floating Rate Notes due 2018, 0.45% Notes due 2016, 1.00% Notes due 2018, 2.40% Notes due 2023 and 3.85% Notes due 2043.                                 8-K     4.1        5/3/13\n\n4.4               Officer's Certificate of the Registrant, dated as of May 6, 2014, including forms of global notes representing the Floating Rate Notes due 2017, Floating Rate Notes due 2019, 1.05% Notes due 2017, 2.10% Notes due 2019, 2.85% Notes due 2021, 3.45% Notes due 2024 and 4.45% Notes due 2044.           8-K     4.1        5/6/14\n\n4.5               Officer's Certificate of the Registrant, dated as of November 10, 2014, including forms of global notes representing the 1.000% Notes due 2022 and 1.625% Notes due 2026.                                                                                                                                 8-K     4.1        11/10/14\n\n4.6               Officer's Certificate of the Registrant, dated as of February 9, 2015, including forms of global notes representing the Floating Rate Notes due 2020, 1.55% Notes due 2020, 2.15% Notes due 2022, 2.50% Notes due 2025 and 3.45% Notes due 2045.                                                          8-K     4.1        2/9/15\n\n4.7               Officer's Certificate of the Registrant, dated as of May 13, 2015, including forms of global notes representing the Floating Rate Notes due 2017, Floating Rate Notes due 2020, 0.900% Notes due 2017, 2.000% Notes due 2020, 2.700% Notes due 2022, 3.200% Notes due 2025, and 4.375% Notes due 2045.    8-K     4.1        5/13/15\n\n4.8               Officer's Certificate of the Registrant, dated as of June 10, 2015, including forms of global notes representing the 0.350% Notes due 2020.                                                                                                                                                               8-K     4.1        6/10/15\n\n* * *",
    "section": "Exhibit Number    Exhibit Description                                                                                                                                                                                                                                                                                       Form    Exhibit    Filing Date/Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 98,
    "text": "4.9               Officer's Certificate of the Registrant, dated as of July 31, 2015, including forms of global notes representing the 3.05% Notes due 2029 and 3.60% Notes due 2042.                                                                                                                                                                                               8-K     4.1        7/31/15\n\n4.10              Officer's Certificate of the Registrant, dated as of September 17, 2015, including forms of global notes representing the 1.375% Notes due 2024 and 2.000% Notes due 2027.                                                                                                                                                                                        8-K     4.1        9/17/15\n\n4.11              Officer's Certificate of the Registrant, dated as of February 23, 2016, including forms of global notes representing the Floating Rate Notes due 2019, Floating Rate Notes due 2021, 1.300% Notes due 2018, 1.700% Notes due 2019, 2.250% Notes due 2021, 2.850% Notes due 2023, 3.250% Notes due 2026, 4.500% Notes due 2036 and 4.650% Notes due 2046.          8-K     4.1        2/23/16\n\n4.12              Supplement No. 1 to the Officer's Certificate of the Registrant, dated as of March 24, 2016.                                                                                                                                                                                                                                                                      8-K     4.1        3/24/16\n\n4.13              Officer's Certificate of the Registrant, dated as of June 22, 2016, including form of global note representing 4.15% Notes due 2046.                                                                                                                                                                                                                              8-K     4.1        6/22/16\n\n4.14              Officer's Certificate of the Registrant, dated as of August 4, 2016, including forms of global notes representing the Floating Rate Notes due 2019, 1.100% Notes due 2019, 1.550% Notes due 2021, 2.450% Notes due 2026 and 3.850% Notes due 2046.                                                                                                                8-K     4.1        8/4/16\n\n4.15              Officer's Certificate of the Registrant, dated as of February 9, 2017, including forms of global notes representing the Floating Rate Notes due 2019, Floating Rate Notes due 2020, Floating Rate Notes due 2022, 1.550% Notes due 2019, 1.900% Notes due 2020, 2.500% Notes due 2022, 3.000% Notes due 2024, 3.350% Notes due 2027 and 4.250% Notes due 2047.    8-K     4.1        2/9/17\n\n4.16              Officer's Certificate of the Registrant, dated as of March 3, 2017, including form of global note representing 4.300% Notes due 2047.                                                                                                                                                                                                                             8-K     4.1        3/3/17\n\n4.17              Officer's Certificate of the Registrant, dated as of May 11, 2017, including forms of global notes representing the Floating Rate Notes due 2020, Floating Rate Notes due 2022, 1.800% Notes due 2020, 2.300% Notes due 2022, 2.850% Notes due 2024 and 3.200% Notes due 2027.                                                                                    8-K     4.1        5/11/17\n\n4.18              Officer's Certificate of the Registrant, dated as of May 24, 2017, including forms of global notes representing the 0.875% Notes due 2025 and 1.375% Notes due 2029.                                                                                                                                                                                              8-K     4.1        5/24/17\n\n4.19              Officer's Certificate of the Registrant, dated as of June 20, 2017, including form of global note representing the 3.000% Notes due 2027.                                                                                                                                                                                                                         8-K     4.1        6/20/17\n\n4.20              Officer's Certificate of the Registrant, dated as of August 18, 2017, including form of global note representing the 2.513% Notes due 2024.                                                                                                                                                                                                                       8-K     4.1        8/18/17\n\n4.21              Officer's Certificate of the Registrant, dated as of September 12, 2017, including forms of global notes representing the 1.500% Notes due 2019, 2.100% Notes due 2022, 2.900% Notes due 2027 and 3.750% Notes due 2047.                                                                                                                                          8-K     4.1        9/12/17\n\n4.22              Officer's Certificate of the Registrant, dated as of November 13, 2017, including forms of global notes representing the 1.800% Notes due 2019, 2.000% Notes due 2020, 2.400% Notes due 2023, 2.750% Notes due 2025, 3.000% Notes due 2027 and 3.750% Notes due 2047.                                                                                             8-K     4.1        11/13/17\n\n4.23              Indenture, dated as of November 5, 2018, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee.                                                                                                                                                                                                                                  S-3     4.1        11/5/18\n\n4.24              Officer's Certificate of the Registrant, dated as of September 11, 2019, including forms of global notes representing the 1.700% Notes due 2022, 1.800% Notes due 2024, 2.050% Notes due 2026, 2.200% Notes due 2029 and 2.950% Notes due 2049.                                                                                                                   8-K     4.1        9/11/19\n\n4.25*             Apple Inc. Deferred Compensation Plan.                                                                                                                                                                                                                                                                                                                            S-8     4.1        8/23/18\n\n10.1*             Employee Stock Purchase Plan, as amended and restated as of March 10, 2015.                                                                                                                                                                                                                                                                                       8-K     10.1       3/13/15\n\n10.2*             Form of Indemnification Agreement between the Registrant and each director and executive officer of the Registrant.                                                                                                                                                                                                                                               10-Q    10.2       6/27/09\n\n10.3*             Apple Inc. Non-Employee Director Stock Plan, as amended and restated as of February 13, 2018.                                                                                                                                                                                                                                                                     8-K     10.1       2/14/18\n\n10.4*             2003 Employee Stock Plan, as amended through February 25, 2010.                                                                                                                                                                                                                                                                                                   8-K     10.1       3/1/10\n\n10.5*             Form of Restricted Stock Unit Award Agreement under 2003 Employee Stock Plan effective as of November 16, 2010.                                                                                                                                                                                                                                                   10-Q    10.10      12/25/10\n\n10.6*             2014 Employee Stock Plan, as amended and restated as of October 1, 2017.                                                                                                                                                                                                                                                                                          10-K    10.8       9/30/17\n\n* * *",
    "section": "Exhibit Number    Exhibit Description                                                                                                                                                                                                                                                                                                                                               Form    Exhibit    Filing Date/Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 99,
    "text": "10.7*             Form of Amendment, effective as of August 26, 2014, to Restricted Stock Unit Award Agreements and Performance Award Agreements outstanding as of August 26, 2014.                                  10-K    10.13      9/27/14\n\n10.8*             Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of October 5, 2015.                                                                                      10-Q    10.16      3/26/16\n\n10.9*             Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of October 14, 2016.                                                                                     10-K    10.18      9/24/16\n\n10.10*            Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 26, 2017.                                                                                   10-K    10.20      9/30/17\n\n10.11*            Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of September 26, 2017.                                                                                             10-K    10.21      9/30/17\n\n10.12*            Form of Restricted Stock Unit Award Agreement under Non-Employee Director Stock Plan effective as of February 13, 2018.                                                                            10-Q    10.2       3/31/18\n\n10.13*            Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of August 21, 2018.                                                                                      10-K    10.17      9/29/18\n\n10.14*            Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of August 21, 2018.                                                                                                10-K    10.18      9/29/18\n\n10.15*, **        Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 29, 2019.\n\n10.16*, **        Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of September 29, 2019.\n\n21.1**            Subsidiaries of the Registrant.\n\n23.1**            Consent of Independent Registered Public Accounting Firm.\n\n24.1**            Power of Attorney (included on the Signatures page of this Annual Report on Form 10-K).\n\n31.1**            Rule 13a-14(a) / 15d-14(a) Certification of Chief Executive Officer.\n\n31.2**            Rule 13a-14(a) / 15d-14(a) Certification of Chief Financial Officer.\n\n32.1***           Section 1350 Certifications of Chief Executive Officer and Chief Financial Officer.\n\n101**             Inline XBRL Document Set for the consolidated financial statements and accompanying notes in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K.\n\n104**             Inline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n\n*  Indicates management contract or compensatory plan or arrangement.\n\n**  Filed herewith.\n\n***  Furnished herewith.\n\n(1)  Certain instruments defining the rights of holders of long-term debt securities of the Registrant are omitted pursuant to Item 601(b)(4)(iii) of Regulation S-K. The Registrant hereby undertakes to furnish to the SEC, upon request, copies of any such instruments.",
    "section": "Exhibit Number    Exhibit Description                                                                                                                                                                                Form    Exhibit    Filing Date/Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 100,
    "text": "KNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Timothy D. Cook and Luca Maestri, jointly and severally, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof.",
    "section": "Power of Attorney",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 101,
    "text": "/s/ Timothy D. Cook       Chief Executive Officer and Director(Principal Executive Officer)              October 30, 2019",
    "section": "Name                      Title                                                                          Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 102,
    "text": "/s/ Luca Maestri          Senior Vice President, Chief Financial Officer(Principal Financial Officer)    October 30, 2019",
    "section": "TIMOTHY D. COOK",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 103,
    "text": "/s/ Chris Kondo           Senior Director of Corporate Accounting(Principal Accounting Officer)          October 30, 2019",
    "section": "LUCA MAESTRI",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  }
]