[
  {
    "chunk_id": 1,
    "text": "COMPANY: AAPL\nYEAR: 2019",
    "section": null,
    "type": "info",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 2,
    "text": "(Mark One)\n\n☒ ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "FORM 10-K",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 3,
    "text": "or\n\n☐ TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "For the fiscal year ended September 25, 2021",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 4,
    "text": "(Exact name of Registrant as specified in its charter)",
    "section": "Apple Inc.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 5,
    "text": "(State or other jurisdictionof incorporation or organization)    (I.R.S. Employer Identification No.)",
    "section": "California                                                       94-2404110",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 6,
    "text": "Cupertino, California                                            95014\n\n(Address of principal executive offices)                         (Zip Code)\n\n(408) 996-1010\n\n(Registrant's telephone number, including area code)",
    "section": "One Apple Park Way",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 7,
    "text": "1.000% Notes due 2022                       --                 The Nasdaq Stock Market LLC\n\n1.375% Notes due 2024                       --                 The Nasdaq Stock Market LLC\n\n0.000% Notes due 2025                       --                 The Nasdaq Stock Market LLC\n\n0.875% Notes due 2025                       --                 The Nasdaq Stock Market LLC\n\n1.625% Notes due 2026                       --                 The Nasdaq Stock Market LLC\n\n2.000% Notes due 2027                       --                 The Nasdaq Stock Market LLC\n\n1.375% Notes due 2029                       --                 The Nasdaq Stock Market LLC\n\n3.050% Notes due 2029                       --                 The Nasdaq Stock Market LLC\n\n0.500% Notes due 2031                       --                 The Nasdaq Stock Market LLC\n\n3.600% Notes due 2042                       --                 The Nasdaq Stock Market LLC",
    "section": "Common Stock, $0.00001 par value per share  AAPL               The Nasdaq Stock Market LLC",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 8,
    "text": "16,406,397,000 shares of common stock were issued and outstanding as of October 15, 2021.",
    "section": "The aggregate market value of the voting and non-voting stock held by non-affiliates of the Registrant, as of March 26, 2021, the last business day of the Registrant's most recently completed second fiscal quarter, was approximately $2,021,360,000,000. Solely for purposes of this disclosure, shares of common stock held by executive officers and directors of the Registrant as of such date have been excluded because such persons may be deemed to be affiliates. This determination of executive officers and directors as affiliates is not necessarily a conclusive determination for any other purposes.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 9,
    "text": "iPhone\n\niPhone® is the Company's line of smartphones based on its iOS operating system. In October and November 2020, the Company released iPhone 12, iPhone 12 mini, iPhone 12 Pro and iPhone 12 Pro Max, all with 5G technology. In September 2021, the Company released iPhone 13, iPhone 13 mini, iPhone 13 Pro and iPhone 13 Pro Max.\n\nMac\n\nMac® is the Company's line of personal computers based on its macOS® operating system. In November 2020, the Company released new versions of MacBook Air®, 13-inch MacBook Pro® and Mac mini®, and in May 2021, the Company released a redesigned iMac®, all powered by the Apple M1 chip. In October 2021, the Company released a redesigned MacBook Pro, available in 14- and 16-inch models and powered by the Apple M1 Pro or M1 Max chip.\n\niPad\n\niPad® is the Company's line of multipurpose tablets based on its iPadOS® operating system. In October 2020, the Company released a new iPad Air®, and in April 2021, the Company released a new iPad Pro® powered by the Apple M1 chip. In September 2021, the Company released an updated iPad and a new iPad mini®.\n\nWearables, Home and Accessories\n\nWearables, Home and Accessories includes AirPods®, Apple TV®, Apple Watch®, Beats® products, HomePod®, iPod touch® and accessories. AirPods are the Company's wireless headphones that interact with Siri®. In December 2020, the Company released AirPods Max™, new over-ear wireless headphones, and in October 2021, the Company released the third generation of AirPods. Apple Watch is the Company's line of smart watches based on its watchOS® operating system. In September 2021, the Company announced Apple Watch Series 7, which was available starting in October 2021.\n\n* * *",
    "section": "Products",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 10,
    "text": "COVID-19 has had, and continues to have, a significant impact around the world, prompting governments and businesses to take unprecedented measures in response. Such measures have included restrictions on travel and business operations, temporary closures of businesses, and quarantine and shelter-in-place orders. The COVID-19 pandemic has at times significantly curtailed global economic activity and caused significant volatility and disruption in global financial markets.",
    "section": "The Company's business, results of operations and financial condition, as well as the price of the Company's stock, have been adversely affected and could in the future be materially adversely affected by the COVID-19 pandemic.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 11,
    "text": "A downturn in the economic environment can also lead to increased credit and collectibility risk on the Company's trade receivables; the failure of derivative counterparties and other financial institutions; limitations on the Company's ability to issue new debt; reduced liquidity; and declines in the fair value of the Company's financial instruments. These and other economic factors can materially adversely affect the Company's business, results of operations and financial condition.",
    "section": "In addition to an adverse impact on demand for the Company's products, uncertainty about, or a decline in, global or regional economic conditions can have a significant impact on the Company's suppliers, contract manufacturers, logistics providers, distributors, cellular network carriers and other channel partners. Potential effects include financial instability; inability to obtain credit to finance operations and purchases of the Company's products; and insolvency.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 12,
    "text": "Additionally, the Company faces significant competition as competitors imitate the Company's product features and applications within their products or collaborate to offer solutions that are more competitive than those they currently offer. The Company also expects competition to intensify as competitors imitate the Company's approach to providing components seamlessly within their offerings or work collaboratively to offer integrated solutions.",
    "section": "The Company has a minority market share in the global smartphone, personal computer and tablet markets. The Company faces substantial competition in these markets from companies that have significant technical, marketing, distribution and other resources, as well as established hardware, software and digital content supplier relationships. In addition, some of the Company's competitors have broader product lines, lower-priced products and a larger installed base of active devices. Competition has been particularly intense as competitors have aggressively cut prices and lowered product margins. Certain competitors have the resources, experience or cost structures to provide products at little or no profit or even at a loss. Some of the markets in which the Company competes have from time to time experienced little to no growth or contracted overall.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 13,
    "text": "Further, the Company has commercial relationships with other companies in the technology industry that are or may become subject to investigations and litigation that, if resolved against those other companies, could adversely affect the Company's commercial relationships with those business partners and materially adversely affect the Company's business, results of operations and financial condition. For example, the Company earns revenue from licensing arrangements with other companies to offer their search services on the Company's platforms and apps, and certain of these arrangements are currently subject to government investigations and legal proceedings.",
    "section": "The Company is also currently subject to antitrust investigations in various jurisdictions around the world, which can result in legal proceedings and claims against the Company that could, individually or in the aggregate, have a materially adverse impact on the Company's business, results of operations and financial condition. For example, the Company is the subject of investigations in Europe and other jurisdictions relating to App Store terms and conditions. If such investigations result in adverse findings against the Company, the Company could be exposed to significant fines and may be required to make changes to its App Store business, all of which could materially adversely affect the Company's business, results of operations and financial condition. The Company is also subject to litigation relating to the App Store, which has resulted in changes to the Company's business practices, and may in the future result in further changes.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 14,
    "text": "Conversely, a strengthening of foreign currencies relative to the U.S. dollar, while generally beneficial to the Company's foreign currency-denominated sales and earnings, could cause the Company to reduce international pricing and incur losses on its foreign currency derivative instruments, thereby limiting the benefit. Additionally, strengthening of foreign currencies may increase the Company's cost of product components denominated in those currencies, thus adversely affecting gross margins.",
    "section": "The weakening of foreign currencies relative to the U.S. dollar adversely affects the U.S. dollar value of the Company's foreign currency-denominated sales and earnings, and generally leads the Company to raise international pricing, potentially reducing demand for the Company's products. In some circumstances, for competitive or other reasons, the Company may decide not to raise international pricing to offset the U.S. dollar's strengthening, which would adversely affect the U.S. dollar value of the gross margins the Company earns on foreign currency-denominated sales.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 15,
    "text": "(1)As of September 25, 2021, the Company was authorized to purchase up to $315 billion of the Company's common stock under a share repurchase program announced on April 28, 2021 (the \"Program\"), of which $254.1 billion had been utilized. The remaining $60.9 billion in the table represents the amount available to repurchase shares under the Program as of September 25, 2021. The Program does not obligate the Company to acquire any specific number of shares. Under the Program, shares may be repurchased in privately negotiated and/or open market transactions, including under plans complying with Rule 10b5-1 under the Exchange Act.\n\n(2)In May 2021, the Company entered into an accelerated share repurchase agreement (\"ASR\") to purchase up to $5.0 billion of the Company's common stock. In August 2021, the purchase period for this ASR ended and an additional 5 million shares were delivered and retired. In total, 36 million shares were delivered under this ASR at an average repurchase price of $137.20.\n\n* * *",
    "section": "Total                                             141,521                                                                                                               $       60,851",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 16,
    "text": "*$100 invested on September 23, 2016 in stock or index, including reinvestment of dividends. Data points are the last day of each fiscal year for the Company's common stock and September 30th for indexes.\n\nCopyright(C) 2021 Standard & Poor's, a division of S&P Global. All rights reserved.\n\nCopyright(C) 2021 S&P Dow Jones Indices LLC, a division of S&P Global. All rights reserved.",
    "section": "The following graph shows a comparison of cumulative total shareholder return, calculated on a dividend-reinvested basis, for the Company, the S&P 500 Index, the S&P Information Technology Index and the Dow Jones U.S. Technology Supersector Index for the five years ended September 25, 2021. The graph assumes $100 was invested in each of the Company's common stock, the S&P 500 Index, the S&P Information Technology Index and the Dow Jones U.S. Technology Supersector Index as of the market close on September 23, 2016. Note that past stock price performance is not necessarily indicative of future stock price performance.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 17,
    "text": "S&P 500 Index                                  $               100                    $               119                    $               140                    $  146      $  168      $  218\n\nS&P Information Technology Index               $               100                    $               129                    $               169                    $  184      $  271      $  349",
    "section": "Apple Inc.                                     $               100                    $               139                    $               207                    $  204      $  422      $  556",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 18,
    "text": "iPhone (1)                              $       191,973              39    %          $  137,781         (3)  %         $  142,381",
    "section": "Net sales by category:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 19,
    "text": "iPad (1)                                31,862                   34  %        23,724              11  %       21,280\n\nWearables, Home and Accessories (1)(2)  38,367                   25  %        30,620              25  %       24,482",
    "section": "Mac (1)                                 35,190                   23  %        28,622              11  %       25,740",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 20,
    "text": "(1)Products net sales include amortization of the deferred value of unspecified software upgrade rights, which are bundled in the sales price of the respective product.\n\n(2)Wearables, Home and Accessories net sales include sales of AirPods, Apple TV, Apple Watch, Beats products, HomePod, iPod touch and accessories.\n\n(3)Services net sales include sales from the Company's advertising, AppleCare, cloud, digital content, payment and other services. Services net sales also include amortization of the deferred value of services bundled in the sales price of certain products.\n\niPhone\n\niPhone net sales increased during 2021 compared to 2020 due primarily to higher net sales from the Company's new iPhone models launched in the first quarter and fourth quarter of 2021 and a favorable mix of iPhone sales.\n\nMac",
    "section": "Total net sales                         $       365,817              33    %          $  274,515         6    %         $  260,174",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 21,
    "text": "iPad\n\niPad net sales increased during 2021 compared to 2020 due primarily to higher net sales of iPad Air and iPad Pro.\n\nWearables, Home and Accessories\n\nWearables, Home and Accessories net sales increased during 2021 compared to 2020 due primarily to higher net sales of accessories and Apple Watch.",
    "section": "Mac net sales increased during 2021 compared to 2020 due primarily to higher net sales of MacBook Air, MacBook Pro and iMac.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 22,
    "text": "Selling, general and administrative  $     21,973            10    %           $  19,916        9   %    $  18,245",
    "section": "Percentage of total net sales        6     %                       7   %                    6   %",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 23,
    "text": "(In millions, except number of shares which are reflected in thousands and per share amounts)",
    "section": "CONSOLIDATED STATEMENTS OF OPERATIONS",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 24,
    "text": "(In millions, except number of shares which are reflected in thousands and par value)",
    "section": "CONSOLIDATED BALANCE SHEETS",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 25,
    "text": "2021    September 26,\n\n2020    September 28,\n\n2019\n\nCash, cash equivalents and restricted cash, beginning balances                  $          39,789               $  50,224              $  25,913",
    "section": "September 25,",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 26,
    "text": "Increase/(Decrease) in cash, cash equivalents and restricted cash               (3,860)              (10,435)              24,311\n\nCash, cash equivalents and restricted cash, ending balances                     $          35,929               $  39,789              $  50,224",
    "section": "Cash used in financing activities                                               (93,353)             (86,820)              (90,976)",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 27,
    "text": "Denominator:\n\nWeighted-average basic shares outstanding  16,701,272                17,352,119                18,471,336",
    "section": "Net income                                 $           94,680                    $     57,411                $  55,256",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 28,
    "text": "2021             2020          2019\n\niPhone (1)                              $       191,973                $     137,781            $  142,381",
    "section": "Net sales disaggregated by significant products and services for 2021, 2020 and 2019 were as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 29,
    "text": "iPad (1)                                31,862                 23,724                 21,280\n\nWearables, Home and Accessories (1)(2)  38,367                 30,620                 24,482",
    "section": "Mac (1)                                 35,190                 28,622                 25,740",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 30,
    "text": "(1)Products net sales include amortization of the deferred value of unspecified software upgrade rights, which are bundled in the sales price of the respective product.\n\n(2)Wearables, Home and Accessories net sales include sales of AirPods, Apple TV, Apple Watch, Beats products, HomePod, iPod touch and accessories.\n\n(3)Services net sales include sales from the Company's advertising, AppleCare, cloud, digital content, payment and other services. Services net sales also include amortization of the deferred value of services bundled in the sales price of certain products.\n\n(4)Includes $6.7 billion of revenue recognized in 2021 that was included in deferred revenue as of September 26, 2020, $5.0 billion of revenue recognized in 2020 that was included in deferred revenue as of September 28, 2019, and $5.9 billion of revenue recognized in 2019 that was included in deferred revenue as of September 29, 2018.",
    "section": "Total net sales (4)                     $       365,817                $     274,515            $  260,174",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 31,
    "text": "U.S. Treasury securities                   22,878              102              (77)          22,903       3,596             6,625              12,682\n\nU.S. agency securities                     8,949               2                (64)          8,887        1,775             1,930              5,182\n\nNon-U.S. government securities             20,201              211              (101)         20,311       390               3,091              16,830",
    "section": "Equity securities                          1,527               --               (564)         963          --                963                --",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 32,
    "text": "Mortgage- and asset-backed securities      20,529              171              (124)         20,576       --                775                19,801",
    "section": "Municipal securities                       967                 14               --            981          --                130                851",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 33,
    "text": "U.S. Treasury securities                   28,439              331              --          28,770       8,580              11,972             8,218\n\nU.S. agency securities                     8,604               8                --          8,612        2,009              3,078              3,525\n\nNon-U.S. government securities             19,361              275              (186)       19,450       255                3,329              15,866",
    "section": "Level 2 (2):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 34,
    "text": "Mortgage- and asset-backed securities      13,520              314              (24)        13,810       --                 435                13,375",
    "section": "Municipal securities                       1,001               22               --          1,023        --                 139                884",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 35,
    "text": "(1)Level 1 fair value estimates are based on quoted prices in active markets for identical assets or liabilities.\n\n(2)Level 2 fair value estimates are based on observable inputs other than quoted prices in active markets for identical assets and liabilities, quoted prices for identical or similar assets or liabilities in inactive markets, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\n\n(3)As of September 25, 2021 and September 26, 2020, total marketable securities included $17.9 billion and $18.6 billion, respectively, that was restricted from general use, related to the State Aid Decision (refer to Note 5, \"Income Taxes\") and other agreements.\n\n* * *",
    "section": "Total (3)                                  $        189,431           $  2,784           $  (385)        $       191,830            $  38,016             $  52,927      $  100,887",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 36,
    "text": "2021            2020\n\nLong-term taxes payable              $       24,689                $  28,170",
    "section": "Other Non-Current Liabilities",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 37,
    "text": "A reconciliation of the provision for income taxes, with the amount computed by applying the statutory federal income tax rate (21% in 2021, 2020 and 2019) to income before provision for income taxes for 2021, 2020 and 2019, is as follows (dollars in millions):\n\n\n2021             2020           2019",
    "section": "The foreign provision for income taxes is based on foreign pretax earnings of $68.7 billion, $38.1 billion and $44.3 billion in 2021, 2020 and 2019, respectively.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 38,
    "text": "Lease-Related Assets and Liabilities    Financial Statement Line Items        2021           2020\n\nRight-of-use assets:",
    "section": "The following table shows ROU assets and lease liabilities, and the associated financial statement line items, as of September 25, 2021 and September 26, 2020 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 39,
    "text": "2022                            $        1,629             $  104             $  1,733\n\n2023                            1,560               123            1,683\n\n2024                            1,499               99             1,598\n\n2025                            1,251               46             1,297\n\n2026                            1,061               26             1,087",
    "section": "Leases                                   Total",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 40,
    "text": "2013 - 2020 debt issuances:\n\nFloating-rate notes                                     2022           $        1,750                     0.48% - 0.63%           $  2,250                     0.60% - 1.39%\n\nFixed-rate 0.000% - 4.650% notes                        2022 - 2060    95,813              0.03% - 4.78%                 103,828             0.03% - 4.78%",
    "section": "Interest Rate",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 41,
    "text": "Fixed-rate 0.700% - 2.800% notes                        2026 - 2061    14,000              0.75% - 2.81%                 --                  --             %",
    "section": "Second quarter 2021 debt issuance:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 42,
    "text": "Fixed-rate 1.400% - 2.850% notes                        2028 - 2061    6,500               1.43% - 2.86%                 --                  --             %",
    "section": "Fourth quarter 2021 debt issuance:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 43,
    "text": "Less: Current portion of term debt                                     (9,613)                                           (8,773)",
    "section": "Hedge accounting fair value adjustments                                1,036                                             1,676",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 44,
    "text": "2022             $       9,583\n\n2023             11,391\n\n2024             10,202\n\n2025             10,914\n\n2026             11,408",
    "section": "The future principal payments for the Company's Notes as of September 25, 2021, are as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 45,
    "text": "A summary of the Company's RSU activity and related information for 2021, 2020 and 2019, is as follows:",
    "section": "Restricted Stock Units",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 46,
    "text": "RSUs granted                      147,409                                        $  53.99\n\nRSUs vested                       (168,350)                                      $  33.80\n\nRSUs canceled                     (21,609)                                       $  40.71",
    "section": "Balance as of September 29, 2018  368,618                                        $  33.65",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 47,
    "text": "RSUs granted                      156,800                                        $  59.20\n\nRSUs vested                       (157,743)                                      $  40.29\n\nRSUs canceled                     (14,347)                                       $  48.07",
    "section": "Balance as of September 28, 2019  326,068                                        $  42.30",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 48,
    "text": "RSUs granted                      89,363                                         $  116.33\n\nRSUs vested                       (145,766)                                      $  50.71\n\nRSUs canceled                     (13,948)                                       $  68.95",
    "section": "Balance as of September 26, 2020  310,778                                        $  51.58",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 49,
    "text": "2021           2020    2019\n\nShare-based compensation expense                                $     7,906            $     6,829        $  6,068",
    "section": "The following table shows share-based compensation expense and the related income tax benefit included in the Consolidated Statements of Operations for 2021, 2020 and 2019 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 50,
    "text": "2022        $      4,551\n\n2023        2,165\n\n2024        984\n\n2025        405\n\n2026        51",
    "section": "The Company has entered into certain off-balance sheet commitments that require the future purchase of goods or services (\"unconditional purchase obligations\"). The Company's unconditional purchase obligations primarily consist of payments for content creation, Internet and telecommunications services and supplier arrangements. Future payments under noncancelable unconditional purchase obligations having a remaining term in excess of one year as of September 25, 2021, are as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 51,
    "text": "VirnetX\n\nVirnetX, Inc. (\"VirnetX\") filed a lawsuit against the Company alleging that certain of the Company's products infringe on patents owned by VirnetX. On April 11, 2018, a jury returned a verdict against the Company in the U.S. District Court for the Eastern District of Texas (the \"Eastern Texas District Court\"). The Company appealed the verdict to the U.S. Court of Appeals for the Federal Circuit, which remanded the case back to the Eastern Texas District Court, where a retrial was held in October 2020. The jury returned a verdict against the Company and awarded damages of $503 million, which the Company has appealed. The Company has challenged the validity of the patents at issue in the retrial at the U.S. Patent and Trademark Office (the \"PTO\"), and the PTO has declared the patents invalid, subject to further appeal by VirnetX.\n\niOS Performance Management Cases",
    "section": "The Company is subject to various legal proceedings and claims that have arisen in the ordinary course of business and that have not been fully resolved. The outcome of litigation is inherently uncertain. When a loss related to a legal proceeding or claim is probable and reasonably estimable, the Company accrues its best estimate for the ultimate resolution of the matter. If one or more legal matters were resolved against the Company in a reporting period for amounts above management's expectations, the Company's financial condition and operating results for that reporting period could be materially adversely affected. In the opinion of management, there was not at least a reasonable possibility the Company may have incurred a material loss, or a material loss greater than a recorded accrual, concerning loss contingencies for asserted legal and other claims, except for the following matters:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 52,
    "text": "A reconciliation of the Company's segment operating income to the Consolidated Statements of Operations for 2021, 2020 and 2019 is as follows (in millions):\n\n\n2021               2020            2019",
    "section": "Operating income       $     9,817            $     6,808        $  6,055",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 53,
    "text": "(1)China includes Hong Kong and Taiwan. Long-lived assets located in China consist primarily of product tooling and manufacturing process equipment and assets related to retail stores and related infrastructure.\n\n* * *",
    "section": "Total long-lived assets  $        39,440                  $     36,766",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 54,
    "text": "A company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.",
    "section": "Definition and Limitations of Internal Control Over Financial Reporting",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 55,
    "text": "(i)pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company's assets;\n\n(ii)provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that the Company's receipts and expenditures are being made only in accordance with authorizations of the Company's management and directors; and\n\n(iii)provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company's assets that could have a material effect on the financial statements.\n\nManagement, including the Company's Chief Executive Officer and Chief Financial Officer, does not expect that the Company's internal controls will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of internal controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, any evaluation of the effectiveness of controls in future periods are subject to the risk that those internal controls may become inadequate because of changes in business conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\nManagement's Annual Report on Internal Control over Financial Reporting",
    "section": "The Company's internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles (\"GAAP\"). The Company's internal control over financial reporting includes those policies and procedures that:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 56,
    "text": "(a)Documents filed as part of this report\n\n(1)All financial statements",
    "section": "Item 15. Exhibit and Financial Statement Schedules",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 57,
    "text": "(3)Exhibits required by Item 601 of Regulation S-K (1)",
    "section": "All financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and accompanying notes included in this Form 10-K.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 58,
    "text": "3.1      Restated Articles of Incorporation of the Registrant filed on August 3, 2020.                                                                                                                                                                                                                             8-K    3.1    8/7/20\n\n3.2      Amended and Restated Bylaws of the Registrant effective as of December 13, 2016.                                                                                                                                                                                                                          8-K    3.2    12/15/16\n\n4.1**    Description of Securities of the Registrant.\n\n4.2      Indenture, dated as of April 29, 2013, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee.                                                                                                                                                                            S-3    4.1    4/29/13\n\n4.3      Officer's Certificate of the Registrant, dated as of May 3, 2013, including forms of global notes representing the Floating Rate Notes due 2016, Floating Rate Notes due 2018, 0.45% Notes due 2016, 1.00% Notes due 2018, 2.40% Notes due 2023 and 3.85% Notes due 2043.                                 8-K    4.1    5/3/13\n\n4.4      Officer's Certificate of the Registrant, dated as of May 6, 2014, including forms of global notes representing the Floating Rate Notes due 2017, Floating Rate Notes due 2019, 1.05% Notes due 2017, 2.10% Notes due 2019, 2.85% Notes due 2021, 3.45% Notes due 2024 and 4.45% Notes due 2044.           8-K    4.1    5/6/14\n\n4.5      Officer's Certificate of the Registrant, dated as of November 10, 2014, including forms of global notes representing the 1.000% Notes due 2022 and 1.625% Notes due 2026.                                                                                                                                 8-K    4.1    11/10/14\n\n4.6      Officer's Certificate of the Registrant, dated as of February 9, 2015, including forms of global notes representing the Floating Rate Notes due 2020, 1.55% Notes due 2020, 2.15% Notes due 2022, 2.50% Notes due 2025 and 3.45% Notes due 2045.                                                          8-K    4.1    2/9/15\n\n4.7      Officer's Certificate of the Registrant, dated as of May 13, 2015, including forms of global notes representing the Floating Rate Notes due 2017, Floating Rate Notes due 2020, 0.900% Notes due 2017, 2.000% Notes due 2020, 2.700% Notes due 2022, 3.200% Notes due 2025, and 4.375% Notes due 2045.    8-K    4.1    5/13/15\n\n4.8      Officer's Certificate of the Registrant, dated as of July 31, 2015, including forms of global notes representing the 3.05% Notes due 2029 and 3.60% Notes due 2042.                                                                                                                                       8-K    4.1    7/31/15\n\n* * *",
    "section": "Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 59,
    "text": "4.9      Officer's Certificate of the Registrant, dated as of September 17, 2015, including forms of global notes representing the 1.375% Notes due 2024 and 2.000% Notes due 2027.                                                                                                                                                                                        8-K    4.1    9/17/15\n\n4.10     Officer's Certificate of the Registrant, dated as of February 23, 2016, including forms of global notes representing the Floating Rate Notes due 2019, Floating Rate Notes due 2021, 1.300% Notes due 2018, 1.700% Notes due 2019, 2.250% Notes due 2021, 2.850% Notes due 2023, 3.250% Notes due 2026, 4.500% Notes due 2036 and 4.650% Notes due 2046.          8-K    4.1    2/23/16\n\n4.11     Supplement No. 1 to the Officer's Certificate of the Registrant, dated as of March 24, 2016.                                                                                                                                                                                                                                                                      8-K    4.1    3/24/16\n\n4.12     Officer's Certificate of the Registrant, dated as of August 4, 2016, including forms of global notes representing the Floating Rate Notes due 2019, 1.100% Notes due 2019, 1.550% Notes due 2021, 2.450% Notes due 2026 and 3.850% Notes due 2046.                                                                                                                8-K    4.1    8/4/16\n\n4.13     Officer's Certificate of the Registrant, dated as of February 9, 2017, including forms of global notes representing the Floating Rate Notes due 2019, Floating Rate Notes due 2020, Floating Rate Notes due 2022, 1.550% Notes due 2019, 1.900% Notes due 2020, 2.500% Notes due 2022, 3.000% Notes due 2024, 3.350% Notes due 2027 and 4.250% Notes due 2047.    8-K    4.1    2/9/17\n\n4.14     Officer's Certificate of the Registrant, dated as of May 11, 2017, including forms of global notes representing the Floating Rate Notes due 2020, Floating Rate Notes due 2022, 1.800% Notes due 2020, 2.300% Notes due 2022, 2.850% Notes due 2024 and 3.200% Notes due 2027.                                                                                    8-K    4.1    5/11/17\n\n4.15     Officer's Certificate of the Registrant, dated as of May 24, 2017, including forms of global notes representing the 0.875% Notes due 2025 and 1.375% Notes due 2029.                                                                                                                                                                                              8-K    4.1    5/24/17\n\n4.16     Officer's Certificate of the Registrant, dated as of June 20, 2017, including form of global note representing the 3.000% Notes due 2027.                                                                                                                                                                                                                         8-K    4.1    6/20/17\n\n4.17     Officer's Certificate of the Registrant, dated as of August 18, 2017, including form of global note representing the 2.513% Notes due 2024.                                                                                                                                                                                                                       8-K    4.1    8/18/17\n\n4.18     Officer's Certificate of the Registrant, dated as of September 12, 2017, including forms of global notes representing the 1.500% Notes due 2019, 2.100% Notes due 2022, 2.900% Notes due 2027 and 3.750% Notes due 2047.                                                                                                                                          8-K    4.1    9/12/17\n\n4.19     Officer's Certificate of the Registrant, dated as of November 13, 2017, including forms of global notes representing the 1.800% Notes due 2019, 2.000% Notes due 2020, 2.400% Notes due 2023, 2.750% Notes due 2025, 3.000% Notes due 2027 and 3.750% Notes due 2047.                                                                                             8-K    4.1    11/13/17\n\n4.20     Indenture, dated as of November 5, 2018, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee.                                                                                                                                                                                                                                  S-3    4.1    11/5/18\n\n4.21     Officer's Certificate of the Registrant, dated as of September 11, 2019, including forms of global notes representing the 1.700% Notes due 2022, 1.800% Notes due 2024, 2.050% Notes due 2026, 2.200% Notes due 2029 and 2.950% Notes due 2049.                                                                                                                   8-K    4.1    9/11/19\n\n4.22     Officer's Certificate of the Registrant, dated as of November 15, 2019, including forms of global notes representing the 0.000% Notes due 2025 and 0.500% Notes due 2031.                                                                                                                                                                                         8-K    4.1    11/15/19\n\n4.23     Officer's Certificate of the Registrant, dated as of May 11, 2020, including forms of global notes representing the 0.750% Notes due 2023, 1.125% Notes due 2025, 1.650% Notes due 2030 and 2.650% Notes due 2050.                                                                                                                                                8-K    4.1    5/11/20\n\n4.24     Officer's Certificate of the Registrant, dated as of August 20, 2020, including forms of global notes representing the 0.550% Notes due 2025, 1.25% Notes due 2030, 2.400% Notes due 2050 and 2.550% Notes due 2060.                                                                                                                                              8-K    4.1    8/20/20\n\n4.25     Officer's Certificate of the Registrant, dated as of February 8, 2021, including forms of global notes representing the 0.700% Notes due 2026, 1.200% Notes due 2028, 1.650% Notes due 2031, 2.375% Notes due 2041, 2.650% Notes due 2051 and 2.800% Notes due 2061.                                                                                              8-K    4.1    2/8/21\n\n4.26     Officer's Certificate of the Registrant, dated as of August 5, 2021, including forms of global notes representing the 1.400% Notes due 2028, 1.700% Notes due 2031, 2.700% Notes due 2051 and 2.850% Notes due 2061.                                                                                                                                              8-K    4.1    8/5/21\n\n4.27*    Apple Inc. Deferred Compensation Plan.                                                                                                                                                                                                                                                                                                                            S-8    4.1    8/23/18\n\n* * *",
    "section": "Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 60,
    "text": "10.1*      Employee Stock Purchase Plan, as amended and restated as of March 10, 2015.                                                                                                                        8-K     10.1     3/13/15\n\n10.2*      Form of Indemnification Agreement between the Registrant and each director and executive officer of the Registrant.                                                                                10-Q    10.2     6/27/09\n\n10.3*      Apple Inc. Non-Employee Director Stock Plan, as amended and restated as of February 13, 2018.                                                                                                      8-K     10.1     2/14/18\n\n10.4*      2014 Employee Stock Plan, as amended and restated as of October 1, 2017.                                                                                                                           10-K    10.8     9/30/17\n\n10.5*      Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of October 14, 2016.                                                                                     10-K    10.18    9/24/16\n\n10.6*      Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 26, 2017.                                                                                   10-K    10.20    9/30/17\n\n10.7*      Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of September 26, 2017.                                                                                             10-K    10.21    9/30/17\n\n10.8*      Form of Restricted Stock Unit Award Agreement under Non-Employee Director Stock Plan effective as of February 13, 2018.                                                                            10-Q    10.2     3/31/18\n\n10.9*      Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of August 21, 2018.                                                                                      10-K    10.17    9/29/18\n\n10.10*     Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of August 21, 2018.                                                                                                10-K    10.18    9/29/18\n\n10.11*     Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 29, 2019.                                                                                   10-K    10.15    9/28/19\n\n10.12*     Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of September 29, 2019.                                                                                             10-K    10.16    9/28/19\n\n10.13*     Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of August 18, 2020.                                                                                      10-K    10.16    9/26/20\n\n10.14*     Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of August 18, 2020.                                                                                                10-K    10.17    9/26/20\n\n10.15*     Form of CEO Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 27, 2020.                                                                               10-Q    10.1     1/28/21\n\n10.16*     Form of CEO Performance Award Agreement under 2014 Employee Stock Plan effective as of September 27, 2020.                                                                                         10-Q    10.2     1/28/21\n\n21.1**     Subsidiaries of the Registrant.\n\n23.1**     Consent of Independent Registered Public Accounting Firm.\n\n24.1**     Power of Attorney (included on the Signatures page of this Annual Report on Form 10-K).\n\n31.1**     Rule 13a-14(a) / 15d-14(a) Certification of Chief Executive Officer.\n\n31.2**     Rule 13a-14(a) / 15d-14(a) Certification of Chief Financial Officer.\n\n32.1***    Section 1350 Certifications of Chief Executive Officer and Chief Financial Officer.\n\n101**      Inline XBRL Document Set for the consolidated financial statements and accompanying notes in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K.\n\n104**      Inline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n\n*Indicates management contract or compensatory plan or arrangement.\n\n**Filed herewith.\n\n***Furnished herewith.\n\n(1)Certain instruments defining the rights of holders of long-term debt securities of the Registrant are omitted pursuant to Item 601(b)(4)(iii) of Regulation S-K. The Registrant hereby undertakes to furnish to the SEC, upon request, copies of any such instruments.",
    "section": "Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 61,
    "text": "Date: October 28, 2021  Apple Inc.\n\n\nBy:    /s/ Luca Maestri",
    "section": "Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 62,
    "text": "KNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Timothy D. Cook and Luca Maestri, jointly and severally, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof.",
    "section": "Power of Attorney",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 63,
    "text": "/s/ Timothy D. Cook               Chief Executive Officer and Director\n\n(Principal Executive Officer)     October 28, 2021",
    "section": "Name                              Title                                             Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 64,
    "text": "/s/ Luca Maestri                  Senior Vice President, Chief Financial Officer\n\n(Principal Financial Officer)     October 28, 2021",
    "section": "TIMOTHY D. COOK",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 65,
    "text": "/s/ Chris Kondo                   Senior Director of Corporate Accounting\n\n(Principal Accounting Officer)    October 28, 2021",
    "section": "LUCA MAESTRI",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 66,
    "text": "/s/ James A. Bell                 Director                                          October 28, 2021",
    "section": "CHRIS KONDO",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 67,
    "text": "/s/ Arthur D. Levinson            Director and Chair of the Board                   October 28, 2021",
    "section": "ANDREA JUNG",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 68,
    "text": "/s/ Ronald D. Sugar               Director                                          October 28, 2021",
    "section": "MONICA LOZANO",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 69,
    "text": "/s/ Susan L. Wagner               Director                                          October 28, 2021",
    "section": "RONALD D. SUGAR",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  }
]