[
  {
    "chunk_id": 1,
    "text": "COMPANY: AAPL\nYEAR: 2019",
    "section": null,
    "type": "info",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 2,
    "text": "(Mark One)\n\n☒ ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "FORM 10-K",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 3,
    "text": "or\n\n☐ TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934",
    "section": "For the fiscal year ended September 30, 2023",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 4,
    "text": "(Exact name of Registrant as specified in its charter)",
    "section": "Apple Inc.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 5,
    "text": "(State or other jurisdictionof incorporation or organization)    (I.R.S. Employer Identification No.)",
    "section": "California                                                       94-2404110",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 6,
    "text": "Cupertino, California                                            95014\n\n(Address of principal executive offices)                         (Zip Code)\n\n(408) 996-1010\n\n(Registrant's telephone number, including area code)",
    "section": "One Apple Park Way",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 7,
    "text": "1.375% Notes due 2024                       --                 The Nasdaq Stock Market LLC\n\n0.000% Notes due 2025                       --                 The Nasdaq Stock Market LLC\n\n0.875% Notes due 2025                       --                 The Nasdaq Stock Market LLC\n\n1.625% Notes due 2026                       --                 The Nasdaq Stock Market LLC\n\n2.000% Notes due 2027                       --                 The Nasdaq Stock Market LLC\n\n1.375% Notes due 2029                       --                 The Nasdaq Stock Market LLC\n\n3.050% Notes due 2029                       --                 The Nasdaq Stock Market LLC\n\n0.500% Notes due 2031                       --                 The Nasdaq Stock Market LLC\n\n3.600% Notes due 2042                       --                 The Nasdaq Stock Market LLC",
    "section": "Common Stock, $0.00001 par value per share  AAPL               The Nasdaq Stock Market LLC",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 8,
    "text": "15,552,752,000 shares of common stock were issued and outstanding as of October 20, 2023.",
    "section": "The aggregate market value of the voting and non-voting stock held by non-affiliates of the Registrant, as of March 31, 2023, the last business day of the Registrant's most recently completed second fiscal quarter, was approximately $2,591,165,000,000. Solely for purposes of this disclosure, shares of common stock held by executive officers and directors of the Registrant as of such date have been excluded because such persons may be deemed to be affiliates. This determination of executive officers and directors as affiliates is not necessarily a conclusive determination for any other purposes.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 9,
    "text": "iPhone\n\niPhone® is the Company's line of smartphones based on its iOS operating system. The iPhone line includes iPhone 15 Pro, iPhone 15, iPhone 14, iPhone 13 and iPhone SE®.\n\nMac\n\nMac® is the Company's line of personal computers based on its macOS® operating system. The Mac line includes laptops MacBook Air® and MacBook Pro®, as well as desktops iMac®, Mac mini®, Mac Studio® and Mac Pro®.\n\niPad\n\niPad® is the Company's line of multipurpose tablets based on its iPadOS® operating system. The iPad line includes iPad Pro®, iPad Air®, iPad and iPad mini®.\n\nWearables, Home and Accessories",
    "section": "Products",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 10,
    "text": "Additionally, the Company faces significant competition as competitors imitate the Company's product features and applications within their products or collaborate to offer solutions that are more competitive than those they currently offer. The Company also expects competition to intensify as competitors imitate the Company's approach to providing components seamlessly within their offerings or work collaboratively to offer integrated solutions.",
    "section": "The Company has a minority market share in the global smartphone, personal computer and tablet markets. The Company faces substantial competition in these markets from companies that have significant technical, marketing, distribution and other resources, as well as established hardware, software and digital content supplier relationships. In addition, some of the Company's competitors have broader product lines, lower-priced products and a larger installed base of active devices. Competition has been particularly intense as competitors have aggressively cut prices and lowered product margins. Certain competitors have the resources, experience or cost structures to provide products at little or no profit or even at a loss. Some of the markets in which the Company competes have from time to time experienced little to no growth or contracted overall.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 11,
    "text": "Further, the Company has commercial relationships with other companies in the technology industry that are or may become subject to investigations and litigation that, if resolved against those other companies, could materially adversely affect the Company's commercial relationships with those business partners and materially adversely affect the Company's business, results of operations and financial condition. For example, the Company earns revenue from licensing arrangements with other companies to offer their search services on the Company's platforms and applications, and certain of these arrangements are currently subject to government investigations and legal proceedings.",
    "section": "The Company is also currently subject to antitrust investigations in various jurisdictions around the world, which can result in legal proceedings and claims against the Company that could, individually or in the aggregate, have a materially adverse impact on the Company's business, results of operations and financial condition. For example, the Company is the subject of investigations in Europe and other jurisdictions relating to App Store terms and conditions. If such investigations result in adverse findings against the Company, the Company could be exposed to significant fines and may be required to make changes to its App Store business, all of which could materially adversely affect the Company's business, results of operations and financial condition. The Company is also subject to litigation relating to the App Store, which has resulted in changes to the Company's business practices, and may in the future result in further changes.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 12,
    "text": "Conversely, a strengthening of foreign currencies relative to the U.S. dollar, while generally beneficial to the Company's foreign currency-denominated sales and earnings, could cause the Company to reduce international pricing or incur losses on its foreign currency derivative instruments, thereby limiting the benefit. Additionally, strengthening of foreign currencies may increase the Company's cost of product components denominated in those currencies, thus adversely affecting gross margins.",
    "section": "The weakening of foreign currencies relative to the U.S. dollar adversely affects the U.S. dollar value of the Company's foreign currency-denominated sales and earnings, and generally leads the Company to raise international pricing, potentially reducing demand for the Company's products. In some circumstances, for competitive or other reasons, the Company may decide not to raise international pricing to offset the U.S. dollar's strengthening, which would adversely affect the U.S. dollar value of the gross margins the Company earns on foreign currency-denominated sales.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 13,
    "text": "(1)As of September 30, 2023, the Company was authorized by the Board of Directors to purchase up to $90 billion of the Company's common stock under a share repurchase program announced on May 4, 2023, of which $15.9 billion had been utilized. During the fourth quarter of 2023, the Company also utilized the final $4.6 billion under its previous repurchase program, which was most recently authorized in April 2022. The programs do not obligate the Company to acquire a minimum amount of shares. Under the programs, shares may be repurchased in privately negotiated or open market transactions, including under plans complying with Rule 10b5-1 under the Exchange Act.\n\n(2)In August 2023, the Company entered into new accelerated share repurchase agreements (\"ASRs\"). Under the terms of the ASRs, two financial institutions committed to deliver shares of the Company's common stock during the purchase periods in exchange for up-front payments totaling $5.0 billion. The total number of shares ultimately delivered under the ASRs, and therefore the average repurchase price paid per share, is determined based on the volume-weighted average price of the Company's common stock during the ASRs' purchase periods, which end in the first quarter of 2024.\n\n* * *",
    "section": "Total                                             106,595                                                                                                                   $       74,069",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 14,
    "text": "S&P 500 Index                                  $               100                    $               104                    $               118                    $  161      $  136      $  160",
    "section": "Apple Inc.                                     $               100                    $               98                     $               204                    $  269      $  277      $  317",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 15,
    "text": "•iPad and iPad Pro;\n\n•Next-generation Apple TV 4K; and\n\n•MLS Season Pass, a Major League Soccer subscription streaming service.",
    "section": "First Quarter 2023:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 16,
    "text": "•MacBook Pro 14\", MacBook Pro 16\" and Mac mini; and\n\n•Second-generation HomePod.",
    "section": "Second Quarter 2023:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 17,
    "text": "•MacBook Air 15\", Mac Studio and Mac Pro;\n\n•Apple Vision Pro™, the Company's first spatial computer featuring its new visionOS™, expected to be available in early calendar year 2024; and\n\n•iOS 17, macOS Sonoma, iPadOS 17, tvOS 17 and watchOS 10, updates to the Company's operating systems.",
    "section": "Third Quarter 2023:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 18,
    "text": "•iPhone 15, iPhone 15 Plus, iPhone 15 Pro and iPhone 15 Pro Max; and\n\n•Apple Watch Series 9 and Apple Watch Ultra 2.",
    "section": "Fourth Quarter 2023:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 19,
    "text": "iPhone (1)                           $       200,583                (2)   %          $  205,489          7  %         $  191,973",
    "section": "Net sales by category:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 20,
    "text": "iPad (1)                             28,300                   (3)   %        29,292              (8)  %     31,862\n\nWearables, Home and Accessories (1)  39,845                   (3)   %        41,241              7    %     38,367",
    "section": "Mac (1)                              29,357                   (27)  %        40,177              14   %     35,190",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 21,
    "text": "(1)Products net sales include amortization of the deferred value of unspecified software upgrade rights, which are bundled in the sales price of the respective product.\n\n(2)Services net sales include amortization of the deferred value of services bundled in the sales price of certain products.\n\niPhone\n\niPhone net sales decreased 2% or $4.9 billion during 2023 compared to 2022 due to lower net sales of non-Pro iPhone models, partially offset by higher net sales of Pro iPhone models.\n\nMac",
    "section": "Total net sales                      $       383,285                (3)   %          $  394,328          8  %         $  365,817",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 22,
    "text": "iPad\n\niPad net sales decreased 3% or $1.0 billion during 2023 compared to 2022 due primarily to lower net sales of iPad mini and iPad Air, partially offset by the combined net sales of iPad 9th and 10th generation.\n\nWearables, Home and Accessories\n\nWearables, Home and Accessories net sales decreased 3% or $1.4 billion during 2023 compared to 2022 due primarily to lower net sales of Wearables and Accessories.",
    "section": "Mac net sales decreased 27% or $10.8 billion during 2023 compared to 2022 due primarily to lower net sales of laptops.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 23,
    "text": "Selling, general and administrative  $     24,932            (1)   %           $  25,094        14  %    $  21,973",
    "section": "Percentage of total net sales        8     %                       7   %                    6   %",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 24,
    "text": "Selling, General and Administrative\n\nSelling, general and administrative expense was relatively flat in 2023 compared to 2022.\n\n* * *",
    "section": "The year-over-year growth in R&D expense in 2023 was driven primarily by increases in headcount-related expenses.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 25,
    "text": "(In millions, except number of shares, which are reflected in thousands, and per-share amounts)",
    "section": "CONSOLIDATED STATEMENTS OF OPERATIONS",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 26,
    "text": "(In millions, except number of shares, which are reflected in thousands, and par value)",
    "section": "CONSOLIDATED BALANCE SHEETS",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 27,
    "text": "2023    September 24,\n\n2022    September 25,\n\n2021\n\nCash, cash equivalents and restricted cash, beginning balances                  $          24,977               $  35,929               $  39,789",
    "section": "September 30,",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 28,
    "text": "Increase/(Decrease) in cash, cash equivalents and restricted cash               5,760                (10,952)              (3,860)\n\nCash, cash equivalents and restricted cash, ending balances                     $          30,737               $  24,977               $  35,929",
    "section": "Cash used in financing activities                                               (108,488)            (110,749)             (93,353)",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 29,
    "text": "2023             2022          2021\n\niPhone (1)                           $       200,583                $     205,489            $  191,973",
    "section": "Net sales disaggregated by significant products and services for 2023, 2022 and 2021 were as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 30,
    "text": "iPad (1)                             28,300                 29,292                 31,862\n\nWearables, Home and Accessories (1)  39,845                 41,241                 38,367",
    "section": "Mac (1)                              29,357                 40,177                 35,190",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 31,
    "text": "(1)Products net sales include amortization of the deferred value of unspecified software upgrade rights, which are bundled in the sales price of the respective product.\n\n(2)Services net sales include amortization of the deferred value of services bundled in the sales price of certain products.",
    "section": "Total net sales                      $       383,285                $     394,328            $  365,817",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 32,
    "text": "Denominator:\n\nWeighted-average basic shares outstanding  15,744,231                16,215,963                16,701,272",
    "section": "Net income                                 $           96,995                    $     99,803                $  94,680",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 33,
    "text": "U.S. Treasury securities                   19,406              --         (1,292)        18,114        35                5,468              12,611\n\nU.S. agency securities                     5,736               --         (600)          5,136         36                271                4,829\n\nNon-U.S. government securities             17,533              6          (1,048)        16,491        --                11,332             5,159",
    "section": "Level 2 (1):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 34,
    "text": "Mortgage- and asset-backed securities      22,365              6          (2,735)        19,636        --                344                19,292",
    "section": "Municipal securities                       628                 --         (26)           602           --                192                410",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 35,
    "text": "U.S. Treasury securities                   25,134              --         (1,725)        23,409        338               5,091              17,980\n\nU.S. agency securities                     5,823               --         (655)          5,168         --                240                4,928\n\nNon-U.S. government securities             16,948              2          (1,201)        15,749        --                8,806              6,943",
    "section": "Level 2 (1):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 36,
    "text": "Mortgage- and asset-backed securities      22,553              --         (2,593)        19,960        --                53                 19,907",
    "section": "Municipal securities                       921                 --         (35)           886           --                266                620",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 37,
    "text": "(1)The valuation techniques used to measure the fair values of the Company's Level 2 financial instruments, which generally have counterparties with high credit ratings, are based on quoted market prices or model-driven valuations using significant inputs derived from or corroborated by observable market data.\n\n(2)As of September 30, 2023 and September 24, 2022, total marketable securities included $13.8 billion and $12.7 billion, respectively, that were restricted from general use, related to the State Aid Decision (refer to Note 7, \"Income Taxes\") and other agreements.\n\n* * *",
    "section": "Total (2)                                  $        183,061        $  11              $  (13,963)      $      169,109            $  23,646             $  24,658      $  120,805",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 38,
    "text": "(1)Derivative assets are measured using Level 2 fair value inputs and are included in other current assets and other non-current assets in the Consolidated Balance Sheet.\n\n(2)Derivative liabilities are measured using Level 2 fair value inputs and are included in other current liabilities and other non-current liabilities in the Consolidated Balance Sheet.",
    "section": "Interest rate contracts      $  1,367      $  --         $  1,367",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 39,
    "text": "2023            2022\n\nLong-term taxes payable              $       15,457                $  16,657",
    "section": "Other Non-Current Liabilities",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 40,
    "text": "A reconciliation of the provision for income taxes to the amount computed by applying the statutory federal income tax rate (21% in 2023, 2022 and 2021) to income before provision for income taxes for 2023, 2022 and 2021, is as follows (dollars in millions):\n\n\n2023             2022           2021",
    "section": "The foreign provision for income taxes is based on foreign pretax earnings of $72.9 billion, $71.3 billion and $68.7 billion in 2023, 2022 and 2021, respectively.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 41,
    "text": "Lease-Related Assets and Liabilities    Financial Statement Line Items        2023            2022\n\nRight-of-use assets:",
    "section": "The following table shows ROU assets and lease liabilities, and the associated financial statement line items, as of September 30, 2023 and September 24, 2022 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 42,
    "text": "2024                            $        1,719             $  196               $  1,915\n\n2025                            1,875               151              2,026\n\n2026                            1,732               120              1,852\n\n2027                            1,351               52               1,403\n\n2028                            1,181               34               1,215",
    "section": "Leases                                   Total",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 43,
    "text": "2013 - 2022 debt issuances:\n\nFixed-rate 0.000% - 4.650% notes                        2024 - 2062    $        101,322                   0.03% - 6.72%            $  111,824      0.03% - 4.78%",
    "section": "Interest Rate",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 44,
    "text": "Fixed-rate 4.000% - 4.850% notes                        2026 - 2053    5,250               4.04% - 4.88%                 --",
    "section": "Third quarter 2023 debt issuance:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 45,
    "text": "Less: Current portion of term debt                                     (9,822)                                           (11,128)",
    "section": "Total term debt                                                        105,103                                           110,087",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 46,
    "text": "2024                       $       9,943\n\n2025                       10,775\n\n2026                       12,265\n\n2027                       9,786\n\n2028                       7,800",
    "section": "The future principal payments for the Company's Notes as of September 30, 2023, are as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 47,
    "text": "A summary of the Company's RSU activity and related information for 2023, 2022 and 2021, is as follows:",
    "section": "Restricted Stock Units",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 48,
    "text": "RSUs granted                      89,363                                         $  116.33\n\nRSUs vested                       (145,766)                                      $  50.71\n\nRSUs canceled                     (13,948)                                       $  68.95",
    "section": "Balance as of September 26, 2020  310,778                                        $  51.58",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 49,
    "text": "RSUs granted                      91,674                                         $  150.70\n\nRSUs vested                       (115,861)                                      $  72.12\n\nRSUs canceled                     (14,739)                                       $  99.77",
    "section": "Balance as of September 25, 2021  240,427                                        $  75.16",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 50,
    "text": "RSUs granted                      88,768                                         $  150.87\n\nRSUs vested                       (101,878)                                      $  97.31\n\nRSUs canceled                     (8,144)                                        $  127.98",
    "section": "Balance as of September 24, 2022  201,501                                        $  109.48",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 51,
    "text": "2023           2022    2021\n\nShare-based compensation expense                                $     10,833           $     9,038        $  7,906",
    "section": "The following table shows share-based compensation expense and the related income tax benefit included in the Consolidated Statements of Operations for 2023, 2022 and 2021 (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 52,
    "text": "2024        $      4,258\n\n2025        2,674\n\n2026        3,434\n\n2027        1,277\n\n2028        5,878",
    "section": "The Company has entered into certain off-balance sheet commitments that require the future purchase of goods or services (\"unconditional purchase obligations\"). The Company's unconditional purchase obligations primarily consist of supplier arrangements, licensed intellectual property and content, and distribution rights. Future payments under noncancelable unconditional purchase obligations with a remaining term in excess of one year as of September 30, 2023, are as follows (in millions):",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 53,
    "text": "A reconciliation of the Company's segment operating income to the Consolidated Statements of Operations for 2023, 2022 and 2021 is as follows (in millions):\n\n\n2023               2022            2021",
    "section": "Operating income       $     12,066           $     11,569       $  9,817",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 54,
    "text": "(1)Includes corporate marketing expenses, certain share-based compensation expenses, various nonrecurring charges, and other separately managed general and administrative costs.\n\n* * *",
    "section": "Total operating income             $         114,301                  $     119,437              $  108,949",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 55,
    "text": "(1)China includes Hong Kong and Taiwan.\n\n* * *",
    "section": "Total long-lived assets  $        43,715                  $     42,117",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 56,
    "text": "A company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.",
    "section": "Definition and Limitations of Internal Control Over Financial Reporting",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 57,
    "text": "(i)pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company's assets;\n\n(ii)provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that the Company's receipts and expenditures are being made only in accordance with authorizations of the Company's management and directors; and\n\n(iii)provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company's assets that could have a material effect on the financial statements.\n\nManagement, including the Company's Chief Executive Officer and Chief Financial Officer, does not expect that the Company's internal controls will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of internal controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, any evaluation of the effectiveness of controls in future periods are subject to the risk that those internal controls may become inadequate because of changes in business conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\nManagement's Annual Report on Internal Control over Financial Reporting",
    "section": "The Company's internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. The Company's internal control over financial reporting includes those policies and procedures that:",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 58,
    "text": "(a)Documents filed as part of this report\n\n(1)All financial statements",
    "section": "Item 15. Exhibit and Financial Statement Schedules",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 59,
    "text": "*Ernst & Young LLP, PCAOB Firm ID No. 00042.\n\n(2)Financial Statement Schedules",
    "section": "Reports of Independent Registered Public Accounting Firm*                                                                            49",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 60,
    "text": "(3)Exhibits required by Item 601 of Regulation S-K (1)",
    "section": "All financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and accompanying notes included in this Form 10-K.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 61,
    "text": "3.1      Restated Articles of Incorporation of the Registrant filed on August 3, 2020.                                                                                                                                                                                                                             8-K    3.1    8/7/20\n\n3.2      Amended and Restated Bylaws of the Registrant effective as of August 17, 2022.                                                                                                                                                                                                                            8-K    3.2    8/19/22\n\n4.1**    Description of Securities of the Registrant.\n\n4.2      Indenture, dated as of April 29, 2013, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee.                                                                                                                                                                            S-3    4.1    4/29/13\n\n4.3      Officer's Certificate of the Registrant, dated as of May 3, 2013, including forms of global notes representing the Floating Rate Notes due 2016, Floating Rate Notes due 2018, 0.45% Notes due 2016, 1.00% Notes due 2018, 2.40% Notes due 2023 and 3.85% Notes due 2043.                                 8-K    4.1    5/3/13\n\n4.4      Officer's Certificate of the Registrant, dated as of May 6, 2014, including forms of global notes representing the Floating Rate Notes due 2017, Floating Rate Notes due 2019, 1.05% Notes due 2017, 2.10% Notes due 2019, 2.85% Notes due 2021, 3.45% Notes due 2024 and 4.45% Notes due 2044.           8-K    4.1    5/6/14\n\n4.5      Officer's Certificate of the Registrant, dated as of November 10, 2014, including forms of global notes representing the 1.000% Notes due 2022 and 1.625% Notes due 2026.                                                                                                                                 8-K    4.1    11/10/14\n\n4.6      Officer's Certificate of the Registrant, dated as of February 9, 2015, including forms of global notes representing the Floating Rate Notes due 2020, 1.55% Notes due 2020, 2.15% Notes due 2022, 2.50% Notes due 2025 and 3.45% Notes due 2045.                                                          8-K    4.1    2/9/15\n\n4.7      Officer's Certificate of the Registrant, dated as of May 13, 2015, including forms of global notes representing the Floating Rate Notes due 2017, Floating Rate Notes due 2020, 0.900% Notes due 2017, 2.000% Notes due 2020, 2.700% Notes due 2022, 3.200% Notes due 2025, and 4.375% Notes due 2045.    8-K    4.1    5/13/15\n\n4.8      Officer's Certificate of the Registrant, dated as of July 31, 2015, including forms of global notes representing the 3.05% Notes due 2029 and 3.60% Notes due 2042.                                                                                                                                       8-K    4.1    7/31/15\n\n4.9      Officer's Certificate of the Registrant, dated as of September 17, 2015, including forms of global notes representing the 1.375% Notes due 2024 and 2.000% Notes due 2027.                                                                                                                                8-K    4.1    9/17/15\n\n* * *",
    "section": "Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 62,
    "text": "4.10    Officer's Certificate of the Registrant, dated as of February 23, 2016, including forms of global notes representing the Floating Rate Notes due 2019, Floating Rate Notes due 2021, 1.300% Notes due 2018, 1.700% Notes due 2019, 2.250% Notes due 2021, 2.850% Notes due 2023, 3.250% Notes due 2026, 4.500% Notes due 2036 and 4.650% Notes due 2046.          8-K    4.1    2/23/16\n\n4.11    Supplement No. 1 to the Officer's Certificate of the Registrant, dated as of March 24, 2016.                                                                                                                                                                                                                                                                      8-K    4.1    3/24/16\n\n4.12    Officer's Certificate of the Registrant, dated as of August 4, 2016, including forms of global notes representing the Floating Rate Notes due 2019, 1.100% Notes due 2019, 1.550% Notes due 2021, 2.450% Notes due 2026 and 3.850% Notes due 2046.                                                                                                                8-K    4.1    8/4/16\n\n4.13    Officer's Certificate of the Registrant, dated as of February 9, 2017, including forms of global notes representing the Floating Rate Notes due 2019, Floating Rate Notes due 2020, Floating Rate Notes due 2022, 1.550% Notes due 2019, 1.900% Notes due 2020, 2.500% Notes due 2022, 3.000% Notes due 2024, 3.350% Notes due 2027 and 4.250% Notes due 2047.    8-K    4.1    2/9/17\n\n4.14    Officer's Certificate of the Registrant, dated as of May 11, 2017, including forms of global notes representing the Floating Rate Notes due 2020, Floating Rate Notes due 2022, 1.800% Notes due 2020, 2.300% Notes due 2022, 2.850% Notes due 2024 and 3.200% Notes due 2027.                                                                                    8-K    4.1    5/11/17\n\n4.15    Officer's Certificate of the Registrant, dated as of May 24, 2017, including forms of global notes representing the 0.875% Notes due 2025 and 1.375% Notes due 2029.                                                                                                                                                                                              8-K    4.1    5/24/17\n\n4.16    Officer's Certificate of the Registrant, dated as of June 20, 2017, including form of global note representing the 3.000% Notes due 2027.                                                                                                                                                                                                                         8-K    4.1    6/20/17\n\n4.17    Officer's Certificate of the Registrant, dated as of August 18, 2017, including form of global note representing the 2.513% Notes due 2024.                                                                                                                                                                                                                       8-K    4.1    8/18/17\n\n4.18    Officer's Certificate of the Registrant, dated as of September 12, 2017, including forms of global notes representing the 1.500% Notes due 2019, 2.100% Notes due 2022, 2.900% Notes due 2027 and 3.750% Notes due 2047.                                                                                                                                          8-K    4.1    9/12/17\n\n4.19    Officer's Certificate of the Registrant, dated as of November 13, 2017, including forms of global notes representing the 1.800% Notes due 2019, 2.000% Notes due 2020, 2.400% Notes due 2023, 2.750% Notes due 2025, 3.000% Notes due 2027 and 3.750% Notes due 2047.                                                                                             8-K    4.1    11/13/17\n\n4.20    Indenture, dated as of November 5, 2018, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee.                                                                                                                                                                                                                                  S-3    4.1    11/5/18\n\n4.21    Officer's Certificate of the Registrant, dated as of September 11, 2019, including forms of global notes representing the 1.700% Notes due 2022, 1.800% Notes due 2024, 2.050% Notes due 2026, 2.200% Notes due 2029 and 2.950% Notes due 2049.                                                                                                                   8-K    4.1    9/11/19\n\n4.22    Officer's Certificate of the Registrant, dated as of November 15, 2019, including forms of global notes representing the 0.000% Notes due 2025 and 0.500% Notes due 2031.                                                                                                                                                                                         8-K    4.1    11/15/19\n\n4.23    Officer's Certificate of the Registrant, dated as of May 11, 2020, including forms of global notes representing the 0.750% Notes due 2023, 1.125% Notes due 2025, 1.650% Notes due 2030 and 2.650% Notes due 2050.                                                                                                                                                8-K    4.1    5/11/20\n\n4.24    Officer's Certificate of the Registrant, dated as of August 20, 2020, including forms of global notes representing the 0.550% Notes due 2025, 1.25% Notes due 2030, 2.400% Notes due 2050 and 2.550% Notes due 2060.                                                                                                                                              8-K    4.1    8/20/20\n\n4.25    Officer's Certificate of the Registrant, dated as of February 8, 2021, including forms of global notes representing the 0.700% Notes due 2026, 1.200% Notes due 2028, 1.650% Notes due 2031, 2.375% Notes due 2041, 2.650% Notes due 2051 and 2.800% Notes due 2061.                                                                                              8-K    4.1    2/8/21\n\n4.26    Officer's Certificate of the Registrant, dated as of August 5, 2021, including forms of global notes representing the 1.400% Notes due 2028, 1.700% Notes due 2031, 2.700% Notes due 2051 and 2.850% Notes due 2061.                                                                                                                                              8-K    4.1    8/5/21\n\n4.27    Indenture, dated as of October 28, 2021, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee.                                                                                                                                                                                                                                  S-3    4.1    10/29/21\n\n4.28    Officer's Certificate of the Registrant, dated as of August 8, 2022, including forms of global notes representing the 3.250% Notes due 2029, 3.350% Notes due 2032, 3.950% Notes due 2052 and 4.100% Notes due 2062.                                                                                                                                              8-K    4.1    8/8/22\n\n* * *",
    "section": "Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 63,
    "text": "4.29       Officer's Certificate of the Registrant, dated as of May 10, 2023, including forms of global notes representing the 4.421% Notes due 2026, 4.000% Notes due 2028, 4.150% Notes due 2030, 4.300% Notes due 2033 and 4.850% Notes due 2053.    8-K     4.1      5/10/23\n\n4.30*      Apple Inc. Deferred Compensation Plan.                                                                                                                                                                                                       S-8     4.1      8/23/18\n\n10.1*      Apple Inc. Employee Stock Purchase Plan, as amended and restated as of March 10, 2015.                                                                                                                                                       8-K     10.1     3/13/15\n\n10.2*      Form of Indemnification Agreement between the Registrant and each director and executive officer of the Registrant.                                                                                                                          10-Q    10.2     6/27/09\n\n10.3*      Apple Inc. Non-Employee Director Stock Plan, as amended November 9, 2021.                                                                                                                                                                    10-Q    10.1     12/25/21\n\n10.4*      Apple Inc. 2014 Employee Stock Plan, as amended and restated as of October 1, 2017.                                                                                                                                                          10-K    10.8     9/30/17\n\n10.5*      Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 26, 2017.                                                                                                                             10-K    10.20    9/30/17\n\n10.6*      Form of Restricted Stock Unit Award Agreement under Non-Employee Director Stock Plan effective as of February 13, 2018.                                                                                                                      10-Q    10.2     3/31/18\n\n10.7*      Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of August 21, 2018.                                                                                                                                10-K    10.17    9/29/18\n\n10.8*      Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of August 21, 2018.                                                                                                                                          10-K    10.18    9/29/18\n\n10.9*      Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 29, 2019.                                                                                                                             10-K    10.15    9/28/19\n\n10.10*     Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of September 29, 2019.                                                                                                                                       10-K    10.16    9/28/19\n\n10.11*     Form of Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of August 18, 2020.                                                                                                                                10-K    10.16    9/26/20\n\n10.12*     Form of Performance Award Agreement under 2014 Employee Stock Plan effective as of August 18, 2020.                                                                                                                                          10-K    10.17    9/26/20\n\n10.13*     Form of CEO Restricted Stock Unit Award Agreement under 2014 Employee Stock Plan effective as of September 27, 2020.                                                                                                                         10-Q    10.1     12/26/20\n\n10.14*     Form of CEO Performance Award Agreement under 2014 Employee Stock Plan effective as of September 27, 2020.                                                                                                                                   10-Q    10.2     12/26/20\n\n10.15*     Apple Inc. 2022 Employee Stock Plan.                                                                                                                                                                                                         8-K     10.1     3/4/22\n\n10.16*     Form of Restricted Stock Unit Award Agreement under 2022 Employee Stock Plan effective as of March 4, 2022.                                                                                                                                  8-K     10.2     3/4/22\n\n10.17*     Form of Performance Award Agreement under 2022 Employee Stock Plan effective as of March 4, 2022.                                                                                                                                            8-K     10.3     3/4/22\n\n10.18*     Apple Inc. Executive Cash Incentive Plan.                                                                                                                                                                                                    8-K     10.1     8/19/22\n\n10.19*     Form of CEO Restricted Stock Unit Award Agreement under 2022 Employee Stock Plan effective as of September 25, 2022.                                                                                                                         10-Q    10.1     12/31/22\n\n10.20*     Form of CEO Performance Award Agreement under 2022 Employee Stock Plan effective as of September 25, 2022.                                                                                                                                   10-Q    10.2     12/31/22\n\n21.1**     Subsidiaries of the Registrant.\n\n23.1**     Consent of Independent Registered Public Accounting Firm.\n\n24.1**     Power of Attorney (included on the Signatures page of this Annual Report on Form 10-K).\n\n31.1**     Rule 13a-14(a) / 15d-14(a) Certification of Chief Executive Officer.\n\n31.2**     Rule 13a-14(a) / 15d-14(a) Certification of Chief Financial Officer.\n\n32.1***    Section 1350 Certifications of Chief Executive Officer and Chief Financial Officer.\n\n101**      Inline XBRL Document Set for the consolidated financial statements and accompanying notes in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K.\n\n* * *",
    "section": "Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 64,
    "text": "104**    Inline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n\n*Indicates management contract or compensatory plan or arrangement.\n\n**Filed herewith.\n\n***Furnished herewith.\n\n(1)Certain instruments defining the rights of holders of long-term debt securities of the Registrant are omitted pursuant to Item 601(b)(4)(iii) of Regulation S-K. The Registrant hereby undertakes to furnish to the SEC, upon request, copies of any such instruments.",
    "section": "Period End Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 65,
    "text": "Date: November 2, 2023  Apple Inc.\n\n\nBy:    /s/ Luca Maestri",
    "section": "Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 66,
    "text": "KNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Timothy D. Cook and Luca Maestri, jointly and severally, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof.",
    "section": "Power of Attorney",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 67,
    "text": "/s/ Timothy D. Cook               Chief Executive Officer and Director\n\n(Principal Executive Officer)     November 2, 2023",
    "section": "Name                              Title                                             Date",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 68,
    "text": "/s/ Luca Maestri                  Senior Vice President, Chief Financial Officer\n\n(Principal Financial Officer)     November 2, 2023",
    "section": "TIMOTHY D. COOK",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 69,
    "text": "/s/ Chris Kondo                   Senior Director of Corporate Accounting\n\n(Principal Accounting Officer)    November 2, 2023",
    "section": "LUCA MAESTRI",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 70,
    "text": "/s/ James A. Bell                 Director                                          November 2, 2023",
    "section": "CHRIS KONDO",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 71,
    "text": "/s/ Arthur D. Levinson            Director and Chair of the Board                   November 2, 2023",
    "section": "ANDREA JUNG",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 72,
    "text": "/s/ Ronald D. Sugar               Director                                          November 2, 2023",
    "section": "MONICA LOZANO",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  },
  {
    "chunk_id": 73,
    "text": "/s/ Susan L. Wagner               Director                                          November 2, 2023",
    "section": "RONALD D. SUGAR",
    "type": "section",
    "company": "AAPL",
    "year": "2019"
  }
]